[{"source":"abc-news","titles":["UN rights investigator Agnes Callamard named Amnesty chief","100 new coronavirus cases at day care linked to UK variant outbreak: Officials","4 police investigated in woman's death in Mexican resort","Mexico leader descries beer, milk production in arid areas","Serial killer on federal death row dies at Indiana hospital","'Tragic': 3 kids among 5 dead after Arkansas apartment fire","2 killed, 1 wounded in shooting at convenience store","Bomb squad called in after resident finds active Civil War cannonball","5 dead after helicopter crash in Alaskan glacier","Miami Beach residents protest against chaos caused by spring breakers","Dallas street renamed for man killed by ex-cop in apartment","Infant found alive after Egypt building collapse","US lawmakers decry violence against Asians in Georgia visit","Hundreds of migrants intercepted off the coast of Libya","Biden economic plan to focus 1st on infrastructure this week","Helicopter crashes in Alaska killing 5, seriously injuring 1","Former Trump adviser takes prominent role in voting battle","Family of mother killed in road rage shooting sees outpouring of support","San Francisco 'dope lawyer' to the stars Brian Rohan dies","Auschwitz museum slams New Yorker Holocaust piece on Poland"]},{"source":"al-jazeera-english","titles":["US lawmaker calls for hate crime charges in Atlanta killings","Slovak PM to quit, swap role with finance minister to end crisis","‘Humanitarian time bomb’: 4,700 Venezuelans flee to Colombia","Syrian Kurds arrest several in anti-ISIL operation at al-Hol camp","Cuban protesters demand US lift trade embargo, sanctions","Serbia vaccinates thousands of foreigners against COVID-19","‘A miracle I survived’: Younger Brazilians hit by COVID surge","Dozens of ‘defenceless’ civilians killed in Mozambique attack","Why can't Mozambique secure Cabo Delgado province?","The fake and the real in American cancel culture","Mexico's COVID death toll much higher than previously reported","Venezuela slams Facebook ‘totalitarianism’ for Maduro page freeze","Can Eritrea’s Afwerki hold on to power after the Tigray war?","In Pictures: Holy Sepulchre church opens on Palm Sunday","Sudan gov’t and SPLM-N sign agreement to pave way for peace talks","Myanmar army air raids on Karen force 3,000 to flee for Thailand","Armenia PM confirms he will step down to allow early election","‘Stakes extremely high’ as US readies for Chauvin trial","Project Force: AI and the military – a friend or foe?","Inequality, race and pseudoscience"]},{"source":"associated-press","titles":["Horschel outlasts Scheffler in sloppy final of Match Play","Panthers' Ekblad taken off ice on stretcher with leg injury","Inside job: Michigan goes to the paint to top FSU 76-58","Utah GOP official who dismissed harassment claims resigns","Houston, Oregon State bring defensive focus to Midwest final","Many Brazilians disregard the pleas to stay at home...","Jurors face heavy burden...","Andre Drummond says he's joining LA Lakers for playoff race","Predators sign defenseman David Farrance to entry-level deal","Joel Dahmen wins at windy Punta Cana for 1st PGA Tour title","Elite 8 matchup pits coaches succeeding in family business","Final Four drought will end for either Baylor or Arkansas","Red Wings score 3 in 3rd period to surge past Jackets 4-1","Mexico leader descries beer, milk production in arid areas","La. Tech rallies, beats Colorado St. in NIT consolation game","'Tragic': 3 kids among 5 dead after Arkansas apartment fire","Lawmakers consider raises for state, higher ed employees","Highly regarded prospect Jazz Chisholm wins Marlins' 2B job","MadBum gets opening day start on mound for Diamondbacks"]},{"source":"axios","titles":["U.S. border agency projects surge in child migrant crossings to last at least 7 months","Secretary of State Blinken evades question on punishing China for COVID handling","Two top Democrats want support from at least 10 Republicans for gun background check bill","A progressive group plans to spend millions connecting green energy to jobs","New Jersey parents sue school districts to force them to reopen","As Dems control Washington, GOP flexes power in states and courts","White House aide: U.S. will address border surge with diplomacy","Sen. Warnock says Biden's stance on voting rights reminds him of Lyndon Johnson","At least 19 wounded in bombing at Indonesian church","U.S. defense chiefs sign international statement condemning Myanmar military violence","The key to opening schools: Better air flow","In photos: World's landmarks go dark for Earth Hour","Florida's DeSantis threatens lawsuit if CDC doesn't enable U.S. cruises to resume by summer","Iran, China sign 25-year cooperation agreement","The centuries-long history of anti-Asian racism and violence in the U.S.","Suez Canal update: Ship still stuck, but officials hoping to make use of high tide","What kids really want to read: Owls beat chickens but poop is king","U.S. fears China attack on Taiwan","Myanmar security forces kill at least 90 people","\"The Expanse\" offers a realistic depiction of space colonization"]},{"source":"breitbart-news","titles":["VIDEO: Veteran Receives over 150 Cards to Celebrate His 90th Birthday","SD House Speaker to Reject Gov. Kristi Noem’s Request to Rework Bill on Transgender Athletes","Morgan Wallen's 'Dangerous' Tops U.S. Album Chart for 10th Week","Previously Deported Illegal Alien Charged with Killing Two-Time Cancer Survivor","Border State Cops in Mexico Rescue Migrants Kidnapped by Gulf Cartel","Maxine Waters: Police Believe Their Job ‘Is to Keep Black People in Their Place’","Fauci Warns Parents about Children Playing Together Without Masks","VIDEO: Officer Hospitalized, Inmate Shot Dead After Hostage Situation at Oklahoma Jail","Poll: Almost 60 Percent of Adults Oppose Biden’s Border Chaos","Catalina Lauf: ‘Our Voices Are Going to Be Lost’ if True Republicans Not Elected","Chris Murphy Outlines Other Gun Laws Democrats Can Pursue Once Universal Background Checks Secured","Iowa Poll: Plurality Supports School Bathroom Use Matching Birth Gender","Sanctuary State Washington: Illegal Alien Convicted of Child Sexual Abuse","‘Bad Girls Club’ Star Deshayla Harris Killed in Virginia Beach Shootings","Jon Karl Defends Border Questions at Biden Presser: ‘Not Right-Wing Talking Points’","VIDEO – Suspect Allegedly Slashes NYC Boutique Worker’s Face: ‘He Cut Me and Ran’","Fauci: Pulling Back on Masks, Distancing ‘Premature’ — New Coronavirus Cases Remain High","Scarlett Johansson Says Politics ‘Not My Job’ — and Biden Win ‘Felt Like the End of a War,’ Brought Me to Tears","Teacher Allegedly Sexually Abused 14-Year-Old Girl for 4 Years","NAACP Image Awards Host Anthony Anderson: Biden-Harris ‘Can Truly Make America Great Again’"]},{"source":"cbs-news","titles":["Long-held Afghans released from Guantanamo prison","Would lifting Cuba embargo be game-changer for MLB?","Prosecutor in Michael Brown case opens up","Huge storm system on the move amid heavy holiday travel","Urgent rescue mission underway for endangered turtles","North Korea responds to Sony hacking accusation","U.S.-Cuba thaw puts papal diplomacy on display","NYPD officers killed in patrol car shooting","Minneapolis braces spotlight again as Chauvin trial set to begin","When is a deal really a deal?","Obama: \"America's resurgence is real\"","Deadly listeria outbreak linked to caramel apples","2-year-old hears mother's voice for the first time","GOP Rep. Mike Kelly offers Obama a lump of coal for Christmas","Chocolatier Jacques Torres shows off his new chocolate factory","The Plot to Kill Dr. Sievers","Chef Sean Brock brings southern comfort to The Dish","Exotic animals are the new \"must-have\" for wedding ceremonies","Using your frequent flyer miles is about to get tougher","As more networks live stream, is it time to cut the cord?"]},{"source":"cnn","titles":["EE.UU. cuestiona arresto de exfuncionarios del gobierno interino en Bolivia y pide su libertad y realizar una investigación independiente","There's no place in the US for this vile rhetoric","Operativos fronterizos entre México y Guatemala buscan controlar flujo migratorio y pandemia de covid-19, según ambos Gobiernos","Still not sure what NFTs are? 'SNL' explains with Eminem parody","مصدر قريب من جهود الإنقاذ يوضح لـCNN خيارات مصر لحل أزمة السفينة الجانحة بقناة السويس","Deshayla Harris, 'Bad Girls Club' star, identified as a Virginia Beach shooting victim","Mexico's Covid-19 death toll may be 60% higher than officially reported","يصنفونها \"زنديقة ومرتدة\".. كاتب إماراتي: نوال السعداوي شكلت تهديدًا للفقهاء والمحافظين","New York state leaders announce an agreement on a bill to legalize recreational marijuana","Biden administration working to develop a system for people to prove they've been vaccinated","حادث مروع لفتاة مصرية قادت سيارة بسرعة جنوبية الاتجاه المعاكس.. واصطدمت بشاحنة","Why Republicans aren't likely to budge on gun control","México revela que el número de muertos por covid-19 es casi un 60% más alto de lo que se informó oficialmente","سفير إيران في روسيا يدعو إلى ممر بديل لقناة السويس بعد أزمة السفينة الجانحة","توب 5: مصر تستعد لسيناريو \"صعب\" بقناة السويس.. وانفجار قرب كنيسة كاثوليكية في إندونيسيا","ANÁLISIS | Por qué la postura de Biden sobre la marihuana está 10 años por detrás de la curva","Dan Sullivan says he'll support fellow Alaska Sen. Lisa Murkowski if she runs for reelection","بلينكين مُلمحًا لـCNN: إدارة بايدن لن تتخذ إجراءات عقابية ضد الصين بسبب كورونا","عبدالله بن زايد ووزير خارجية الصين يدشنا أول خط إنتاج وتصنيع لقاح كورونا بالإمارات"]},{"source":"fox-news","titles":["White House lists ‘Biden-Harris administration’ on official website","Antifa 'armed' rioters descend on Oregon State Capitol","Michigan goes to the paint to top FSU 76-58","Nashville, TN mayor declares state of emergency in response to deadly flooding","Duckworth to speak on GWU alumni panel after saying ‘we should listen to the argument’ for taking down statues","Gun reform stands little chance of passing through Senate, even with a Democratic majority","Trevor Lawrence no fan of Lil Nas X's 'Satan shoes'","Texas Democrat shares new photos of migrant kids being held at the southern border","Stanford romps into Elite Eight, 89-62 over Missouri State","Europe's top teams win WC qualifiers as Swiss move goalposts","White House reporter accuses Pakistani immigrant's son of pushing 'far-right narratives' for DC murder concern","Ohio Christian college professor who rejected transgender student's pronouns can sue university, court rules","Biden admin asks for government volunteers at the border amid crisis","Booker's 35 points leads Suns past Hornets 101-97 in OT","Indiana Hoosiers to hire Mike Woodson as coach","Unbeaten Zags keep rolling with 83-65 rout of Creighton","Lady Gaga shares birthday post, shouts out her boyfriend and dogs: 'All I need'","Missouri mom dies after falling from resort balcony in Cancun","Scheffler and Horschel in All-American final for Match Play","DC police charge teen boys with carjacking as video resurfaces of botched teen girls' deadly carjacking"]},{"source":"google-news","titles":["Show HN: Note Making on WhatsApp","Show HN: Last Time – App that helps you remember the last time you did something",null,"La Academia de Marketing Online - Es pronto para rendirte | Episodio 46","Michihito Ando - SNSにおける研究者の情報発信のあり方について","Show HN: Simple Time Tracker","New for education sites: Practice problems and Math solver structured data","Show HN: Wikiyarn – Smarter way to browse Wikipedia","emergency plumber service San Francisco California","Emergency Plumbing Service San Jose California Articles","24 Hour Emergency Plumber San Jose California Logo.jpg","24 Hour Plumber San Jose California.jpg","24 Hr Plumber San Jose California.png","24 Hr Plumbing Services San Jose California.jpg","24hr Plumber San Jose California.jpg","24hour Plumber San Jose California.jpg","24 Hrs Plumber San Jose California.jpg","header for best blumbing san jose.jpg","Emergency Plumbing Services San Jose California.jpg","Emergency Plumbing San Jose California.jpg"]},{"source":"msnbc","titles":["Can you be fired for calling Trump crazy? Why this psychiatrist is taking Yale to court","Why QAnon keeps finding new 'clues' to obsess over","Ship stuck in the Suez Canal disrupts global trade, but makes good memes","Evanston, Ill. has made a down payment for national Black reparations","Even by GOP standards, Biden admin vaccine progress is impressive","Some very conservative judges made it easier for civilians to sue cops","Trump hosts the first of many 'Apprentice'-style Republican meetings","Why a red state wants to ignore voters, reject Medicaid expansion","Why Trump became the latest Republican to defend Jan. 6 rioters","With Georgia imposing radical voting restrictions, what happens now?","Whitewashing the filibuster erases its legacy of harming Black Americans","Biden's first press conference was substantive and thoughtful. Trump could never.","Unemployment claims improve, drop below major threshold","Manchin makes his case against his party's democracy reform package","7 right-wing myths, half-truths and lies about immigration that need to end","As momentum shifts, the filibuster rule is running out of friends","Senate Republicans look for new ways to justify anti-voting efforts","The problem with one GOP senator's case against 'Souls to the Polls'","Slack just blurred the line between work and home even more. Thanks, I hate it.","How one woman could bring down Trump's empire"]},{"source":"national-review","titles":["Psaki: Biden Admin ‘Absolutely Committed’ to Allowing Reporters into Border Facilities","Trump Says He’ll Probably Visit Border ‘over the Next Couple of Weeks’","Biden Official Asked GOP Senators to Delete Photos of Border Facilities, Senator Says","Jack Phillips Will Not Back Down: ‘Worth It to Fight’","Cuomo Aides Subpoenaed in Sexual-Harassment Probe","The Fed’s Shabby Green Logic","Sharon Osbourne Leaves The Talk amid Fallout from Piers Morgan Defense","Georgia Elections Officials Compare Dem ‘Voter Suppression’ Claims to Trump’s Fraud Allegations","San Francisco School Board Member Stripped of Position over Anti-Asian Tweets","Biden Labels New Georgia Voting Law an ‘Atrocity’","China’s Climate Realpolitik","CBO: ‘Our New Debt Projections Are Already Obsolete’","Oakland Implements First of Its Kind Race-Based Guaranteed Income Plan","Colorado Shooter Passed Background Check before Gun Purchase","Biden Nominates Joe Manchin’s Wife to Co-Chair Appalachian Regional Commission","The EU’s Vaccine Shambles — and How a Distrust of Free Markets Made It Worse","Former CDC Director Redfield Says He Believes Coronavirus Originated Inside a Wuhan Lab","Federal Judge Rules D.C.’s Capacity Limit on Churches is Unconstitutional","Dominion Voting Files $1.6B Lawsuit against Fox News","Democrats on the Filibuster: Then and Now"]},{"source":"nbc-news","titles":["Wisconsin lawmakers want to end party primaries in Congressional races","After Oklahoma pastor's murder, wife and alleged accomplice in love triangle arrested","Nike denies involvement with Lil Nas X 'Satan Shoes' containing human blood","Birx recalls 'very difficult' call with Trump, says hundreds of thousands of Covid deaths were preventable","Drunk rape victim was not 'mentally incapacitated,' Minnesota Supreme Court rules","With no specifics, White House says it's working on access to migrant centers","Biden economic plan to focus 1st on infrastructure this week","Want to understand how discriminatory gaslighting works? Look to Meghan and Harry","At least four people dead after Nashville floods, 130 rescued","Containers could be taken off stranded Suez ship, officials say as salvage efforts continue","Bomb squad detonates live Civil War cannonball found in Maryland","\"We felt safe at all times\": 5,000 fans pack Barcelona rock concert after Covid-19 tests","One dead and five wounded in stabbing at Vancouver library, suspect in custody","Governments delay access to public records during pandemic","Toomey, Murphy say expanded background checks on gun sales could pass Senate","The political impact of post-Covid positivity","In country known for whale hunts, pandemic has been good for the deep-sea giants","'An inflection point': Congress prepares for battle over massive voting rights bill","U.S. 'horrified' after Myanmar's bloodiest day since military coup","DoorDash pushes back at fee delivery commissions with new charges"]},{"source":"newsweek","titles":["'90 Day Fiancé' Spoilers: Are Brandon and Julia Married Now?","Fourth Stimulus Check Gains Support in Congress As Third Round is Still Being Sent","25 Hardest Cat Breeds to Take Care of","Adore Me Elite Box Wants to Change the Way You Shop for Lingerie","GM Denies Black-Owned Media Industry Leaders' Accusation That CEO Mary Barra Is Racist","'This Is Not a Zoo, Sir': Ted Cruz Posts Video From His Attempt to Film Border Facility","Parler Explains Why It Alerted FBI to Violent Posts, Users Still Mad: 'I Don't Like Snitches'","Megan Rapinoe Decries Legislation Banning Transgender Kids From Sports, 'Hurts Everyone'","Julia Letlow, Whose Husband Died From COVID, on GOP Vaccine Doubters: 'Use My Story'","Eric Trump Claims Undocumented Immigration 'Was Not a Problem Anymore' During Father's Presidency","GOP Senator Pat Toomey Says 'Make It More Difficult' for Dangerous People to Get Guns","Patty Murray's Signals Willingness to Overturn Filibuster, Could Boost Senate Democrats","Alaska GOP Sen. Dan Sullivan Breaks With Trump on Lisa Murkowski: 'I'm Going to Support Her'","Inside Mexico's Mysterious \"Bat Cave\" of Blind and Deaf Hanging Snakes","Lindsey Graham Slams Georgia Ban on Handing Voters Water: 'Doesn't Make a Whole Lot of Sense'","GOP Attorney Fined $10,000 for Bogus Election Challenges Against Ilhan Omar, Other Democrats","PS5 Restock Updates for Antonline, Best Buy, Newegg, Amazon, Walmart and More","GoFundMe For Mohammad Anwar, UberEats Driver Killed In Carjacking, Raises Over $390,000","72% of Americans Approve of Joe Biden's Handling of the Coronavirus Pandemic: Poll","Suez Canal's Stuck Ship Latest as Egypt Issues New Orders, Earlier Plan Fails"]},{"source":"new-york-magazine","titles":["Suez Canal Ship Is Still Stuck: Updates","How Johnson & Johnson’s Vaccine Became the Hot Shot","Now a Democrat Is Accused of Trying to Overturn the Election","Biden Doesn’t Need to Be FDR or LBJ to Change America","What Can Democrats Do About Georgia’s Voting-Rights Restrictions?","Microsoft Buying Discord Would Be 2021’s Best Acquisition","Israel’s Democracy Is Broken, and Netanyahu Is to Blame","21 Things on Sale You’ll Actually Want to Buy: From Chacos to Cuisinart","January 6 Commission Dies, As Republicans Oppose Focus on January 6","Dominion Voting Sues Fox News Over Election Fraud Claims","Republicans in Missouri and Georgia Turn Their Backs on Democracy","Trump Complains Government Is ‘Persecuting’ Capitol Rioters","What Did We Learn About Political Polling in 2020?","‘I Will Be 55 Before I Am Fully Free’","More States Open Vaccinations to All Adults","Amazon Called Out for Denying Workers Are Forced to Pee in Bottles","Georgia Republicans Take Revenge on Voting Rights","Key Moments From President Biden’s First News Conference","Manchin Values Bipartisanship Over Voting Rights","A Few Thoughts About the Big Boat"]},{"source":"politico","titles":["Heavy burden for jurors in case of George Floyd's death","Blinken punts on punishing China for coronavirus outbreak","Rep. Judy Chu ‘concerned’ Atlanta spa suspect may not be charged with hate crime","Warnock: ‘We have to pass voting rights no matter what’","N.Y. congressman: Border crisis due to decades and decades of bad U.S. behavior","Dissension inside The Washington Post","Graham blasts Biden for response to Georgia election law: He ‘played the race card’","'Things really are very bad' — Biden navigates cyber attacks without a cyber czar","‘He’s toast’: GOP leaves Raffensperger twisting in the wind","If Matthew McConaughey Runs for Office, Which Role Should He Reprise for the Campaign Trail?","Senate faces a new post-tragedy quagmire as anti-Asian hate crimes rise","Collins avoids state-party censure after voting to convict Trump","China sanctions U.S., Canadian officials over Xinjiang","'Be aware': The Pentagon's target list for extremist infiltrators — right and left","DeSantis hires top GOP operative for 2022 campaign","POLITICO Playbook: Boehner backs House incumbent targeted by Trump","Iran, China sign strategic long-term cooperation agreement","Atlanta massacre sparks a political awakening in the Korean church","An Ex-King, Missing Millions and a Monarchy in Crisis","High anxiety over federal weed loophole"]},{"source":"reddit-r-all","titles":["/r/privacy/ AMA – I'm Gaël Duval, founder of the de-googled Android OS /e/","Pockit Modular computing demo [video]","An update on the recent issues surrounding a Reddit employee","Over twenty subs including default subs have gone private","Untitled (https://www.reddit.com/r/assholedesign/comments/mapa8q/i_cancelled_our_subscription_with_hp_and_they/)","r/UKPolitics sub-Reddit targeted by Reddit admins","The absolute worst scenario happened","Business Logic in Django Rest framework : django","GraphWrap: extend your Django REST Framework API with a GraphQL interface with just two of lines of code. : django","My recommendation to learn Django : django","Piracy, Overcoming Gravity, and the Digital Edition","My bank sent me 64 copies of the same debit card","YouTube doesn't handle space anymore","Florida is suffering from an epidemic of bald men renting billboards that need to be extended in order to fit their bald heads.","Django admin looks dated and is not mobile friendly, any better options ? : django","Reddit: Online Presence Indicators","Namecheap just snaked another domain off me","Any open source DRF projects? : django","I want this guy working on the unit tests : ProgrammerHumor"]},{"source":"reuters","titles":["Venezuela's Maduro proposes paying for coronavirus vaccines with oil - Reuters UK","Indonesia's Pertamina says five hurt in massive oil refinery fire","Column: Market braces for USDA grain stocks amid trust issues with past data - Braun","Column: Funds forge most bullish CBOT corn view since February 2011 -Braun","Falcons restructure contract of LB Deion Jones","100 Thieves sweep, oust Dignitas in Mid-Season Showdown","Top-seeded Michigan pulls away to rout Florida State","Saudi Crown Prince discusses Green Initiative with Arab leaders - Reuters Africa","News Corp nears agreement to buy Houghton Mifflin Harcourt's consumer-publishing arm: WSJ - Reuters","More than a fifth of small UK exporters have temporarily halted EU sales - Reuters","CORRECTED-Japan's MUFG, Sumitomo face climate votes at AGMs as activism grows","RPT-Large fire at Indonesia's Balongan oil refinery in West Java media","Florida big man Colin Castleton declares for NBA draft","Birx says COVID death toll in U.S. would have been mitigated with earlier action","Canadian police charge man with murder after fatal stabbing at North Vancouver library","Indiana hires Mike Woodson as head coach","Report: Twins sign RHP Randy Dobnak to 5-year deal","Large fire at Indonesia's Balongan oil refinery in West Java: media","China generated over half world's coal-fired power in 2020: study - Reuters"]},{"source":"the-american-conservative","titles":["The Miseducation of Boston’s Elite","Dana Gioia’s Timeless Piety","How the Deadlift Will Save Your Life","The Left-Wing Network Supporting Border ‘Welcome Centers’","Hanging Separately Doesn’t Sound so Bad","Biden Administration Still Silent About Tyranny in Bahrain","We Will Suffer for Failing to Weigh Risks","Remembering the Green Corn Rebellion","Farms Are Coming to Cities","How to Enact Rational Filibuster Reform","Election Reform: More Access and More Security","Biden Amps Up the Immigration Delivery System","‘Send Them Here!’","Obama is Right About Disaffection","Henry James and Victimhood Culture","Modern Monetary Theory for Conservatives","For Eric Greitens and Mo Brooks, Ambitions at Last Indulged","Tucker Carlson Is Right About the Military","The Return of the Quiet American","Aristotle and Our American Oligarchy"]},{"source":"the-hill","titles":["Buttigieg charms Washington with his accessibility","Biden under pressure to spell out Cuba policy","Biden's trade chief says US won't be lifting tariffs on China","Biden lays groundwork for environmental regulations","Woody Allen gives rare interview that aired after 'Allen v. Farrow' documentary series release","Serbia vaccinates almost 10,000 people from neighboring countries","GOP representative-elect urges Republicans to get vaccinated after husband's coronavirus death","Duckworth doesn't rule out running for president: 'Maybe if it's good for the country'","Biden faces decision time on eviction moratorium","Reforming international trade is essential for Biden admin. — and sugar should be a test case","Calls grow for national paid family leave amid pandemic","Stabbing at Vancouver library leaves 1 dead, 5 wounded","Myanmar troops open fire at funeral","Nashville floods leave 4 dead, 130 rescued","Five things to know about the cargo ship blocking the Suez Canal","CDC rejects cruise company request to sail in July","Pope says devil taking advantage of pandemic in Palm Sunday service","Caregivers at migrant sites waived from FBI checks","Graham says Biden playing 'race card' on Georgia election law changes","Infrastructure bill won't include mileage tax: DOT spokesperson"]},{"source":"the-huffington-post","titles":[]},{"source":"the-washington-post","titles":["A Suez Canal village, like the world, grapples with the giant ship stuck in its backyard","Stranded dog rescued from Potomac River railroad bridge in Washington - The Washington Post","GOP candidate from New Jersey accused of pandering after he transforms into cowboy for Texas run","A family seeks and can’t find answers as one of their own is accused of 10 murders in Boulder mass shooting - The Washington Post","Nationals’ Carter Kieboom is swinging through the disappointment of being sent down","‘Don’t count us out’: Senators see bipartisan support for gun background checks in wake of mass shootings","NASCAR’s dirt race at Bristol postponed after flooding turns clay-coated oval into mud pit - The Washington Post","Strong to severe storms likely late this afternoon and early evening","Police fatally shot a jail inmate after an officer was taken hostage and cells were unlocked - Washington Post","At least four dead in Nashville after powerful storm triggers flash flooding","Biden to unveil major new spending plans as Democrats eye bigger role for government - The Washington Post","'Vaccine passports’ are on the way, but developing them won’t be easy","Joe Biden is a paradigm shifter","Derek Chauvin trial body cam footage - The Washington Post","How Max Scherzer, bold and brilliant on the mound, learned years ago to bet on himself","D.C.-area forecast: Mild today with early showers and strong to severe late-day storms","Raised to identify as Black, Harris steps into role as a voice for Asian Americans amid rise in hate incidents - The Washington Post","Russia's Putin pumps up the swagger in swipes at Biden","The Ever Given blocking the Suez Canal moved slightly, but a poor tide stopped its progress",null]},{"source":"the-washington-times","titles":["Robert Redfield, ex-CDC director, says COVID-19 likely came from lab: 'I'm allowed to have opinions'","SHARON STONE: Cancel culture stupidest thing I have ever seen...","4 being monitored for Ebola virus in Oregon, health officials say","Exclusive: GOP calls for AG Garland to extend ban on fentanyl knockoffs","Rachel Levine, transgender official, confirmed by Senate as assistant secretary of health","Army pulls the pin on 'gender neutral' combat fitness test; creates separate tiers for men, women","New York Times: Current aide accuses Cuomo of sex harassment","Ousted NEW YORK TIMES reporter slams newsroom's culture: 'Mean, spiteful, vengeful place'...","‘Three Warfares’: U.S. pummeled by covert disinformation war waged by Russia, China","About to learn his definition of 'fair share'...","Terror suspects part of border surge...","For Biden, there's no place like a weekend home in Delaware","Pentagon goes to war with FOXNEWS over 'feminizing' military...","NEXT: Gun Control?","Obama, Bush, Clinton, Carter push COVID-19 vaccination","Jay Bhattacharya, Stanford doctor: Lockdowns 'single worst public health mistake' in last 100 years","Justice Amy Coney Barrett riles conservatives with moderate rulings...","Illegal immigrants shouldn't be included in congressional count","'It is not right': Bill offers hope that flyers of CIA's Air America will finally win recognition","'Extraordinary crisis': Democrats' revolutionary climate change bill aims to remake U.S. economy"]},{"source":"time","titles":["Flash Flooding in Tennessee Leaves 4 Dead After Record Rains","Suicide Bombing Wounds 20 People During Palm Sunday Mass in Indonesia","New York Lawmakers Agree to Legalize Recreational Marijuana","“It’s Not Just About Shots.” Judith McKenna, Walmart International CEO, Talks Vaccination Rollout","I Found a Rainbow At the End of My Hunt For a Vaccine Appointment","‘We Not Human At All.’ Why the Fight to Unionize an Alabama Amazon Warehouse Could Spur a Labor Union Resurgence","Dozens Killed in Deadliest Day of Myanmar Coup","New Attempts Planned to Free Huge Ship Stuck in Suez Canal","2 Dead in Virginia Beach Oceanfront Shootings: Police","Beverly Cleary, Legendary Children’s Author Who Quietly Revolutionized Kid Lit, Dies at 104","With Six Minutes to Midnight, Eddie Izzard Spins an Unusually Gentle-Spirited Spy Tale","I Wear My Son’s Jacket to Remind Me Of What’s At Stake in Fighting Gun Violence","A Democrat Is Challenging the Election Result in Her District. Republicans Are Seizing the Moment","Joe Biden Proved a Press Conference Doesn’t Have to Be a Spectacle","Supreme Court ‘Seizure’ Ruling Set To Allow More Police Excessive Force Lawsuits To Move Forward","‘Garbage Freaking Everywhere’ as Americans Venture Outdoors After a Year of Lockdowns","The Father Offers an Unsparing Glimpse into the Trials, and the Mysteries, of Old Age","Netflix’s The Irregulars Isn’t a Great Sherlock Holmes Spinoff—But It’s Still a Lot of Fun","Netflix’s Serial Killer Drama The Serpent Is Nihilistic Murder Porn in Prestige True-Crime Packaging"]},{"source":"usa-today","titles":["Submission Underground 21 results: Women's champ Amanda Loewen takes out fifth UFC veteran","Ex-Gov. Andrew Cuomo aide was asked to sing 'Danny Boy' for him in 2019, attorney says","U.S. fails qualify for Olympic Games in men's soccer after loss to Honduras","6 biggest takeaways from UFC 260: Will Francis Ngannou vs. Jon Jones get fumbled?","Elite Eight or sent packing: Winners and losers from the men's NCAA Tournament Sweet 16","OL Max Garcia’s contract with Cardinals has little in guarantees","Winner’s Bag: Billy Horschel, WGC-Dell Technologies Match Play","How this small town of 16,000 near the US-Canada border has given out 50,000 vaccines","(6) USC vs. (7) Oregon live stream, NCAA March Madness, Sweet 16, TV channel, how to watch","Bears met with Virginia Tech first-round prospect, Christian Darrisaw - Chicago Bears Wire","Rested, relaxed Billy Horschel beats Scottie Scheffler to take WGC-Dell Technologies Match Play","No. 1 Michigan rolls No. 4 Florida State to reach men's Elite Eight in Juwan Howard's second season","Did Cordarrelle Patterson leave a hint about where he’ll be playing in 2021?","The Jets had no 4,000-yard passers in the 16-game era","Fight over filibuster heats up as Democrats and Republicans clash over voting rights","UFC 260 rookie report: Grading the lone newcomer in Las Vegas","New Celtic center Luke Kornet talks his debut, path to joining Boston","Opinion: Mike Woodson is in for rude awakening as Indiana men's basketball coach","Packers high on Iowa WR Ihmir Smith-Marsette","'Excited for this new chapter': Jason Derulo expecting first child with girlfriend Jena Frumes"]},{"source":"vice-news","titles":["Meet Australian designer behind the ‘warped vest’ we all want","Daily Horoscope: March 29, 2021","Wie man Fotos postet, ohne zu verraten, wann und wo sie entstanden sind","Daily Horoscope: March 28, 2021","Police Screamed at a 5-Year-Old and Told Him Handcuffs Would Be His ‘Best Friend’","Daily Horoscope: March 27, 2021","Ohhhh, Snap: The Tesla of Sex Toy Companies Has a New Vibrator","Beabadoobee and Christian Leave in conversation","Meghan McCain’s Hair Is a Hypocritical Mess","Boulder Shooting Suspect Bought His AR-15-Style ‘Pistol’ Legally","Léa Seydoux for Louis Vuitton and unlimited Telfar bags: What’s in fashion?","The Best Blue Light Glasses (That Also Make You Look Cooler)","We Are Way Too Invested In Celebrity Relationship Scandals","El Salvador Surfing Community In Mourning After Olympic Hopeful Katherine Díaz Killed By Lightning Strike","UN Peacekeeper Ordered to Pay Child Support for Baby He Abandoned","How to Make Small Talk After We've Been Through... a Pandemic","George Floyd Tribute Vandalized With His Toxicology Report: ‘Mix of Drugs Presents in Difficulty Breathing!’","People are ‘Revenge Shopping’, but what does 'Revenge Dressing' look like in 2021?","The Only Excuse You Need to Keep Your Webcam off Forever: Climate Change","Republican Legislator Is Very Sorry About His Harvey Weinstein-Themed Zoom Background"]}]