[{"source":"abc-news","titles":["Yemen rebels admit tear gas behind fire at migrant detention","5 nations demand better EU sharing of migration load","UN says 8 children killed, 33 wounded this month in Yemen","Thai police use tear gas, rubber bullets to break up protest","Prosecutor: Man charged with 1 murder confessed he killed 16","Half of UK adults have gotten one dose of COVID-19 vaccine","Pakistan court condemns 2 men to death in highway rape case","US businesses near border struggle with boundaries' closure","COVID long-haulers speak about living with brain fog, rancid smells and crushing fatigue","Asian women say shootings point to relentless, racist tropes","New Orleans health care workers' heralded in 'Dear Nurses'","Eruption of Iceland volcano easing, not affecting flights","Prosecutors throw the book at money launderer for Venezuela","Some NY nursing homes proved helpless in face of virus surge","Walt Disney World Minute with Tony Finau","Twitter to establish legal entity in Turkey, comply with law","2020 jobless benefits tax exempt up to $10,200: Explained","Germany: police clash with protesters against virus measures"]},{"source":"al-jazeera-english","titles":["Thailand: Police disperse protesters calling for monarchy reform","Guinea-Bissau's plan to lift logging ban sparks fears for forests","Guinea-Bissau’s plan to lift logging ban sparks fears for forests","Ecuador’s health minister resigns after just 19 days","Anger, condemnation after Turkey exits treaty to protect women","EU threatens to ban AstraZeneca exports if vaccines not delivered","Overseas fans banned from Tokyo Olympics over COVID fears","Qatar: Reforms to labour laws have ‘transformed’ the market","Pakistan Prime Minister Imran Khan tests positive for COVID","How a surfing revolution is riding the wave in India","Congo heading to polls as Nguesso seeks to extend 36-year reign","High-risk news coverage: Reporting the crackdown in Myanmar","Thanks to vaccines, this Newroz we have reason to be hopeful","Turkey’s Erdogan sacks central bank governor after rate hike","Largest asteroid of 2021 to make closest approach to Earth","Can Mario Draghi put a stop to Italy's economic decline?","Bolsonaro asks court to reverse Brazil’s COVID-19 restrictions","Allies of El Salvador’s Bukele win absolute majority in Congress","Turkey pulls out of treaty protecting women from violence","Iceland’s Fagradalsfjall erupts, lighting up sky near Reykjavik"]},{"source":"associated-press","titles":["Germany: Police clash with protesters against virus measures...","Prosecutor: Man charged with 1 murder says he killed 16","Thai police use tear gas, rubber bullets to break up protest","Nevada town sues for rights to water leaking from US canal","Ducey talks disdain for new education tax, vows fast fix","Half of UK adults have gotten one dose of COVID-19 vaccine","Lawmakers resist governor's plan to close 6 DMV offices","Legislature delivers virus aid, civil rights; falters on pot","SC House passed bill to combat catalytic converter theft","New Orleans, nonprofit say bike sharing to return Sept. 1","South Carolina Statehouse to get air cleaning devices","Asian women say shootings point to relentless, racist tropes","US businesses near border struggle with boundaries' closure","Texas' Schaefer knows how to win in March, Longhorns 'ready'","New Orleans health care workers' heralded in 'Dear Nurses'","Louisiana's suspension of jury trials amid pandemic ending","Some NY nursing homes proved helpless in face of virus surge","Oregon Tech faculty call for president's resignation - Associated Press","Major efforts underway to preserve River Farm as public land","For a year, woman has shared a window on our pandemic world"]},{"source":"axios","titles":["Axios Today podcast: The Iroquois Nationals' fight to the Olympics","Scoop: ICE securing hotel rooms to hold growing number of migrant families","How stalling growth hurts the planet","Here are the elections taking place this year","Axios-Ipsos poll: A year after calls for racial justice, politics divides sports fans even more","Trump's Mar-a-Lago partly closed amid coronavirus outbreak","Biden addresses anti-Asian violence: \"Our silence is our complicity\"","Exclusive: Pro-Biden group won’t disclose donors","GoFundMe for Atlanta victim's son tops $1.5 million in less than a day - Axios","Students defrauded by for-profit schools to receive loan forgiveness","Vegas bets on a COVID comeback","German health minister: Not enough vaccine doses to stop a third wave","AAPI community groups call on Biden to allocate $300 million to addressing anti-Asian hate","Biden beats his COVID vaccine goal, doling out 100 millionth dose","Rethinking government bailouts amid airline industry crisis","What we're driving: Volkswagen ID.4 electric SUV - Axios","CDC relaxes school guidance on social distancing during COVID-19","$15B SPAC deal between Apollo, Vista collapses","A full year of staggering and unprecedented job losses","Welcome to March Madness, sports betting's Super Bowl"]},{"source":"breitbart-news","titles":["Italian Media Enraged as French Museum Scraps Roman Numerals","Shots Fired at London Police as Met Reveals over 7,000 Assaults on Officers in One Year","Nolte: White House Says Joe Biden Was Knocked Over by Gust of Wind — I Believe It","Denmark to Combat 'Parallel Societies' by Limiting Non-Western Migrants to 30 Per Cent in Neighbourhoods","Pompeo: When China Sees Dems ‘Deeply Tied’ to BLM ‘They Sense That America May Well Be in Decline’ – Must Defend America’s Greatness","Farage: Media Ignoring Woman Murdered, Dismembered in Exeter as Suspect Is Asylum Seeker","Rand Paul: Fauci ‘Very Blasé and Unconcerned About Liberty’ — ‘Burden Should Be on the Gov’t’ to Prove Need to Dictate Behavior","Gov. Kristi Noem Sends Transgender Athletes Bill Back to Legislature for Changes","Afghan Charged with Child Endangerment After Son Drowned off Greek Coast","Judges Restore British Citizenship to Three Adult Islamic State Defectors","Maher: There Is a Problem of Violence Against Asians, Atlanta Shootings ‘Probably’ Aren’t Part of It","Egypt Prepares Move to Capital East of Cairo","Fauci: Fully Vaccinated People Don’t Need to Be Tested Unless They Have Symptoms","Chinese Media Blame Donald Trump and Tom Cotton for Anti-Asian Violence","China Arrests at Least Ten Christians in Raid of Private Bible Study","China Claims ‘Cooling Off’ Period Cut Wuhan Divorce Rate by over Half","Michael Cohen on NYC Trump Probe: You Are Going to See ‘Indictments Start Flying’","Ted Lieu: Trump Gave ‘Permission to Attack’ Asian-Americans","Weingarten: Updated CDC School Guidelines ‘Being Driven by Space Concerns, Not By Safety Concerns’","Joe Biden to Meet with Stacey Abrams During Georgia Visit"]},{"source":"cbs-news","titles":["How music training changes the brain","Couple makes history by rowing across the Atlantic","Headlines: L.A. Clippers co-owner Shelly Sterling intends to keep ownership of team","Wedding photography stopped to save life","Gugu Mbatha-Raw is turning heads in first starring film role","Anne Geddes on her iconic baby photos","Headlines at 8:30: Man being sued for negative comment on Amazon","House to vote on forming special committee to investigate Benghazi","Living organism made with artificial genetic code","DEA cracks down on synthetic drugs in 29 states","Pro-Russian separatists vow to proceed with independence vote","V.A. secretary to stay: Shinseki rejects calls to resign amid care concern","Worldwide outrage grows over Nigeria kidnappings","Angelina Jolie comments on kidnapped Nigerian girls","Russia's tone softens over Ukraine crisis","Student loan debt relief","5/7: New violence by Nigerian terrorists responsible for girls' kidnapping; GM reported airbag problem in 2007, documents show","Malala Yousafzai urges action to save abducted girls","NCAA apologizes for disparities between women's and men's facilities","Valerie Harper: \"Year and four months past my expiration date\""]},{"source":"cnn","titles":["\"قصة نجاح كبيرة\".. بريطانيا تعلن حصول نصف البالغين على أول جرعة من اللقاح","No vaccines, no leadership, no end in sight. How Brazil became a global threat","Idaho Legislature halts session until April due to Covid-19 outbreak among lawmakers and staff","سامية صلوحي.. من تكون أول رئيسة مسلمة في تاريخ تنزانيا وشرق إفريقيا؟","Teen Vogue's new editor out of a job after backlash over old tweets","Elsa Peretti, famed Tiffany & Co. jewelry designer, dies at 80","Police seize real gun disguised as Nerf toy in North Carolina drug raid","GoFundMe page for sons of Atlanta spa shooting victim raises over $2 million","Polls show how Gov. Cuomo's constituents are responding to controversies","Finnish astrophotographer spends 12 years creating a Milky Way mosaic","Biden administration off to a combative start with tough rhetoric on Russia, China","Imran Khan, Pakistan's Prime Minister, tests positive for Covid-19","Attorney general: Michigan pizzeria owner continuously violated Covid-19 measures","السلطات السعودية تعلن القبض على \"لص الرياض\" بعد فيديو صادم لسرقة امرأة","Should people not yet eligible for the vaccine get it anyway?","إصابة رئيس وزراء باكستان بفيروس كورونا بعد يومين من تلقيه أول جرعة من لقاح سينوفارم","كأنها بقعة من الجحيم.. لحظة ثوران بركان بعد أكثر من 900 عام في أيسلندا","Desafíos Globales | Myanmar tras el golpe militar, ¿qué está pasando?","5 big signs that travel is roaring back","How are the Atlanta spa shootings NOT a hate crime?"]},{"source":"fox-news","titles":["Dolphins release Isaiah Wilson after he skipped practices, was hours late for physical: reports","'Return to Amish' star Rosanna explains why she's leaving her religious community: 'Nothing will be the same'","NASA's Mars helicopter completes tests, nears historic flight","Bitcoin scams net bigger paydays as man loses $560K to fake Elon Musk","Indiana burglars steal Harley-Davidson motorcycles, drive out through front door","Google Incognito mode isn't so private: here's why","Khloé Kardashian says bullying comments, headlines affect her 'soul and confidence'","5 ways to take better photos and videos with your phone","House Republicans request briefing with HHS' Becerra over surge of minors at border","3 Amazon privacy settings you need to change now","Murray scores 34 points, Nuggets beat Bulls 131-127 in OT","Suns bounce back from loss, beat Timberwolves 113-101","Sister Jean gets the vaccine and seat at the NCAA Tournament","Fort Lauderdale police push back on reports of increased violence during spring break","'Sister Wives' star Christine Brown says she has more 'freedom' in a plural marriage than a monogamous union","McCollum, Lillard carry Blazers past Mavs, 125-119","Danica Patrick details what she's now looking for in a partner: 'I'm not willing to compromise'","Pulling NCAA upset can change trajectory of coach's career","Cruise to Patagonia, Antarctica will see total solar eclipse this December","Big Ten struggles early after earning 9 NCAA Tournament bids"]},{"source":"google-news","titles":["Cells at Work! CODE BLACK - Episode 9 - Calamity, Athlete's Foot, and the Meaning of Work","Cells at Work!! - Episode 7 - Cancer Cell II (Part I)","FEATURE: A Guide to the Re:ZERO Witches","RWBY Volume 8 - Episode 12 - Creation","Miami Dolphins cut tackle Isaiah Wilson after efforts to help him failed, source says - Miami Herald","《AV帝王說服術》：村西透如何讓從未在鏡頭前寬衣解帶的素人，輕而易舉的答應演出？","【小說】李琴峰《倒數五秒月牙》：我與實櫻之所以結識交好，契機是那場地震","【小說】《北方的光明星》選摘：我有帶兒子走的逃亡計畫，但怎麼能拋下妻子？","《從車諾比到北韓，12個瘋狂的冒險故事》：前進車諾比！「要是有執法人員問起，就說你們是科學家」","【小說】《北方的光明星》選摘：他官階太低，不配執行收集領袖屎尿的任務","【小說】王定國《美麗蒼茫》選摘：歐陽先生晚夏初秋的湖城之旅","Why Less Exercise Can Bring Better Results","联播+｜新发展理念指引习近平支招京津冀协同发展_石家庄新闻网 - 石家庄新闻网"]},{"source":"msnbc","titles":["Kendis Gibson and Lindsey Reiser talk to Oregon Women's Basketball forward Sedona Prince on MSNBC","Andrew Cuomo is the perfect example of why 'good guys' are so dangerous","Why is Fox News so obsessed with Vladimir Putin?","GA State Rep.: ‘It’s important to humanize how these Asian women lived’","Cohen assesses prosecutors have enough to charge Trump with or without Weisselberg","Dr. Fauci: ‘Don’t declare victory prematurely’","Biden, Harris extend support to Asian American community in wake of Georgia shootings","Trump card for Manhattan D.A.? Money man eyed in probe","'Looks like a hate crime': Mayor Bottoms calls for accountability after Atlanta killings","Senator Warnock: GOP Efforts to disenfranchise voters ‘a threat to democracy itself’","Sam Stein: The United States has a ‘tortured history’ with voter suppression","Rep. Eric Swalwell says ‘the greatest enablers of these domestic terrorist enemies’ are within Congress","Friday's Mini-Report, 3.19.21","Rep. Eleanor Holmes Norton on DC statehood, Capitol Hill fences","'Science is back': Biden thanks CDC for efforts amid Covid pandemic","George Takei: Law enforcement throughout American history has manipulated Asian Americans","Fulton County releases names of Atlanta spa shooting victims","CDC director explains why schools can now social distance at 3 feet","Teachers ask for better vaccine access amid new CDC social distancing guidelines","‘His death will not be in vain’: Baton Rouge nurse on helping others get vaccinated after losing husband to Covid-19"]},{"source":"national-review","titles":["CBP Asks to Fly Migrants to Canadian Border for Processing Amid Surge: Report","Current Cuomo Aide Is Eighth Woman to Allege Harassment","Dianne Feinstein’s Overnight Filibuster Flip Flop","Putting the Grift in ESG","Slandering the U.S. Military . . . Again","Good News from the European Museums","Religious Persecution Abroad Reminds Us Why Religious Liberty Matters","The Character Assassination of Elaine Chao","How Memory Works and Why It Fails","A Man-Made Disaster at the Border","Another Day, Another Completely False Narrative Spread All over the Media","If You Hold an Election for Mayor of New York, Will Anybody Show Up?","A Victory, but Miles to Go","The CCP’s Desperation Was on Full Display in Alaska","Oral Roberts!","‘Cuomo Faces New Claims of Sexual Harassment From Current Aide’","Justice Department, FBI Moving on Cuomo Nursing-Home Investigation","Largest Teachers’ Union ‘Concerned’ That New CDC Social-Distancing Rules Aren’t Justified by Science","Better Than Whose Originalism?","Anton’s Complaint"]},{"source":"nbc-news","titles":["Three decades later, St. Patrick's Day murder of 14-year-old Rachel Hurley remains unsolved","Man charged with one murder says he killed 16, prosecutors say","Four men linked to Proud Boys charged in plot to attack Capitol","Two Royal Caribbean lines to end yearlong pandemic hiatus in June","6-year-old girl fatally shot by relative over spilled water, police say","Sister Jean, 101, serves as good luck charm for Loyola during March Madness","How are we supposed to feel when the Covid pandemic finally ends?","One dead, 10 injured in separate Texas nightclub shootings","Deadly California fireworks explosion caused $3.2 million in damage","'A tragedy': Biden rescinded the 'Muslim ban' but families remain apart","Tokyo 2020: International fans will be barred from Olympic Games because of Covid-19 pandemic","Tsunami advisory issued after magnitude 7.2 earthquake strikes off Japan's coast","Covering Italy's Covid crisis is his job. Then it took a personal turn.","The model minority myth says all Asians are successful. Why that's dangerous.","'Chaotic situation': Puerto Ricans indignant at tourists breaking Covid mandates","Unbearable pain: How bear spray became a prized weapon for violent protesters","'Spoiled, ungrateful millionaires:' Meghan and Harry's Oprah interview divides Britons and Americans","Oscar-winning directors of Tina Turner documentary on doing justice to her story","Justin Bieber's new 'wife guy' album is earnestly cheesy — and catchy as hell","Letters of recommendation only ensure that the privileged stay privileged"]},{"source":"newsweek","titles":["'Marvel's Avengers' PS5 Save Transfer Mess Prompts Xbox Lead to Explain Smart Delivery","Texas Governor Greg Abbott Says Water Unsafe at Federal Facility for Migrant Children","How to Apply for FEMA Funeral Funds up to $7,000—the Rules Explained","PS5 Restock Update for Amazon, Newegg, Walmart, Best Buy and More","Heritage Foundation Mocked for Defending British Monarchy From American 'Radical Left'","Donald Trump Jr. Says Military 'Politicized,' Knocks Stunt Against Marjorie Taylor Greene","Not Had Your $1,400 Stimulus Payment Yet? These Are the Key IRS Dates to Know","Denmark Reports One Death After Use of AstraZeneca Vaccine, Will Maintain Suspension","Dr. Fauci Warns of Possible COVID Surge in U.S. After European Uptick","11 of the Best Rosé Wines You Can Buy Online","Majority of Black Health Care Workers Doubt COVID-19 Vaccines Safe, Poll Finds","Russia's U.S Envoy Says Americans Are Apologizing for Biden's Putin Remarks","Giraffe From 'The Hangover' Movie Placed at the Center of Criminal Trials","'The Walking Dead' Season 10 Episode 20 Spoilers: Princess Fights Reality","Video of Mike Pence Tripping on Stairs Resurfaces After Joe Biden's Stumble","'We Run a Grocery Store Where Everything is Free'","What We Can All Learn from International Francophonie Day | Opinion","25 Things Siri Can Do You Had No Idea About","Kent Taylor, Texas Roadhouse CEO Who Gave Salary to Help Employees, Dies at 65","Joe Biden's Fall Sparks Conservative Attacks, Progressive Praise"]},{"source":"new-york-magazine","titles":["Conservative George W. Bush Is Now Too Liberal For His Party","When the Capitol Riot Came Home","Current Aide Accuses Cuomo of Sexual Harassment","Republican Tom Reed, a Potential Cuomo Challenger, Accused of Sexual Misconduct","Trumpy Georgia Congressman May Help Punish Raffensperger","The Flattening of the Atlanta Shootings","Putting Students Behind Plexiglass Isn’t Making Them Any Safer","Lindsey Boylan Says Cuomo Had Dartboard With Photo of de Blasio","The Fake Feminists Fighting the Equality Act","Democrats Advance Citizenship for 3.5 Million Immigrants","Trump’s Lackeys Are Teaming Up Again With Putin to Mock Biden","Is Complaining About ‘Cancel Culture’ the New Ideology of the Republican Party?","The First U.S. Meeting With China Under Biden Didn’t Go So Smoothly","When Domestic-Violence Prevention Collides With the Religion of Guns","Fed to Biden: The Money Printer’s Still Got Plenty of Ink","Becerra Confirmed as HHS Secretary in Closest Vote Yet","Andrew Yang’s Plan to Fight Hate Crimes Makes Asian Activists Cringe","GOP Rep: I Didn’t Intend to Blame Jews for the Space-Laser Conspiracy","These Are the Victims of the Atlanta Spa Shootings","Are the Atlanta Killings a Hate Crime? The Suspect Doesn’t Get to Decide."]},{"source":"politico","titles":["Feinstein says Senate should look at reforming the filibuster","Austin hints India’s purchase of Russian missile system could trigger sanctions","We should have seen this coming","Will at-home abortions make Roe v. Wade obsolete?","Why Is Andrew Cuomo Holding On? Blame New York’s Politics of Masochism.","California recall all but certain based on official signature update","Same old Joe: Rebuffing staff who smoked pot fits Biden’s MO","WATCH: Is there really a crisis on the southern border? | Playbook Playback","Gavin Mussolini, the ‘Superhero Pirate’ and the Ragtag Campaign that Could Take Down California’s Governor","‘Fundamentally at odds’: China, U.S. retreat to their corners after Alaska talks","Why Biden Waited So Long to Throw the Press a Bone","Trump's Mar-a-Lago partially closed due to Covid outbreak","Current staffer publicly accuses Cuomo of sexual harassment","Who is lobbying in the Ethiopia conflict as Coons heads to Addis Ababa","Trudeau 'confident' 2 detained Canadians will be discussed in U.S.-China talks","Federal judge pens dissent slamming decades-old press protections","'In the dark of night': Trump's Interior chief snuck Murkowski an 11th-hour win","Rep. Tom Reed accused of sexual misconduct on 2017 trip","Proud Boys leaders facing new conspiracy charges related to Jan. 6 Capitol riot"]},{"source":"reddit-r-all","titles":["Show HN: R/shouldibuythisproduct because Amazon reviews is broken","GraphWrap: extend your Django REST Framework API with a GraphQL interface with just two of lines of code. : django","My recommendation to learn Django : django","Piracy, Overcoming Gravity, and the Digital Edition","Has Y Combinator lost its way when the latest company is a Mac only widget?","My bank sent me 64 copies of the same debit card","Join David Borenstein for a reddit AMA at 2:30 p.m. ET to discuss his film on the price of being a social media star in China","YouTube doesn't handle space anymore","Florida is suffering from an epidemic of bald men renting billboards that need to be extended in order to fit their bald heads.","Django admin looks dated and is not mobile friendly, any better options ? : django","Reddit: Online Presence Indicators","Namecheap just snaked another domain off me","Any open source DRF projects? : django","I want this guy working on the unit tests : ProgrammerHumor","Protest note about user privacy changes by Reddit","What virtual environment system do you use for your Django projects and why? (venv, pipenv, pyenv, etc ) : django","In the 90s part of Germany's air traffic control software ran on Emacs"]},{"source":"reuters","titles":["Britain says 26.85 million people have had first shot of vaccine - Reuters Canada","Europe's south calls for more solidarity in new EU migration pact - Reuters","U.S. to place some migrant families in hotels in move away from detention centers","Cycling: Stuyven pips pre-race favourites to win Milan-Sanremo","Britain on track to ease lockdown measures in line with plan: health minister","Supporters voice defiance after bid to ban pro-Kurdish party in Turkey","Italian prosecutor seeks trial for Salvini on migrant kidnapping charges - Reuters UK","Britain on track to ease lockdown measures in line with plan: health minister - Reuters","Report: Buckeyes alert police after threats to E.J. Liddell","Britain on track to ease lockdown measures in line with plan -health minister","Erdogan sacks another central bank chief after sharp Turkey rate hike - Reuters UK","China aluminium giant Hongqiao to publish carbon goals this year, chairman says - Reuters","Two men sentenced to death for Pakistan gang rape - prosecutors","Two men sentenced to death for Pakistan gang rape: prosecutors - Reuters","Portugal to quarantine travellers from South Africa via other countries - Reuters","INSTANT VIEW-Turkish lira in crosshairs after latest central bank chief ousted - Reuters","Istanbul municipality says will challenge Gezi Park transfer - Reuters Africa","UPDATE 1-Renesas warns some production hit by Japan chip plant fire","Thai army denies supplying rice to Myanmar forces","Alpine skiing: Slovakia's Vlhova wins women's overall World Cup title - Reuters"]},{"source":"the-american-conservative","titles":["The Human Distinction","Peter Strzok’s ‘False Memory’ About the Origins of Crossfire Hurricane","H.R. 1 and Herd Count Democracy","Is Transgenderism Just a Celebrity Fad?","In Memoriam: Richard Driehaus","Romney Says America’s Leadership is Too Old to Take on China","To Flee or Not To Flee","Two Centuries of ‘That Blackguard Burton’","Twilight of the European Nationalists?","The Uses and Abuses of ‘Woke Capital’","Get Him Outta Here","The Other Deficit","The Right Can Win in States","Washington’s Anti-Russia Fixation","What Does the Future Hold for the GOP?","Something is Rotten in the Georgia Secretary of State’s Office","This is Gen Z’s Moment","No, America Still Shouldn’t Intervene on Behalf of the Syrian Rebels","A Hollow Victory for American Workers","A ‘Never Again’ Moment, Again"]},{"source":"the-hill","titles":["Ambitious House lawmakers look for promotions","Olivia Munn applauds Biden response to Atlanta shootings","Family of Atlanta shooting victim questions gunman's stated motive","Elon Musk: Not broke, never woke, and in on the joke","Fauci: COVID-19 variant likely accounts for up to 30 percent of US infections","Twitter says it will appoint rep in Turkey to comply with social media law","IRS extension leaves other headaches to solve","Fox Business reporter offers personal view on anti-Asian attacks: 'Someone needs to stand up for us'","Trump boosts Julia Letlow ahead of Louisiana special election","Service dogs are saving veteran lives, despite limited access through VA","Federal judge accuses NY Times, WaPo of being 'Democratic Party broadsheets'","Elizabeth Warren fuels class warfare with new wealth redistribution ideas","UK announces half of all adults have received at least first coronavirus shot","Olympic fans outside Japan won't be allowed into Tokyo games","Bill Maher blasts removal of journalist at Teen Vogue","Forcing Black Teen Vogue editor to resign over teen tweets is cancel culture at its worst","Elon Musk denies cars were used to spy in China: Tesla would be 'shut down'","Japan issues tsunami warning after major quake rocks country","US ambassador, Chinese diplomat clash over racism at UN General Assembly","Russia, China tensions rise with White House"]},{"source":"the-huffington-post","titles":[]},{"source":"the-washington-post","titles":["Erdogan pulls Turkey out of European treaty aimed at protecting women from violence","How the opportunity costs of tornado warnings could be reduced","Long dormant Iceland volcano erupts for first time in 6,000 years","Will 'FALCON' bring Black Captain America onscreen?","Non Sequitur for Saturday, March 20, 2021","Doonesbury for Saturday, March 20, 2021","A reptilian nightmare: Florida bans nonnative species despite industry outcry","Tokyo Olympics organizers ban spectators from outside Japan in pandemic-control measure","Louisiana voters go to the polls in two House special elections","D.C.-area forecast: Spring arrives on a splendid note this weekend, with pleasant conditions into next week","For once, a woman won a #MeToo case in China. Why is it so hard?","Netanyahu turns to extremist party that calls for expelling Arabs from Israel","Carolyn Hax: Birthday woe leaves a lot more to be unwrapped","'Mistakes, progress and political jeopardy'...","ANOTHER ONE: Current Cuomo aide makes sex harassment allegations...","War within Robert Aaron Long was evident for years...","Robert Aaron Long: The Atlanta spa shooting suspect’s life before attacks - The Washington Post","Biden and Harris visit Atlanta after shooting rampage, vowing to stand against racism and xenophobia","Trump’s Mar-a-Lago Club partially closed after staff infected with coronavirus","Cuomo faces new allegation of misbehavior by another female employee"]},{"source":"the-washington-times","titles":["Ousted NEW YORK TIMES reporter slams newsroom's culture: 'Mean, spiteful, vengeful place'...","‘Three Warfares’: U.S. pummeled by covert disinformation war waged by Russia, China","About to learn his definition of 'fair share'...","Terror suspects part of border surge...","For Biden, there's no place like a weekend home in Delaware","Pentagon goes to war with FOXNEWS over 'feminizing' military...","NEXT: Gun Control?","Obama, Bush, Clinton, Carter push COVID-19 vaccination","Jay Bhattacharya, Stanford doctor: Lockdowns 'single worst public health mistake' in last 100 years","Justice Amy Coney Barrett riles conservatives with moderate rulings...","Illegal immigrants shouldn't be included in congressional count","'It is not right': Bill offers hope that flyers of CIA's Air America will finally win recognition","'Extraordinary crisis': Democrats' revolutionary climate change bill aims to remake U.S. economy","$1,400 stimulus checks could be intercepted, consumer advocates warn","DARPA, CIA-contracted fund partner to stop China from gobbling up America's intellectual property","U.S. plans to deploy long-range missiles in Asia to deter 'our greatest strategic threat'","Portland federal officers forgotten as Pelosi eyes Congressional Gold Medal for Capitol Police","It's time to question Biden's mental health","'Almost useless' COVID-19 tests on migrants dropped in Texas town find 25% infected","Will the real president of the United States please stand up?"]},{"source":"time","titles":["Prosecutor: Man Charged With 1 Murder Says He Killed 16 People","Half of U.K. Adults Have Received At Least One Dose of COVID-19 Vaccine","Strong Earthquake Shakes Japan Triggering a Tsunami Advisory","Asian American Religious Leaders Reflect on the Atlanta Shootings","‘You Don’t Have to Be Rich to Do the Right Thing.’ Colombia’s President Ivan Duque on Welcoming Venezuelan Refugees","A Single Mom. A Newlywed. A Veteran. These Are the Victims of the Atlanta Shootings","How Foster Families Are Stepping Up to House Unaccompanied Children Arriving at the U.S.-Mexico Border","Genius: Aretha Is a Lavish, Lively Showstopper That Hits a Few False Notes","If You’re Surprised by the Anti-Asian Violence in Atlanta, You Haven’t Been Listening. It’s Time to Hear Our Voices","‘This Is A Human Issue.’ Daniel Dae Kim on Coming Together to Combat Bigotry","NCAA Accused of ‘Disrespectful’ Treatment Towards Women’s March Madness Teams in Viral TikTok","For Asians Living the Shadow of the Atlanta Killings, Anger and ‘Just This Constant Fear’","Mads Mikkelson Can Do Anything. But He’s Stuck in the Boring Oscar-Nominated Another Round","‘It Is Dangerous To Speak Up In India Today.’ What the Resignations of 2 Academics Show About Freedom of Expression Under Modi","Israel’s COVID-19 Vaccination Rollout Is Slowing at a Critical Moment. That’s a Warning for the Rest of Us","How Whitney Wolfe Herd Turned a Vision of a Better Internet Into a Billion-Dollar Brand","American Democracy Can’t Survive Unless the Far Right Is Marginalized. Here’s How to Do It","Facebook Is Building ‘Instagram Kids’ for Children Under 13","The House Passes Two Immigration Bills. But Will Broader Immigration Reform Be Possible?","Biden Administration’s First U.S.-China Meeting Quickly Descends Into Bickering"]},{"source":"usa-today","titles":["Jay Bilas blasts NCAA president Mark Emmert for slow response to tournament inequalities","(8) LSU vs. (9) St. Bonaventure live stream, NCAA March Madness, TV channel, how to watch","Twitter explodes after Steelers re-sign JuJu Smith-Schuster","(3) Kansas vs. (14) Eastern Washington live stream, NCAA March Madness, TV channel, how to watch","Jordan Jenkins signing with Texans, ending run as Jets’ longest-tenured player","Colts in the market for playmaking TE","DC vs Marvel: Who is the ultimate superhero?","Watch Luka Doncic dish two of the most ridiculous no-look passes you'll see against the Trail Blazers","Chargers sign ex-Lions OL Oday Aboushi","March Madness live updates: The scores and moments you need to know from Saturday at men's NCAA Tournament","How DE Isaac Rochell fits with the Colts","What's happening in Myanmar? Military coup and protests explained visually","The Athletic: Another mock draft has Thunder taking James Bouknight","Ravens CB Marlon Humphrey tried to slide into JuJu Smith-Schuster’s DMs to recruit him","Saints fined, lose draft pick due to COVID-19 violations","SPECIAL DELIVERY: Exploring Nike's big switch on the Air Max with the brand new Pre-Day","(4) Florida State vs. (13) UNC Greensboro live stream, NCAA March Madness, TV channel, how to watch","Eagles could be a trade destination for Nick Foles as Bears look to move on from QB","Gleeson's Guarantees: Best March Madness bets for Sunday's second-round action","Miami Dolphins waiving former first-rounder Isaiah Wilson less than two weeks after trading for him"]},{"source":"vice-news","titles":["Donations to Asian Sex Worker Groups Skyrocket in Wake of Atlanta Shootings","NFTs Won't Save Small, Independent Musicians—But the Blockchain Could","'Star Dynasties' Is the 'Crusader Kings' in Space That We’ve Always Wanted","A Brief History of Wendy Williams Burping and Farting on TV","Daily Horoscope: March 20, 2021","Even Where Weed Is Legal, Cops Still Mostly Arrest Black and Brown People","The Solution to Violence Against Women Will Never Be 'More Police'","Texas Man Arrested for Weed Died After Officers Pepper-Sprayed Him and Put Him in a Spit Hood","Atlanta Shooting Suspect’s Church Bashed ‘Radical Feminism’ in Deleted Sermons","Please Stop Using Dating Shows to Embarrass Black Women","A Woman Set Up a GoFundMe to Help Harry and Meghan Pay for Their $14M House","Oklou just remixed Bladee and Mechatok’s Rainbow","Free money and Loewe eco-chic: What’s in fashion?","Police Spies Told a Minister Where Left-Wing Trade Unionists Go on Holiday","Working at Goldman Sachs Suuuucks, Leaked Internal Survey Shows","The Alleged Atlanta Shooter’s Church Is Kicking Him Out","How the 'Loop Hero' Devs Pitched a Hit Game That's Impossible to Describe","Anti-Asian Twitter Hashtags Spiked After Trump Called COVID the ‘Chinese Virus’","Gay art documentaries and Kim Kardashian: what i-D loved this week","A GOP House Member Fondly Remembers Lynching During Anti-Asian Violence Hearing"]}]