[{"source":"abc-news","titles":["Vacation redux: British tourists return to Portugal beaches","Israeli strikes hit Gaza tunnels as diplomats work for truce","New York to let vaccinated people ditch masks","Biden to boost world vaccine sharing commitment to 80M doses","Emirates Air faced \"tough year\" as virus looms over travel","Authorities in Spain say that around 1,000 Moroccan migrants have crossed into Spanish territory","Russia won't block Twitter, but partial slowdown to continue","Jan. 6 riot suspect on house arrest after mountain lion kill","Officer charged in death of Daunte Wright to appear in court","White House: Biden to share an additional 20 million vaccine doses, 80 million total, with world in next 6 weeks","New this week: Chrissie Hynde, loads of zombies & M.O.D.O.K","German Greens want more rail travel, fewer domestic flights","Mexican president apologizes for 1911 massacre of Chinese","Panama cautious after day without COVID-19 deaths","Evacuation order still in place after fiery Iowa derailment","Georgia election law threatens voting, speech rights: Suit","Kosovo, Serbia clash over Balkan border issues at summit","Derek Jeter sells Tampa mansion Tom Brady has been renting","Ransomware attack hits 4 Asian countries of AXA subsidiary"]},{"source":"al-jazeera-english","titles":["AT&T, Discovery combine media brands in $43bn deal","Biden to send additional 20 million vaccine doses abroad","New guidelines on masks stir debate in US, sow confusion","Gaza: Islamic Jihad commander killed in Israeli air strike","Biden’s stimulus set to deliver monthly child payments in July","Iran oil minister Zanganeh to retire at end of Rouhani’s term","US Supreme Court will consider rollback of abortion rights","Further delay in South Africa ex-President Zuma corruption trial","Migrants, refugees swim from Morocco to Spain’s Ceuta enclave","Israel yet to show proof of Hamas in Gaza media tower: US","As China makes space strides, debris problem gains urgency","US legislators question $735m arms sale to Israel: Report","Top footballers unite in solidarity with Palestinians","Russia searches for answers after rare school shooting","UN court pressed to probe Israel strike on media office","Protests in Lebanon continue in support of Palestine","The disease of settler colonialism and apartheid","India sacks Kashmir employees for threatening ‘security of state’","Saudi Arabia eases travel ban for vaccinated citizens","UK embarks on major reopening despite fears over COVID variant"]},{"source":"associated-press","titles":["Colts reschedule Mathis' Ring of Honor ceremony for November","GOP's LaRose launches reelection bid for secretary of state","German Greens want more rail travel, fewer domestic flights","Indiana ending enhanced pandemic jobless aid next month","Evacuation order still in place after fiery Iowa derailment","Minnesota legislative leaders say they have a budget deal","New law makes inmates choose electric chair or firing squad","Chiefs' Niang finally gets rookie minicamp after opting out","GOP county judge running for Arkansas lieutenant governor","Cooperation deal...","Kosovo, Serbia clash over Balkan border issues at summit","CORRECTS: Florida politician seen as key figure in US probe of Rep. Matt Gaetz pleads guilty as part of cooperation deal","Derek Jeter sells Tampa mansion Tom Brady has been renting","Suit: Georgia election law threatens voting, speech rights","Trump to speak at North Carolina GOP convention on June 5","Gaetz associate pleads guilty to sex trafficking charges","Ex-Turkish presidential contender forms new political party","Savannah could demolish public housing complex near downtown","Pope taps fellow Jesuit to lead sensitive Hong Kong church"]},{"source":"axios","titles":["New York to lift mask mandate for vaccinated people","Ex-Gaetz associate pleads guilty to sex trafficking a minor","Parler returns to the Apple App Store","The winners and losers of AT&T's split with WarnerMedia","Supreme Court agrees to hear major Mississippi abortion case","ZUCKER WILL STAY","Blinken says he hasn't seen evidence Hamas was in AP building Israel struck","DISNEY DWARFED...","Child tax credits from COVID relief plan to begin arriving July 15","Sanofi, GSK COVID vaccine shows strong immune response in phase 2 trials","Vaccine-hesitant Americans cite inaccurate side effects","Pope Francis \"intends to join\" UN climate summit in Glasgow, John Kerry says","Why victims like Colonial Pipeline keep paying off ransomware attackers","CDC mask guidance sparks confusion, questions","28 Democrats call for Israel-Hamas ceasefire as aerial bombardments continue into night","Bill Gates faces scrutiny over relationship with Microsoft employee, Epstein ties","AT&T in talks with Discovery to combine media assets","Cameo CEO says he would let Trump join platform","Off the rails: Trump’s failed 11th-hour military withdrawal campaign","“The guy does not eat well”: Franklin Graham worries Trump too old to run in 2024"]},{"source":"breitbart-news","titles":["Report: U.S. Approves $735 Million Arms Sale to Israel","Watch: Israeli Precision Airstrikes Eliminate Palestinian Terror Commander, Nine Miles of Tunnel","10 Per Cent of British Restaurants Closed Down for Good During Lockdown","46 Shot During Weekend in Mayor Lori Lightfoot’s Chicago","Joe Biden Releases More Monthly Direct Cash Payments to Parents","Israel Slams Model Bella Hadid for ‘Advocating Throwing Jews Into the Sea’","HBO Host John Oliver Accuses Israel of Committing ‘War Crimes’ for Defending Itself from Hamas Attacks","AT&T Announces Mega Deal to Merge WarnerMedia With Discovery","Sam Brownback Presses Vatican to Change Policy Toward Chinese Communists","Four Arrested After ‘F*** the Jews’, ‘Rape Their Daughters’ Car Protest in London","Box Office: ‘Spiral’ Reigns With $8.7 Million, Angelina Jolie’s ‘Those Who Wish Me Dead’ Bombs","Netanyahu Adviser Aaron Klein: Hamas’ Use of Journalists as Human Shields Must Be Condemned","Indoor Dining Restarts In England Amid Indian Covid Variant Concerns","NYTimes: Biden Opens U.S. Border to the Globe’s Economic Migrants","Rochdale Child Rapists Granted Over £2 Million in Taxpayer-Funded Legal Aid","Dermer: Hamas 'Not Just a Terrorist Organization — They Are a Genocidal Organization'","Pompeo: Evidence of Coronavirus Cover-Up Efforts by Chinese Communist Party ‘Staggering’","Jordan on Liz Cheney: You Can’t Have a Conference Chair ‘Reciting Democrat Talking Points’","Air Force Lt. Colonel Fired After Remarks About Marxism, Critical Race Theory Spreading in Military","With Israel Still Under Attack, Sen. Ossoff Leads Democrats in Call for Ceasefire"]},{"source":"cbs-news","titles":["Electric chair or firing squad? New law makes inmates pick","Palestinian policy analyst on situation in Gaza","What a former CDC chief says about the new mask guidelines","Alleged Capitol rioter banned from guns shoots mountain lion","Supreme Court to hear case over Mississippi's 15-week abortion ban","Walmart, Starbucks to forego masks for vaccinated shoppers","Experts give tips on traveling safely this summer","“CBS This Morning” co-host Tony Dokoupil, MSNBC anchor Katy Tur welcome baby girl","U.K. eases COVID restrictions despite concern over Indian variant","Matt Gaetz associate pleads guilty in federal sex trafficking case","ICYMI: A look back at Sunday's 60 Minutes","Matt Gaetz's associate Joel Greenberg accepts plea deal in ongoing investigation","Israel defends airstrikes in Gaza after deadliest day of fighting","Still filing taxes? Here's how to speed your refund","Doctors urge more gender-specific research on leading cause of death for women","5/17: CBSN AM","CDC mask guidance creating confusion nationwide","Miss USA 2010 Pole Dancing Pictures Surface","Biden under pressure to support Palestinians in Mideast conflict","New York prosecutors seek cooperation of Trump business associate in probe"]},{"source":"cnn","titles":["Biden to announce US will share more vaccines globally","This $15 microphone has been a huge boon for working and creating from home","Are you a parent that's hesitant about getting the Covid-19 vaccine for your child? Share your story.","¿Por qué la actividad sexual sufrió un duro golpe en la pandemia (y qué hacer para resolverlo)?","الجيش الإسرائيلي: استهداف مبنى واحد على الأقل بصواريخ من غزة على أشدود","Los viajes de negocios han desaparecido. ¿Volverán alguna vez?","18 stylish wallets you won't want to hide in your purse","بلينكن ينفي الاطلاع على معلومات استخباراتية إسرائيلية عن قصف مبنى يضم الجزيرة وأسوشيتدبرس في غزة","The best sales to shop today: Adidas, Eero, Tile and more","بعد نشر صورته حاملا علم إسرائيل.. السفير التشيكي في الكويت يوجه رسالة للمسلمين والفلسطينيين","La Corte Suprema se ocupará el próximo periodo de un caso importante de aborto que podría limitar a Roe contra Wade","Former child star apologizes after confronting Costco employee","تبحث عن وظيفة في الإمارات؟ هذا رأي الموظفين الحاليين بهيكل أجور الشركات","'This is a huge step for law enforcement.' Police unions shift stance on protecting bad officers","أكثر من 50 مليون دولار حجم الأضرار الاقتصادية في غزة نتيجة الغارات الإسرائيلية","25 gift ideas for the Gemini in your life","موسك يلمح لتخلص \"تسلا\" من بيتكوين.. وقيمة العملة تهبط مجدداً","وزير الخارجية الإيراني يلتقي البابا فرنسيس في الفاتيكان","White House concerns rising over civilian deaths in Israeli-Palestinian conflict","Supreme Court takes up major abortion case next term that could limit Roe v. Wade"]},{"source":"fox-news","titles":["Disneyland Paris will reopen in June with new attractions, safety protocols","Social media star Suede Brooks apologizes for sharing a post about Israel-Palestinian conflict","Mollie Tibbetts murder: Trial begins for Mexican national charged in killing of Iowa college student","Colton Underwood calls out ‘inappropriate’ questions about his sex life from fans: ‘I’m respecting myself’","Massive US-Israel weapons sale approved by Biden administration","Texas reports zero COVID deaths 2 months after Biden slammed 'Neanderthal thinking'","Matt Gaetz associate Joel Greenberg pleads guilty to sex-trafficking charges","Former Cuomo aide alleges 'pattern' of gender discrimination, harassment as Clinton HUD secretary","2 Nebraska kids found dead, father arrested in California","Pub sells single pint of beer for over $1,000 for the first drink poured in over a year","New York Times puts a positive spin on Biden's short temper: 'Unintentionally hilarious propaganda'","'Saturday Night Live' hits ratings low in first episode after Elon Musk's high-profile hosting gig","Prince Charles crowned ‘king’ in UK's Sunday Times headline concerning royal palaces becoming public spaces","Unchecked MSNBC guests rail against police, suggest capitalism encourages deaths of Black people","Lions' Dan Campbell willing to lose arm if it means hoisting Super Bowl trophy","Pope taps fellow Jesuit to lead sensitive Hong Kong church","Bongino rips liberals like Bernie Sanders, AOC, Squad members for supporting Hamas terrorists","UFC's Beneil Dariush after win calls out Elon Musk over wife's Tesla, CEO responds","'The Fuhrman Diaries' unveils exclusive details on the disappearance of Natalee Holloway","New law makes inmates choose electric chair or firing squad"]},{"source":"google-news","titles":["What’s new with Power BI?","Show HN: Housee Modern House Plans with 3D Previews","女性の人権と安全を求める共同声明","STOCK -19% SO FAR THIS YEAR...","Video SEO best practices for ecommerce","Blockchain and its importance in the current cyber war","Query Compile Time","5 things I learned from engineering an internal comms turnaround during a pandemic","Berkshire Hathaway Down 99.5%","\"To our surprise\"","5 Steps To Create Professional Looking Marketing Videos","Z3 Tutorial","Jigsaw: A Google disinformation, toxicity, censorship and extremism control unit","Query Store on Azure SQL Database","Show HN: Holdup – A Post Scheduler for Reddit","How we fought Search spam on Google in 2020","DevOps の能力  |  Google Cloud","Google have declared Droidscript is malware","Show HN: Shorts based learning app for programming concepts","Using Extended Events Live Data With Azure"]},{"source":"msnbc","titles":["McCarthy's latest Biden criticism: He sleeps more than Trump","Republicans who defended Jan. 6 rioters as victims face backlash","Arizona's bonkers election audit sharply divides state Republicans","Why Matt Gaetz's wingman's copping a plea deal is a big deal","Why Israel's mistreatment of the foreign press is a big mistake","These Republicans think they can still save the GOP. Here's why they're wrong.","Trump committed crimes in office that no indictment can remedy","Shaming doesn't help end an epidemic. Gay men know that all too well.","Can Florida shield Trump from extradition? Here's what the law actually says","Trump voter in Colorado faces stunning voter fraud allegations","Will Greene's 'verbal assault' on AOC spark an ethics investigation?","Bennifer is the post-Covid trauma balm America needs right now","Stefanik fends off challenge, replaces Cheney in GOP leadership","Red-state Republicans to ignore voters, reject Medicaid expansion","GOP's Doug Lamborn faces dramatic lawsuit from former staffer","Group quietly boasts about crafting GOP's voter-suppression bills","Criticizing Israel has been off-limits for U.S. athletes. Until now.","We should absolutely bribe people to get vaccinated","Thursday's Mini-Report, 5.13.21","Why the deal for testimony from Trump's White House counsel matters"]},{"source":"national-review","titles":["CNN Severs Ties with Freelancer Who Believes the World ‘Needs a Hitler’","Supreme Court Agrees to Hear Major Abortion Case","Trump to Resume Campaign-Style Rallies in June: Report","AT&T to Merge Media Business with Discovery, Creating Streaming Giant","CDC Says Students Should Continue Wearing Masks for Remainder of the School Year","Three False Narratives Being Used in the IRS Funding Push","CDC’s Walensky Denies Politics Played Role in Updated Mask Guidelines","Crenshaw Says GOP Can’t ‘Excommunicate’ President Trump","Cheney: Trump’s Stolen-Election Comments Create Image of U.S. as ‘Failed Nation’","The Consumer Financial Protection Bureau Returns to Lawlessness","McCarthy: Biden Doesn’t Have the ‘Energy of Donald Trump’","Tulsa Race-Massacre Commission Ousts GOP Governor over Critical-Race-Theory Ban","Jesus Statue Toppled, American Flag Burned at NYC Church","Understaffed Retailers Are Competing against Unemployment Checks — and They’re Losing","Newsom Proposes Expanding State Health Care to Undocumented Seniors","Biden Revokes Trump Executive Order to Create ‘Garden of Heroes’","Walmart Will Stop Requiring Masks for Employees and Customers","Border Patrol Agents May Retire Early Due to Frustration with Border Crisis","Oklahoma Public School District Spent $23K on Equity Training ahead of Big Budget Cut","ACLU Lawyer Claims Republicans Want to ‘Kill’ Transgender Kids"]},{"source":"nbc-news","titles":["Supreme Court rules ban on Jim Crow-era split juries can't be applied retroactively","Supreme Court declines to broaden police authority to search homes","Matt Gaetz associate pleads guilty in sex-trafficking case, will cooperate with feds","New law in South Carolina makes inmates choose electric chair or firing squad","Olympian Raven Saunders looks toward Tokyo, with a focus on mental health","Covid crisis reaches Nepal with a surge in cases and hospitalizations","New Jersey wildfire threatens homes, burns 1,000 acres","Kidnapping, onerous fees: Central Americans returned to Mexico are targets for abuse, violence","Former child star Ricky Schroder confronts Costco employee about masks","Supreme Court won't decide if use of the N-word amounts to illegal discrimination","Vaccine from Sanofi and GSK works well in Phase 2 trial, drugmakers say","Supreme Court to consider reviving Mississippi abortion law","A university's Latino enrollment reflects progress —and the legacy of racism","NYC Pride parade bans police; gay officers 'disheartened'","Teen arrested in connection with killing of child found in middle of Texas street","Female welders torch glass ceiling in male-dominated field","Biden battles new crises as honeymoon fades","Ninth person from Yankees tests positive for Covid","'The best master': New Stalin Center evokes pride, and revulsion among Russians","Discovery and WarnerMedia merge, creating one of the largest U.S. media companies"]},{"source":"newsweek","titles":["China Pressures U.S. to 'Take a Just Stance' Amid Calls for Israel to 'Exercise Restraint'","TikToker Convinces Men That Women Can 'Peel Off Their Skin' After Their Period","'Extremely Healthy Baby' Dies of Mysterious Sudden Infant Death Syndrome","Israel Defense Forces Release Bombing Video of Islamic Commander","Man Chases Estranged Wife With Knives Onto Field of Their Child's Sporting Event","Spanish Judge Refused to Conduct Wedding Because Groom Was Dressed as Jack Sparrow","Tax Day 2021: Post Offices Extend Opening Hours For Filing Tax Returns","Recruitment Expert Shares 'Tip' Guaranteed To Land Grads Their Dream Job","Singer Kicks Fan Who Tried to Grope Her During Performance","Parkland Father Fred Guttenberg Rips AOC for Comments on Israel: 'I Have Defended You, Shame on You'","Woman's Princess Diana Hair Tutorial Leaves Viewers Shocked at How Similar She Looks","Girl Shares Childhood Experience With Gypsy Rose Blanchard in Viral TikTok","Latest Updates: Migrants Rescued By Coast Guard Off San Diego Coastline","Woman Surprises Her Dogs by Revealing Her First Name in Viral TikTok","Burning Crypto Explained As Trillions of Shiba Inu Coins Vanished by Ethereum Co-founder","Kevin Nascimento, MC Kevin, Dies in Hotel Fall, Just Weeks After Marrying","Photo of Man Surfing on Crocodile Down River Prompts Outrage","Man Catches 'Flesh-eating' Bacteria at Texas Beach During Family Visit","The 10 Wildest Stories From Halston's Life the Netflix Show Missed Out","Mike Pence Rebukes Joe Biden's Tax Plan, Says China Will Benefit While US Faces Economic Catastrophe"]},{"source":"new-york-magazine","titles":["We’ll Innovate Our Way Out of the Climate Crisis or Die Trying","The Republican Plot to Turn Poll Workers Into Vote Suppressors","This Time, The Craziest Election Doesn’t Have Trump","The Dirt Piles on Bill Gates Following Divorce Announcement","1,000 Evacuated in L.A. County As California Wildfire Season Ramps Up","Violence in Israel Is a Political Victory for Netanyahu","Conservatives Excommunicated the Last Republican President Who Lost","The COVID Lab-Leak Hypothesis Just Got a Big Credibility Boost","House Reaches Agreement on Capitol Riot Commission","Millennial MAGA Moderate Replaces Liz Cheney","The Future of COVID in America","Who Won the First NYC Mayoral Debate?","3 Reasons April’s Inflation Will Probably Be Temporary","The Best Canned Cocktails, According to Bartenders and Mixologists","Spies Somehow Failed to Get Trump Officials to Call Him Stupid on Hidden Camera","Polling the Midterms Is Going to Be Risky Business","CDC Says Fully Vaccinated Basically Don’t Need to Wear Masks","Andrew Yang’s Rivals Accuse Him of Cheating … on a Pop Quiz","Marjorie Taylor Greene Hassled AOC Inside the Capitol","The Israeli-Palestinian Conflict Is Likely to Get Even Worse"]},{"source":"politico","titles":["Gaetz associate pleads guilty to six federal crimes, including sex trafficking teen...","Who’s next on ransomware’s hit list","Mental health fears cloud school reopenings","Masks for thee, but not for me?","Just saying no (to the excise tax on drug companies)","Lawmakers question FDA on food safety spending","Infrastructure action on the Hill","Tai hosts first USMCA meeting with Canada, Mexico","Supreme Court will hear direct challenge to Roe v. Wade","NEWSOM budget ambition — CDAA vs. BONTA — Team GAVIN drops new anti-recall ads — BLACKOUT summer?","CLOAK & DAGGER REMAP — CANNABIS BILL NEARS PASSAGE — SUFFREDIN TO RETIRE","Overnight subway service returns — Cuomo accusers subpoenaed — Stefanik elected No. 3 leader for House GOP","WHITE report FALLOUT — The fight to keep COCKTAILS TO-GO — CORREIA: ‘I will be vindicated’","Can McCarthy still discipline MTG?","Piggy bank-filling payments for nearly 90 percent of kids will start July 15","It's just another masked Monday","POLITICO Playbook: McCarthy has another Trump problem on his hands","Teflon Joe muddies GOP’s midterm strategy","Rise of a megadonor: Thiel makes a play for the Senate"]},{"source":"reddit-r-all","titles":["Can I get some reasons to use Java instead of Kotlin?","Naked Short Sellers have set our cancer research back decades","As a longtime BSD user, I have my doubts about our future","Rescue Mission for Sci-Hub and Open Science: We are the library","Sci-Hub Archive","AirTags, luggage tags, and thieves","Why has machine learning become such a toxic field, know-it-all field?","AirTag’s hidden debug mode","Office 365 leaking BCC domain name to other recipients","Arbitrary code execution found in ExifTool. Make sure to update to 12.24","Thoughts on a “HDD shortage” from an industry insider","Untitled (https://www.reddit.com/r/todayilearned/comments/mxsdzu/til_judith_love_cohen_who_helped_create_the/)","Riot extorts League of Legends legacy version fan project?","Tether issued nearly $400M mere seconds before DOGE surged 30%","Policing the Police by scraping court data"]},{"source":"reuters","titles":["AT&T to exit media in $43 bln deal with Discovery - Reuters","New York ends COVID-19 mask requirements for vaccinated people - Reuters","Trump, House Democrats near agreement on Deutsche Bank subpoenas - Reuters","Exodus to jungles, villages as Myanmar troops retake town - Reuters","Billionaire Pinault unveils art trove in Paris - Reuters.com","Parler returns to Apple's App Store, names new CEO - Reuters","Thrill of the silver screen returns to England as lockdown eases - Reuters","Pandemic's economic burden fell hardest on less-educated Americans, Fed survey shows - Reuters","Israel's military effort has an economic shield - Reuters","Panthers' Sam Bennett to have hearing with NHL - Reuters","Indian variant not affecting vaccinated older people - UK health minister - Reuters UK","Philippines' Duterte issues gag order on cabinet over South China Sea spat - Reuters","U.N. General Assembly to meet over Mideast violence on Thursday - Reuters","Backers of WTO vaccine waiver ask opponents to join talks - document - Reuters","Brazil's Christ the Redeemer statue lights up for vaccine equality - Reuters","Backers of WTO vaccine waiver ask opponents to join talks - document","Indian variant not affecting vaccinated older people - UK health minister - Reuters","South Africa's ANC to oppose court challenge by suspended top official - Reuters"]},{"source":"the-american-conservative","titles":["Elise Stefanik is the Truce Choice in the Republican Civil War","How to Fix Big Tech Without Big Government","The Other Virus: Learned Helplessness","Nuclear Power Plants: Our Industrial Cathedrals","Pandemics Aren’t Worth It: End Gain-of-Function Experiments","Farewell, Jeff Bezos","The Threat from China Is Exaggerated","What is ‘Community Violence Intervention’ and Why Does Biden Keep Calling it ‘Gun Control’?","Why is a Billion Dollar Pipeline Incapable of Defending Itself Against Ransomware?","What the Right Can Learn from Cesar Chavez","Family Policy: Investing in Hungary’s Future","Transit After the Pandemic","Bad Bezos","An American Identity Crisis","Glenn Youngkin and the Fast Fade of the Virginia Old Guard","Toward a New Allied Relationship with South Korea","Here Comes the ’70s","How the Insulin Cartel Keeps its Grip","A Biden Doctrine Starts to Take Shape","Arabella Advisors: Democrats’ Darkest Dark Money"]},{"source":"the-hill","titles":["White House to send U.S. authorized vaccines overseas for first time","EU regulator says Pfizer coronavirus vaccine can be stored in regular refrigeration for a month","Democrats renew push for permanent child credit expansion","The Hill's 12:30 Report - Presented by Facebook - Supreme Court to hear abortion ban, with 6-3 conservative majority","German soccer federation president who compared official to Nazi quits","Cuomo ends NY indoor mask mandate for vaccinated","Biden administration lifts mask mandate for all vaccinated federal employees","Why does the hard left glorify the Palestinians?","Biden approves $735M weapons sale to Israel: report","EU suspends tariff hike on US goods in talks over Trump steel levies","70 percent of white-collar workers in US still working remotely: Gallup","Rubio wants 'UFO sightings' to be registered, taken seriously","Confidant says Trump's health might be too poor to run for president again","More than 500 homes evacuated in Los Angeles County as brush fire spreads","Gaetz associate Greenberg pleads guilty","Justices decline to give police more power to search homes without warrant","FTC reports surge in cryptocurrency scams","World Economic Forum cancels August meeting in Singapore","Sunrise Movement endorses Nina Turner in special election for Ohio House seat","Cutting costs and cultivating free speech will put higher education on the right path"]},{"source":"the-huffington-post","titles":["What Bullets Do To Bodies (2017)"]},{"source":"the-washington-post","titles":["Voters have seen past presidents as illegitimate. This time is different.","Ryan Kerrigan, Washington’s all-time sack leader, agrees to one-year deal with Philadelphia","The Daily 202: Biden ends Trump’s Big Tech attack over political speech - Washington Post","Liz Cheney and the mainstream media could learn from one another","A heated exchange with Rep. Dan Crenshaw epitomizes the GOP’s have-it-both-ways approach to Trump","Dallas, Houston face flood threat, with hail and tornado potential farther west","Gaetz associate pleads guilty in sex trafficking case - The Washington Post","When do Hamas and Israel reach the beginning of the end?","The fight that encapsulates the GOP’s struggle is happening in Arizona, not Washington","As Arizona Republicans erupt over Trump’s lies, a big truth is exposed","Supreme Court to review Mississippi abortion law that advocates see as a path to diminish Roe v. Wade","‘Extremely severe’ Cyclone Tauktae set to slam Gujarat, India","Photos: Israel-Hamas conflict hurtles into second week with more strikes on Gaza","Bubbie’s Plant Burgers are a delicious testament to the power of teamwork","As cryptocurrency goes wild, fear grows about who might get hurt...","Guo Wengui is “linchpin” of sprawling disinformation network, researchers say","Parler is blocking hate speech for iPhone users","Liz Cheney is right: Republicans need to police their own","Live updates: Biden to address nation on coronavirus response following return to Washington","How Juan Soto plans to turn grounders into better production"]},{"source":"the-washington-times","titles":["CDC: Fully vaccinated don't need masks indoors or outdoors","Texas GOP's voting restriction bill heads toward House vote","CHINA PLANS ATLANTIC NAVAL BASE","XI CLAIMS 'HELMSMAN'","Chauvin juror who attended pre-trial rally may jeopardize guilty verdict...","Feds serve search warrant at Alaska resort: 'We're here for Nancy Pelosi's laptop'...","Cops under siege; Face deadliest year in decades as they're targeted in waves of violence...","Biden pushes Congress to act on agenda, says $1.8T will help families","John Kerry denies sharing secret intelligence with Iran as calls for resignation grow...","Two dead as suicidal man jumps off building, lands on woman...","'Modern science' says there are six sexes, state legislator insists...","LGBTQ activists shun...","White liberals more likely to have a mental health condition","Biden, Dems rush to rewrite Chauvin trial narrative for political gain","Emma Burkey, Nevada teen, suffers seizures, brain blood clots after taking Johnson & Johnson vaccine","Marine commandant reveals new mission preparing for conflict...","Biden bans use of term 'illegal alien'...","Russians responsible for SolarWinds hack are targeting COVID-19 research, cyber officials say","Natanz blackout: A harbinger of future cyber-war with Iran, China and Russia"]},{"source":"time","titles":["Airlines’ Emissions Halved During the Pandemic. Can the Industry Preserve Some of Those Gains as Travel Rebounds?","How Juul Got Vaporized","Poppy Gustafsson, CEO of Darktrace, on Fighting Hackers During the Cybercrime Wave","What Happens Next With the Protests Roiling Colombia","Amid Rockets and Violence, Israel Is Trying to Sell Itself as a Holiday Destination to Muslim Visitors","Report: Microsoft Investigated Bill Gates Before He Left the Board","The U.K. Readies for a Major Reopening but a New COVID Variant Sparks Worry","Israeli Warplanes Stage More Heavy Strikes Across Gaza City","Afghanistan Cease-Fire Ends Amid Calls for Fresh Peace Talks","Brooklyn Center City Council Approves Sweeping Changes in Policing in the Wake of Daunte Wright’s Death","FDA finds wood pulp in major American parmesan cheese brands","Israeli Strikes Kill 42 and Topple Buildings in Gaza City","Glossy Starz Comedy Run the World Is Living Single for 30-Somethings","U.S. Warns Extremists May Strike as COVID-19 Restrictions Ease","Kid Reporter Who Interviewed Obama at White House Dies at 23","At Least 12 Killed, 300 Injured in China After Two Tornadoes Hit","Israel Strike in Gaza Destroys Building That Housed AP and Other Media Outlets","Texas’ Longest Serving Death Row Inmate Has Sentence Tossed","‘Stop the Hatred’ by MC Jin and Wyclef Jean Aims to Send a Message of Black-Asian Solidarity","Comedian Patti Harrison Has Her First Leading Role—But She’s Not Looking to Stop Goofing Around"]},{"source":"usa-today","titles":["'Sightings all over the world.' Another former federal official discusses UFOs, upcoming congressional report","FSU soccer looks to build upon national legacy in NCAA women's soccer championship vs. Santa Clara","DJ Augustin hopeful of turnaround in second season with Rockets","Joel Greenberg pleads guilty to sex trafficking, will cooperate in other investigations","Where Texas lands in USA TODAY Sports college football top 25 rankings","Report: Patriots sign guard Alex Redmond, center James Ferentz","Derrick Lewis explains why he hates UFC heavyweight champion Francis Ngannou","Celtics play-in tournament foe, range of first-round opponents now set","Report: Buffalo Bills investing in analytics","Water levels drop in Great Lakes after record-breaking highs in 2020","'Luckiest man alive': What's it like to be trapped in a car crushed by a falling tree?","Discovery swims with first Shark Week series; Brad Paisley and Tiffany Haddish join annual event","10 best sculpture parks in the U.S., according to our readers","Michigan football 2021 coaching changes tracker","Ranking every potential starting QB on the Rams’ 2021 schedule","It won’t take much for Zach Wilson to be best No. 2 in Jets history","Dan Quinn shows hands-on mentality with D-line in Cowboys minicamp","Two new behind-the-scenes staff changes for Michigan football","What are realistic expectations for Robert Saleh’s rookie season with Jets?","Florida Gov. Ron DeSantis says he'll pardon violators of local mask, distancing laws"]},{"source":"vice-news","titles":["Amazon Sends Workers 'Safety' Warning About Unions","Google Won't Say If It Will Update Its Blurry Maps of Gaza","Moses Sumney introduces us to Asheville’s creative community","Meet the artists reclaiming Asheville’s underground scene","Matt Gaetz’s Wingman Just Plead Guilty to Sex Trafficking a Child","Weekly Horoscope: May 17 - 23","Cool, Unbreakable Wine Glasses That Are Marginally Less Fragile Than You","Introducing... United States of i-D","Trump Voter Allegedly Murdered His Wife Then Cast Her Ballot for Trump Too","The Supreme Court Just Took a Case That Could End Roe v. Wade","The Guide To Getting Into Enya, Patron Saint Of Mystical Mood Music","Tor Project Auctions NFT Based on First Darkweb Site for $1.7 Million","These Social Media Influencers Can Help Indians With COVID... For a Price","Indian Cops Arrest Rickshaw Drivers For Posters Criticising Modi They Didn’t Make","Tech Companies Want Schools to Use COVID Relief Money on Surveillance Tools","'Cryptographic Attestation of Personhood' C","A ‘Complete’ Energy Transition Is Needed By 2030 to Avoid ‘Existential Threat’ to Humanity","AirTags Can Be Used To Figure Out When a House Is Empty, Researcher Warns","QAnon Lawyer Lin Wood Thinks The Election He Lost Must be Rigged","Here’s the Story Behind Snowden’s Mysterious Chinese Tweet"]}]