[{"source":"abc-news","titles":["Georgia lawmaker 'shaken but resolved' following arrest at election bill signing","Patrolling the Rio Grande for migrant crossings: Reporter's Notebook","Alabama Shakes drummer facing child abuse charges","2 in Seattle, San Francisco face anti-Asian hate charges","5-year-old boy allegedly detained, handcuffed and threatened by Maryland police - ABC News","Andre Hill shot 4 times by former Columbus police officer, autopsy report shows","China sanctions US, Canadian officials over Xinjiang","US waives FBI checks on caregivers at new migrant facilities","Report: Center-left candidate in Germany favors EU army","Gunman fires into crowd outside bar; 4 critically wounded","Body camera video shows officers berating 5-year-old boy","Foreigners flock to Serbia to get coronavirus vaccine shots","US questions legality of Bolivian arrests of ex-officials","Police in Belarus capital arrest more than 100 protesters","India's Modi ends Bangladesh visit that sparked violence","Boys shot while riding a dirt bike in Philadelphia; 1 dies","7 people shot in Philadelphia","Authorities probe small plane crash at Alabama airport","COVID miracles: 3 patients' journeys to the brink of death and back"]},{"source":"al-jazeera-english","titles":["Venezuela says six members of ‘armed groups’ killed near Colombia","MSF says urgent aid needed for Yemen amid surging COVID cases","Will the US take a new approach to North Korea?","Belarus police arrest more than 100, prevent opposition rally","‘Five killed, dozens wounded’ in anti-Modi protests in Bangladesh","Several European countries expand COVID curbs; France ‘critical’","Facebook freezes Maduro’s page for COVID misinformation","Thousands protest Turkey’s exit from domestic violence treaty","Colombia accuses FARC dissidents of car bomb that injured dozens","‘We have nothing’: Refugee camp fire devastates Rohingya, again","Egypt revises death toll from train crash to 19","China sanctions US and Canadian officials over Xinjiang rebuke","Why hate crime convictions are so difficult to secure in US","Why are social media platforms silencing Kashmiri voices?","Philippines announces strict COVID lockdown in and around Manila","Indian cricket legend Tendulkar tests positive for coronavirus","Iran and China sign 25-year cooperation agreement","Belarus excluded from Eurovision over political entry","Dr Sasa: Army leaders ‘underestimate’ the people of Myanmar","Building collapse in Egypt’s Cairo leaves several dead"]},{"source":"associated-press","titles":["Oregon State is 18th double-digit seed in NCAA Elite Eight","Marijuana takes center stage in New Mexico special session","Mancuso, Richmond beat Elon 31-17","Indiana in first Elite Eight with 73-70 win over NC State","Mavs' Doncic sits out in New Orleans because of illness","Close range: Baylor grinds to Elite 8 in 62-51 win ova 'Nova","AP source: LaMarcus Aldridge to sign with Brooklyn Nets","Indians trade RHP Plutko to Orioles for player or cash","Viola's Known Agenda prevails in Florida Derby at Gulfstream","Veteran infielder Todd Frazier opts out of deal with Pirates","Loyola Chicago's Moser says he's not ready to discuss future","Mariners uncertain about Kyle Lewis' status for opening day","Alabama Shakes drummer facing child abuse charges","Staley ready for day hoops the sole focus of women's tourney","Max Pacioretty scores in OT, Knights beat Avalanche 3-2","NCAA Sweet 16: Baylor beats Michigan in OT 78-75","Nationals send projected starting 3B Kieboom to minors","Morgan leads late VMI comeback in 36-31 win over Wofford","Pickard, Blue Jackets beat Red Wings 3-1","2 in Seattle, San Francisco face anti-Asian hate charges"]},{"source":"axios","titles":["Iran, China sign 25-year cooperation agreement","The centuries-long history of anti-Asian racism and violence in the U.S.","Suez Canal update: Ship still stuck, but officials hoping to make use of high tide","What kids really want to read: Owls beat chickens but poop is king","U.S. fears China attack on Taiwan","Myanmar security forces kill at least 90 people","\"The Expanse\" offers a realistic depiction of space colonization","Chinese officials brief diplomats on possible COVID-19 origins","China retaliates against U.S., Canada over Xinjiang human rights abuses sanctions","Building the AI-enabled factory to perfect manufacturing","1 sci-fi thing: \"The Expanse\"","Silicon Valley leaders push back on governor recall efforts","Minnesota court rules rape charge doesn't apply if the victim got willingly drunk","Climate change will help drive more migrants to the U.S. border in the future","9-year-old girl drowns attempting to cross Rio Grande into Texas","China flies at least 20 war planes in Taiwan airspace...","Mayday at the Suez Canal","Biden invites Xi, Putin and other leaders to virtual White House climate summit in April","Biden administration calls for more federal volunteers to help with migrant kids","\"Jim Crow in the 21st Century\": Biden says Georgia voting restrictions \"must end\""]},{"source":"breitbart-news","titles":["Community Helps ‘Miracle’ Girl Find Her Beloved Blanket","GOP Rep. Rogers: ‘Fort Pelosi’ Is ‘All Theater’ — ‘Trying to Create the Impression that Republicans Are Dangerous’","Report: Frustrated Gun Controllers Dig in for ‘Long Game’","Ken Blackwell: Corporate Media Legislation Is ‘Bait and Switch to Strangle Conservative Outlets’","Community Installs Park Swing for Boy with Special Needs: ‘We’re Blown Away’","Los Angeles-Area Woman, Dog Fatally Stabbed, Suspect Knocked Out with Rock","VIDEO: Son Raises Money to Take Terminally Ill Mom on Dream Vacation","Vatican Cardinal: In a Globalized World, ‘There Are No Borders’","11 Corrections Officers Injured in Inmate Attack at Rikers Island","Joe Manchin: The Radical Left Campaigning Against Me ‘Would Help Me’","Pinkerton: Biden Nominees Fall Prey to the Terrible Temptation of Twitter","WATCH: Doorbell Camera Catches Young Man Finding, Returning Purse","Penalties for Lying on ATF Background Check Form – As Hunter Biden Allegedly Did – Include Fines, Jail Time","Police: Babysitter Accused of Beating Five-Year-Old to Death","Baltimore Ends Prosecution of Low-Level Crimes Such As Prostitution, Drug Possession","Brooks: Reducing Number of Guns ‘The Only Way to Have a Meaningful Difference’","Brooks on GA Law: People ‘Vote When They Want to Vote, Regardless of the Law’","Archbishop Charles Chaput Warns of Demise of Religious Freedom in U.S.","Rapper Lil Nas X Unveils Nike ‘Satan Shoes’ Containing Human Blood, Limited to 666 Pairs","Transportation Secretary Pete Buttigieg Floats ‘Vehicle Miles’ Tax for Infrastructure Spending Extravaganza"]},{"source":"cbs-news","titles":["Weather forecast: Millions face snow, rain before Thanksgiving","Myanmar records deadliest day of protests since military coup","Migrants continue to cross border everyday as political debate intensifies in U.S.","Little progress made in freeing massive ship stuck in Suez Canal","More violence in Ferguson despite National Guard presence","Evanston, Illinois becomes first city to approve reparations for Black residents","MoneyWatch: Feds to announce new air pollution guidelines; Apple reaches milestone","Bill Cosby loses yet another performance","North America leads the world in obesity-related cancer","Ferguson decision","Ferguson Fallout","Charity Fraud: A guide to giving safely","Growing calls to terminate Maryland cops who handcuffed 5-year-old boy","\"CBS Weekend News\" headlines for Saturday, March 27, 2021","Coronavirus infections rising nationwide as states face pressure to reopen","Millions brace for severe weather this weekend","World celebrates “Earth Hour” by turning off non-essential lights","From pets to prey","Calorie counts coming to restaurant menus","11/25: The aftermath in Ferguson; calorie counts coming to menus nationwide"]},{"source":"cnn","titles":["Juan Guaidó informa que tiene covid-19 y está en aislamiento","'It's a tough time to be Asian,' demonstrator says at Los Angeles rally to end anti-Asian violence","Los esfuerzos para desalojar el buque portacontenedores varado del canal de Suez se intensifican a medida que aumenta el atasco","Is Thailand's Full Moon Party over for good?","What it's really like steering the world's biggest ships","Miss art museums? The Louvre just put its entire art collection online","This country only has about 500 doctors for 9 million people. Now it's dealing with a Covid outbreak","Netflix and Amazon gave daring Indian filmmakers hope. Now that's turning to fear","Former Trump chief of staff calls ex-President's Capitol riot claims 'manifestly false'","Sube a 43 el número de personas afectada por atentado en Corinto, Cauca","بيركس لـCNN: كان من الممكن تخفيف وطأة الوفيات بعد الـ100 ألف الأولى","قناة السويس: تعليقات من الأردن ورومانيا بشأن سفن الماشية.. وبودابست توقف تحريك سفنها","Maine GOP rejects censure of Sen. Susan Collins after her vote to convict Trump","محمد بن زايد يبحث مع وزير خارجية الصين سبل توسيع الشراكة بين البلدين","ولي العهد السعودي يعلن قرب إطلاق مبادرتين محلية وإقليمية لمواجهة التغير المناخي","Trump's big lie could backfire in Georgia","Legendary football coach Howard Schnellenberger dies at 87","بعد أسوأ موسم له منذ سنوات.. فريق فيراري فورمولا 1 يتطلع للعودة للمنافسة","Biden administration projects at least 34,100 more beds needed to shelter migrant children"]},{"source":"fox-news","titles":["CNN slammed for questionable tweet that refers to murder as an ‘accident’","What curfew? Miami spring breakers party on despite restrictions","Biden official asked GOP senators visiting border to delete photos from facilities","China sanctions U.S. and Canadian officials, including Sen. Manchin’s wife, in tit-for-tat response","Florida couple enjoys coffee while watching alligator swim in pool","LA County increases police funding by $36 million after defund movement backfires","New Mexico rancher tells lawmakers to address border crisis, ‘quit politicizing’","Lawmakers at border urge empathy for migrants: 'These are not invaders'","Oregon police department changes K9's name, Lil Kim, after controversy","Oklahoma corrections officer taken hostage in detention center, facility on lockdown","Former Acting ICE Director: Biden 'insulted' Border Patrol agents during press conference","Trump says he will probably visit the southern border soon, in exclusive interview with Fox News","Trump DHS officials slam Biden ‘purge’ of Homeland Security Advisory Council","GOP lawmakers call for answers from Blinken on border moves amid migrant surge","New Mexico rancher: Border crisis 'coming to a home near you'","Jets' Corey Davis social media activity raises questions over commitment to Sam Darnold","Oakland teachers refuse to return to school, despite getting COVID vaccine priority","Sen. Mike Braun sends letter to Biden urging him to visit border: 'This surge makes it a moral imperative'","US Virgin Islands search for Sarm Heslop continues, police aware of Siren Song whereabouts","Maine GOP rejects censure of Sen. Susan Collins"]},{"source":"google-news","titles":[null,"La Academia de Marketing Online - Es pronto para rendirte | Episodio 46","Michihito Ando - SNSにおける研究者の情報発信のあり方について","Show HN: Simple Time Tracker","New for education sites: Practice problems and Math solver structured data","Show HN: Wikiyarn – Smarter way to browse Wikipedia","emergency plumber service San Francisco California","Emergency Plumbing Service San Jose California Articles","24 Hour Emergency Plumber San Jose California Logo.jpg","24 Hour Plumber San Jose California.jpg","24 Hr Plumber San Jose California.png","24 Hr Plumbing Services San Jose California.jpg","24hr Plumber San Jose California.jpg","24hour Plumber San Jose California.jpg","24 Hrs Plumber San Jose California.jpg","header for best blumbing san jose.jpg","Emergency Plumbing Services San Jose California.jpg","Emergency Plumbing San Jose California.jpg","Emergency Plumbing Service San Jose California Photos","24 Hour Emergency Plumbing Services San Jose California Link Sheet - Emergency Plumbing San Jose California.pdf"]},{"source":"msnbc","titles":["Can you be fired for calling Trump crazy? Why this psychiatrist is taking Yale to court","Why QAnon keeps finding new 'clues' to obsess over","Ship stuck in the Suez Canal disrupts global trade, but makes good memes","Evanston, Ill. has made a down payment for national Black reparations","Even by GOP standards, Biden admin vaccine progress is impressive","Some very conservative judges made it easier for civilians to sue cops","Trump hosts the first of many 'Apprentice'-style Republican meetings","Why a red state wants to ignore voters, reject Medicaid expansion","Why Trump became the latest Republican to defend Jan. 6 rioters","With Georgia imposing radical voting restrictions, what happens now?","Whitewashing the filibuster erases its legacy of harming Black Americans","Biden's first press conference was substantive and thoughtful. Trump could never.","Unemployment claims improve, drop below major threshold","Manchin makes his case against his party's democracy reform package","7 right-wing myths, half-truths and lies about immigration that need to end","As momentum shifts, the filibuster rule is running out of friends","Senate Republicans look for new ways to justify anti-voting efforts","The problem with one GOP senator's case against 'Souls to the Polls'","Slack just blurred the line between work and home even more. Thanks, I hate it.","How one woman could bring down Trump's empire"]},{"source":"national-review","titles":["Cuomo Aides Subpoenaed in Sexual-Harassment Probe","The Fed’s Shabby Green Logic","Sharon Osbourne Leaves The Talk amid Fallout from Piers Morgan Defense","Georgia Elections Officials Compare Dem ‘Voter Suppression’ Claims to Trump’s Fraud Allegations","San Francisco School Board Member Stripped of Position over Anti-Asian Tweets","Biden Labels New Georgia Voting Law an ‘Atrocity’","China’s Climate Realpolitik","CBO: ‘Our New Debt Projections Are Already Obsolete’","Oakland Implements First of Its Kind Race-Based Guaranteed Income Plan","Colorado Shooter Passed Background Check before Gun Purchase","Biden Nominates Joe Manchin’s Wife to Co-Chair Appalachian Regional Commission","The EU’s Vaccine Shambles — and How a Distrust of Free Markets Made It Worse","Former CDC Director Redfield Says He Believes Coronavirus Originated Inside a Wuhan Lab","Federal Judge Rules D.C.’s Capacity Limit on Churches is Unconstitutional","Dominion Voting Files $1.6B Lawsuit against Fox News","Democrats on the Filibuster: Then and Now","Twitter CEO Says Blocking New York Post Hunter Biden Story Was ‘Mistake’","Suez Canal Blockage: Why Are Ships So Big?","Ted Lieu Erupts at Mention of Alleged Harvard Asian Discrimination during House Hearing on Diversity","Biden Blames Immigration Crisis on Trump Policies"]},{"source":"nbc-news","titles":["Video shows Maryland police handcuffing, berating 5-year-old boy","N.Y. trooper dies three years after being struck by distracted driver","Woman accuses Harvey Weinstein of sexual assault, attempted rape in new suit","Asian American official shows his military scars during meeting, asks 'Is this patriot enough?'","Howard Schnellenberger, famed NFL and college coach, dead at 87","Man wanted after Texas trooper shot in the head","Scholastic pulls popular children's book from 'Captain Underpants' author","Noose found hanging from tree outside a church near Capitol Hill","All slingshot rides in Florida closed after teens get stuck","Former Ohio police officer shot Andre Hill four times, coroner says","HBO's 'Tina' is Tina Turner's way of telling us thank you — and goodbye","Man held in New Jersey killing charged in deaths of ex-wife, two others in New Mexico","Owners hope to refloat trapped Suez Canal ship Saturday","Deshaun Watson allegations highlight the gross, dark side of message therapy","'A huge, huge toll': For households reliant on two incomes, Covid job loss changed everything","'A win-win solution': Banking and booze could save the U.S. Postal Service, advocates say","China's growing firepower casts doubt on whether U.S. could defend Taiwan","Myanmar protests continue as junta chief uses Armed Forces Day to justify coup","'Baseball signifies American normalcy': Opening day comes as pandemic nightmare wanes","Julius' Bar, site of historic gay 'sip-in,' threatened by pandemic"]},{"source":"newsweek","titles":["Michigan Governor Candidate Who Joined U.S. Capitol Riot Calls It 'Energizing Event'","25 TikTok Stars Who Got Into Hot Water and Why","Fourth Stimulus Check: Over 60 Lawmakers Now Support Further Direct Payments to Americans","7 Tesla Accessories to Supercharge Your EV Experience","This Fast Food Giant Bragged About Killing $15 Minimum Wage","Trump Will Talk to Supporters 'Directly' in Months on Own Social Network, Says Corey Lewandowski","Justin Trudeau Calls China's Sanctions an 'Attack' on 'Values at the Heart of Our Democracy'","Texas Businessman Places $1 Million Bet on Local Team to Win NCAA Tournament","'Malicious': Democrat Ted Lieu Says Dr. Birx Enabling Trump Caused Many 'Unnecessary Deaths'","Joe Manchin Says Progressives Campaigning Against Him Would Help Him 'More Than Anything'","'Apex Legends' ALGS Winter Circuit Playoffs—Start Time, Leaderboard and How to Watch","Marjorie Taylor Greene Touts Roll Call Tactics Deemed 'Shenanigans' by GOP Colleagues","Powerball Drawing For 03/27/21, Saturday Jackpot is $238 Million","CDC Warns Young Adults Reporting Anxiety, Depression Surpasses 40% as Pandemic Continues","Impress Your Friends With This Simple Whiskey Cocktail","Rep. Andy Kim Shares Story of His 5-Year-Old Son Being Called 'Chinese Boy' by Another Kid","Lara Trump Says Bernie Sanders 'Exactly Right' on 'Scary' Twitter Ban of Donald Trump","John Boehner to Back 'Traitor' Anthony Gonzalez in Defiance of Vengeful Donald Trump","Video of Lee Wong Showing His U.S. Military Scars Viewed Over 2 Million Times","Andrew Cuomo Accused by Ex-Staffer Charlotte Bennett of Office Hazing, as Top Aide Defends Herself"]},{"source":"new-york-magazine","titles":["Now a Democrat Is Accused of Trying to Overturn the Election","Biden Doesn’t Need to Be FDR or LBJ to Change America","What Can Democrats Do About Georgia’s Voting-Rights Restrictions?","Microsoft Buying Discord Would Be 2021’s Best Acquisition","Israel’s Democracy Is Broken, and Netanyahu Is to Blame","21 Things on Sale You’ll Actually Want to Buy: From Chacos to Cuisinart","January 6 Commission Dies, As Republicans Oppose Focus on January 6","Dominion Voting Sues Fox News Over Election Fraud Claims","Republicans in Missouri and Georgia Turn Their Backs on Democracy","Trump Complains Government Is ‘Persecuting’ Capitol Rioters","What Did We Learn About Political Polling in 2020?","‘I Will Be 55 Before I Am Fully Free’","More States Open Vaccinations to All Adults","Amazon Called Out for Denying Workers Are Forced to Pee in Bottles","Georgia Republicans Take Revenge on Voting Rights","Key Moments From President Biden’s First News Conference","Manchin Values Bipartisanship Over Voting Rights","A Few Thoughts About the Big Boat","Deaths of Despair Have Surged Among People of Color","Cuomo Granted His Family Special Access to COVID Testing Last March: Report"]},{"source":"politico","titles":["Collins avoids state-party censure after voting to convict Trump","China sanctions U.S., Canadian officials over Xinjiang","'Be aware': The Pentagon's target list for extremist infiltrators — right and left","DeSantis hires top GOP operative for 2022 campaign","POLITICO Playbook: Boehner backs House incumbent targeted by Trump","Iran, China sign strategic long-term cooperation agreement","Atlanta massacre sparks a political awakening in the Korean church","An Ex-King, Missing Millions and a Monarchy in Crisis","High anxiety over federal weed loophole","Amazon union battle raises stakes for Biden's sweeping labor revival","Joe Biden Can’t Stop Talking About History","Biden team holds fire after North Korean missile launches","WATCH: All roads lead back to the filibuster","Outgoing Ecuador trade minister presses for deal with U.S.","Qatar hires onetime aides to new Foreign Affairs chair, Biden","Biden urges Congress to pass election reform in wake of Georgia voting restrictions","U.S. Navy offers to help clear cargo ship from Suez Canal","Pelosi taps D.C. National Guard chief as top House security official","Sanders pushes Medicare expansion in Dems’ next big bill","Stephen Miller to launch a new legal group to give Biden fits"]},{"source":"reddit-r-all","titles":["/r/privacy/ AMA – I'm Gaël Duval, founder of the de-googled Android OS /e/","Pockit Modular computing demo [video]","An update on the recent issues surrounding a Reddit employee","Over twenty subs including default subs have gone private","Untitled (https://www.reddit.com/r/assholedesign/comments/mapa8q/i_cancelled_our_subscription_with_hp_and_they/)","r/UKPolitics sub-Reddit targeted by Reddit admins","The absolute worst scenario happened","Business Logic in Django Rest framework : django","GraphWrap: extend your Django REST Framework API with a GraphQL interface with just two of lines of code. : django","My recommendation to learn Django : django","Piracy, Overcoming Gravity, and the Digital Edition","My bank sent me 64 copies of the same debit card","YouTube doesn't handle space anymore","Florida is suffering from an epidemic of bald men renting billboards that need to be extended in order to fit their bald heads.","Django admin looks dated and is not mobile friendly, any better options ? : django","Reddit: Online Presence Indicators","Namecheap just snaked another domain off me","Any open source DRF projects? : django","I want this guy working on the unit tests : ProgrammerHumor"]},{"source":"reuters","titles":["Panama to impose temporary ban on travelers from South America - Reuters","Hong Kong says initial investigation of BioNTech vaccines shows no 'obvious systemic factors' - Reuters","Kings acquire Brendan Lemieux from Rangers - Reuters","Orioles acquire RHP Adam Plutko from Cleveland - Reuters","British royal Kate launches book of portraits to remember pandemic - Reuters","Exclusive: Top military officers from U.S., allies to condemn violence by Myanmar security forces - Reuters","Reports: Vikings sign S Xavier Woods to one-year deal - Reuters","Baylor overcomes slow start to bounce Villanova - Reuters","Reports: LaMarcus Aldridge to sign with Nets - Reuters","Mariners reassign top prospect Jarred Kelenic to minors - Reuters","Japan to issue digital vaccine passport: Nikkei - Reuters","Germany must suppress virus now or risk losing control, Merkel aide says - Reuters","Support for Merkel's party falls further in poll, Greens closing in - Reuters","Multiple wounded in stabbing incident in North Vancouver library, suspect in custody: police - Reuters","Rugby: Premiership to receive 88 million pounds govt loan to complete season","Libya's NOC says an oil spill near Dahra field was controlled - Reuters","Astralis take over lead in group play at ESL Pro League Season 13 - Reuters","Boxing champ Oscar de la Hoya to end retirement - Reuters","UPDATE 1-Large block trades involved more than $10bln of stocks sold by Goldman - media - Reuters"]},{"source":"the-american-conservative","titles":["Dana Gioia’s Timeless Piety","How the Deadlift Will Save Your Life","The Left-Wing Network Supporting Border ‘Welcome Centers’","Hanging Separately Doesn’t Sound so Bad","Biden Administration Still Silent About Tyranny in Bahrain","We Will Suffer for Failing to Weigh Risks","Remembering the Green Corn Rebellion","Farms Are Coming to Cities","How to Enact Rational Filibuster Reform","Election Reform: More Access and More Security","Biden Amps Up the Immigration Delivery System","‘Send Them Here!’","Obama is Right About Disaffection","Henry James and Victimhood Culture","Modern Monetary Theory for Conservatives","For Eric Greitens and Mo Brooks, Ambitions at Last Indulged","Tucker Carlson Is Right About the Military","The Return of the Quiet American","Aristotle and Our American Oligarchy","Bait-and-Switch: How Officials Perpetuate Bad Foreign Policy"]},{"source":"the-hill","titles":["Kate Middleton to publish portrait book documenting COVID-19 pandemic in the UK","Mulvaney calls Trump's comments on Capitol riot 'manifestly false'","Democrats disappoint by not going after more Trump regs with CRA","Cuomo aides subpoenaed in sexual-harassment probe: report","Companies sidestep self-imposed bans on GOP donations","Michigan GOP leader apologizes after 'assassination' remark","DeSantis hires veteran GOP operative for 2022 reelection campaign: report","Mother of 6 killed in North Carolina road rage incident","DOJ: New York county violated voter rights in House race","Mo Brooks calls Capitol rioters 'fools'","Sunday shows preview: Spotlight on Georgia voting law; lawmakers tackle gun violence, border surge","Police investigating noose found at DC church as possible hate crime","The digital divide existed long before COVID-19 — let's make sure it doesn't live on after","China sanctions wife of Joe Manchin, other US and Canadian officials","Birx says hundreds of thousands of COVID-19 deaths 'could have been mitigated'","Michigan secretary of state slams GOP: They 'don't believe in democracy'","Former Florida teacher mailed threatening letters, white powder to her previous schools","Venezuelan president's Facebook page flagged for COVID-19 misinformation: Reuters","Milwaukee County drops marijuana possession fine to $1","Kansas state Senate majority leader faces multiple charges for DUI incident"]},{"source":"the-huffington-post","titles":[]},{"source":"the-washington-post","titles":["Birx tells CNN most U.S. covid deaths ‘could have been mitigated’ after first 100,000","County-level covid vaccine data shows lower rates in predominantly Black areas and counties that voted most heavily for Trump - Washington Post","Carter Kieboom sent to minors as Nationals’ roster comes into focus","New Mexico Republicans chose nominee for House seat special election","North Korea conducted more missile tests. What happens next?","PM Update: Gusty thunderstorms to arrive Sunday afternoon","Biden walks the union line, making a play for blue-collar workers","Threat of thunderstorms with damaging winds in D.C. area on Sunday","Asian American official condemns anti-Asian violence by removing shirt, showing his military scars: ‘Is this patriot enough?’","Trump helped the GOP raise $2 billion. Now former aides and allies are jockeying to tap into his fundraising power.","Gun-control activists gird for tough national fight in wake of deadly rampages...","In Myanmar, 'day of terror' with scores dead among anti-coup protesters","Nationals say reliever Will Harris doesn’t have a blood clot after all","Heading for post-pandemic 'Roaring 2020s,' with parties and excess?","Biden is betting on bigger government. The pandemic may be helping him.","Beverly Cleary, through Ramona, captured the essence of childhood","Fauci and others look ahead to the holidays: Put another leaf in the table - Washington Post","Virginia Beach shootings: 2 dead, at least 8 injured after ‘very chaotic night,’ police say - The Washington Post","Michigan GOP leader calls top Democrats ‘witches,’ jokes about assassination of Republicans","As Myanmar death toll climbs, a soldier's wife is caught between protesters and military"]},{"source":"the-washington-times","titles":["Robert Redfield, ex-CDC director, says COVID-19 likely came from lab: 'I'm allowed to have opinions'","SHARON STONE: Cancel culture stupidest thing I have ever seen...","4 being monitored for Ebola virus in Oregon, health officials say","Exclusive: GOP calls for AG Garland to extend ban on fentanyl knockoffs","Rachel Levine, transgender official, confirmed by Senate as assistant secretary of health","Army pulls the pin on 'gender neutral' combat fitness test; creates separate tiers for men, women","New York Times: Current aide accuses Cuomo of sex harassment","Ousted NEW YORK TIMES reporter slams newsroom's culture: 'Mean, spiteful, vengeful place'...","‘Three Warfares’: U.S. pummeled by covert disinformation war waged by Russia, China","About to learn his definition of 'fair share'...","Terror suspects part of border surge...","For Biden, there's no place like a weekend home in Delaware","Pentagon goes to war with FOXNEWS over 'feminizing' military...","NEXT: Gun Control?","Obama, Bush, Clinton, Carter push COVID-19 vaccination","Jay Bhattacharya, Stanford doctor: Lockdowns 'single worst public health mistake' in last 100 years","Justice Amy Coney Barrett riles conservatives with moderate rulings...","Illegal immigrants shouldn't be included in congressional count","'It is not right': Bill offers hope that flyers of CIA's Air America will finally win recognition","'Extraordinary crisis': Democrats' revolutionary climate change bill aims to remake U.S. economy"]},{"source":"time","titles":["‘We Not Human At All.’ Why the Fight to Unionize an Alabama Amazon Warehouse Could Spur a Labor Union Resurgence","Dozens Killed in Deadliest Day of Myanmar Coup","New Attempts Planned to Free Huge Ship Stuck in Suez Canal","2 Dead in Virginia Beach Oceanfront Shootings: Police","Beverly Cleary, Legendary Children’s Author Who Quietly Revolutionized Kid Lit, Dies at 104","With Six Minutes to Midnight, Eddie Izzard Spins an Unusually Gentle-Spirited Spy Tale","I Wear My Son’s Jacket to Remind Me Of What’s At Stake in Fighting Gun Violence","A Democrat Is Challenging the Election Result in Her District. Republicans Are Seizing the Moment","Joe Biden Proved a Press Conference Doesn’t Have to Be a Spectacle","Supreme Court ‘Seizure’ Ruling Set To Allow More Police Excessive Force Lawsuits To Move Forward","‘Garbage Freaking Everywhere’ as Americans Venture Outdoors After a Year of Lockdowns","The Father Offers an Unsparing Glimpse into the Trials, and the Mysteries, of Old Age","Netflix’s The Irregulars Isn’t a Great Sherlock Holmes Spinoff—But It’s Still a Lot of Fun","Netflix’s Serial Killer Drama The Serpent Is Nihilistic Murder Porn in Prestige True-Crime Packaging","North Korea Confirms Missile Tests as Biden Warns of a Response","The U.N. Is Warning of an ‘Alarming’ Crisis in Ethiopia’s Tigray Region","Georgia Has Enacted Sweeping Changes to Its Voting Law. Here’s Why Voting Rights Advocates Are Worried","Immigration, Guns and the Filibuster: Joe Biden Confronts Challenges in First Press Conference","Here’s Why Taylor Swift Is Re-Releasing Her Old Albums","How a Shared Goal to Dismantle White Supremacy Is Fueling Black-Asian Solidarity"]},{"source":"usa-today","titles":["The Nets now have an absurd amount of All-Star appearances with LaMarcus Aldridge addition","Sixers coach Doc Rivers reacts to LaMarcus Aldridge joining Nets","No. 4 Indiana upsets No. 1 NC State in women's NCAA Tournament to reach first ever Elite Eight","Sixers provide injury updates on big man Joel Embiid, George Hill","Updated draft order ahead of Cowboys after Friday’s big trades","Report: Tyson Alualu returning to Steelers after initially coming to terms with Jags","Video: Marc-Andre Barriault opens UFC 260 with TKO, stops Abu Azaitar with 4 seconds left","(2) Houston vs. (11) Syracuse live stream, NCAA March Madness, TV channel, how to watch","Elite Eight or sent packing: Winners and losers from the men's NCAA Tournament Sweet 16","UFC 260: Best photos from Las Vegas","Kelly Olynyk starts for Rockets, Christian Wood out with sore right ankle","UFC 260: Official scorecards from Las Vegas","Tony Bradley arrives in OKC; Austin Rivers still away from Thunder","Flyweight contenders Joanne Calderwood, Lauren Murphy to square off at UFC 263","Key defender returns to Pittsburgh by way of Jacksonville","No. 1 seed Baylor survives No. 5 Villanova, advances to Elite Eight in men's NCAA Tournament","Al Horford, Sam Presti release statements about shutting down the veteran center","Are the Texans going to wait until after the draft to trade QB Deshaun Watson?","'This affects all of us': Marches, rallies against Asian hate crimes see widespread participation","Nets adding another All-Star in LaMarcus Aldridge after buyout with Spurs"]},{"source":"vice-news","titles":["Wie man Fotos postet, ohne zu verraten, wann und wo sie entstanden sind","Daily Horoscope: March 28, 2021","Police Screamed at a 5-Year-Old and Told Him Handcuffs Would Be His ‘Best Friend’","Daily Horoscope: March 27, 2021","Ohhhh, Snap: The Tesla of Sex Toy Companies Has a New Vibrator","Beabadoobee and Christian Leave in conversation","Meghan McCain’s Hair Is a Hypocritical Mess","Boulder Shooting Suspect Bought His AR-15-Style ‘Pistol’ Legally","Léa Seydoux for Louis Vuitton and unlimited Telfar bags: What’s in fashion?","The Best Blue Light Glasses (That Also Make You Look Cooler)","We Are Way Too Invested In Celebrity Relationship Scandals","El Salvador Surfing Community In Mourning After Olympic Hopeful Katherine Díaz Killed By Lightning Strike","UN Peacekeeper Ordered to Pay Child Support for Baby He Abandoned","How to Make Small Talk After We've Been Through... a Pandemic","George Floyd Tribute Vandalized With His Toxicology Report: ‘Mix of Drugs Presents in Difficulty Breathing!’","People are ‘Revenge Shopping’, but what does 'Revenge Dressing' look like in 2021?","The Only Excuse You Need to Keep Your Webcam off Forever: Climate Change","Republican Legislator Is Very Sorry About His Harvey Weinstein-Themed Zoom Background","How to Meet Up with Online Friends From Quarantine Without Making It Weird","Eric André Will Prank, Even If the World Is Falling Apart"]}]