[{"source":"abc-news","titles":["Pope grants German archbishop faulted over abuse 'time out'","Man jailed for sabotage of German high-speed railway line","'Captain Underpants' book pulled for 'passive racism'","Hungary first in European Union for vaccinations, and deaths","Spain targets Africa in boost of diplomatic, business ties","Paris court convicts, fines pharma firm for deadly diet pill","Storm brings winds, fire danger and flash flooding from Plains to the Gulf Coast","German government buys stake in defense supplier Hensoldt","No Oscars or sensitive art spark Hong Kong censorship fears","EU commissioner visits refugee facilities on Greek islands","ICU cases creep toward new peak in French virus surge","AP Exclusive: WHO report says animals likely source of COVID","Merkel faults German 'perfectionism' for current virus woes","Engineers start to refloat ship stuck in Egypt's Suez Canal","Afghan group probes reports of 20 civilians killed in Khost","Tributes paid to Czech billionaire killed in chopper crash","Happy Monday? England embarks on major easing of lockdown","The Latest: Portugal tightens COVID-19 flight restrictions"]},{"source":"al-jazeera-english","titles":["Mozambique: Thousands flee besieged Palma by boats","Here’s what to expect as Chauvin’s murder trial begins","Myanmar protests continue amid reports of killings in Yangon","Lebanon could sink like the Titanic, warns parliament speaker","Amid war, Ukraine tries to boost arms sales","US COVID deaths could have been ‘decreased substantially’","Amnesty makes last-minute appeal to France over ‘separatism’ bill","Ivory Coast military camp comes under attack: Sources","‘Lockdown on thoughts’: Kashmiris slam India’s free speech curbs","UAE to manufacture Chinese COVID vaccine in Abu Dhabi","Qatari emir, MBS discuss environmental challenges in phone call","Egypt makes arrests over fatal train crash in Sohag: Prosecutor","A cold civil war is being waged in America","WHO report says animals likely source of COVID: AP","Hong Kong seen listing first ‘blank-cheque’ firm by year-end","India celebrates Holi amid alarming surge in COVID cases","‘Cooked’: Cricketers suffering in bio-secure bubbles, says Kohli","Alibaba-backed video site Bilibili slumps in Hong Kong debut","Chile postpones constitutional assembly poll as COVID cases spike","Pakistan continues to grapple with third wave of coronavirus"]},{"source":"associated-press","titles":["Spain targets Africa in boost of diplomatic, business ties","Dear Normal: Were you really that great in first place?",null,"Liz Weston: If you need to find tax help, try DIY first","Still stuck...","Global banks warn of possible losses from hedge fund default...","Stuck ship thrusts sleepy Suez Canal village into limelight","EU commissioner visits refugee facilities on Greek islands","Obama family matriarch has died in a Kenyan hospital at 99","Tributes paid to Czech billionaire killed in chopper crash","Happy Monday? England embarks on major easing of lockdown","The Latest: Portugal tightens COVID-19 flight restrictions","AP Interview: Japan urges EU to ensure stable vaccine export","Obama family matriarch has died in a Kenyan hospital at 99 - The Associated Press","China pressures brands to reject reports of Xinjiang abuses","French pharma firm faces verdict for deadly diet pill","Asian stocks mixed amid vaccine, stimulus optimism","Dear Normal: Were you really that great in the first place?","NCAA tourney hits halfway point, still the field vs. Gonzaga"]},{"source":"axios","titles":["Eight of the 10 most-followed NCAA Elite 8 basketball players are women","Economists increasingly giddy at prospect of $3 trillion Biden infrastructure plan","Derek Chauvin trial opening statements: What to expect","Schumer aides pitch new theory for passing bills with simple Senate majority","Amazon's scorched-earth PR strategy","Google alum launches new progressive tech coalition - Axios","Moderate Democrats buck Biden tax hikes","Millions of Americans remain vulnerable as variants drive up cases","Redfield accuses Azar of trying to interfere with COVID report in Trump admin","Suez update: Ship partially freed","Nashville mayor declares emergency after deadly flooding","U.S. border agency projects surge in child migrant crossings to last at least 7 months","Secretary of State Blinken evades question on punishing China for COVID handling","Two top Democrats want support from at least 10 Republicans for gun background check bill","A progressive group plans to spend millions connecting green energy to jobs","New Jersey parents sue school districts to force them to reopen","COVID-19 rates of infection surge in New Jersey, New York - Axios","As Dems control Washington, GOP flexes power in states and courts","White House aide: U.S. will address border surge with diplomacy","Sen. Warnock says Biden's stance on voting rights reminds him of Lyndon Johnson"]},{"source":"breitbart-news","titles":["Germany: Left-Wing Candidate to Replace Merkel Backs EU Army","Kudlow: Biden’s Push to Raise Taxes, Wage War on Business ‘Nuts’","Media Ask Joe Biden the ‘First Sweet’ He Plans to Eat After Lent","DHS Readies Welcome for 800,000 ‘Family Migrants’","Joe Biden: ‘I Don’t Care’ if Donald Trump Visits the Border","NRA Memberships Spike as Droves of Americans Reject Democrat Gun Control","Mike Braun: Democrats Hope Illegal Aliens Become ‘Voters’ Through Open Borders","Kennedy: Putting Kamala Harris in Charge of Border Crisis Like Making Lance Armstrong Drug Czar","Saints’ Marshon Lattimore Arrested in Stolen Gun Case","Exclusive: Mike Braun Meets with Leaders at Border Who Call Impacts of Crisis ‘Unbearable,’ ‘Humanity Bleeding’","Michigan Republicans Mull Election Integrity Petition Drive to Thwart Gretchen Whitmer Veto","Fauci Says MLB Coronavirus Restrictions Could Relax by ‘Late Spring’","VIDEO: Veteran Receives over 150 Cards to Celebrate His 90th Birthday","SD House Speaker to Reject Gov. Kristi Noem’s Request to Rework Bill on Transgender Athletes","Morgan Wallen's 'Dangerous' Tops U.S. Album Chart for 10th Week","Previously Deported Illegal Alien Charged with Killing Two-Time Cancer Survivor","Border State Cops in Mexico Rescue Migrants Kidnapped by Gulf Cartel","Maxine Waters: Police Believe Their Job ‘Is to Keep Black People in Their Place’","Fauci Warns Parents about Children Playing Together Without Masks","VIDEO: Officer Hospitalized, Inmate Shot Dead After Hostage Situation at Oklahoma Jail"]},{"source":"cbs-news","titles":["Flu epidemic grows in U.S.","Independent study finds toxic carcinogen above FDA limit in several hand sanitizer brands","Not every Democrat in Iowa is crazy about Hillary","Child nearly drowns in cruise ship pool","Two prospects for U.S. ski team killed in avalanche","Flu season is getting worse","Hedge fund manager fatally shot in NYC","The coolest, most expensive TVs at CES","Attorney Ben Crump and George Floyd's brother, Philonise Floyd, on first day of Derek Chauvin trial","Egypt's president issues bold call for Islamic reform","Iran's president threatens to hold national referendum","Forbes reveals \"30 under 30\" list","Lions get Christmas trees as post-holiday treats","What to expect in technology in 2015","Why consumers are moving towards streaming rather than buying songs","3-week-old girl found dead in SoCal dumpster","Remembering ESPN anchor Stuart Scott","Gov. Christie defends hug after Dallas Cowboys win","More than 100 people killed by security forces in Myanmar's deadliest day of protests","Watch: Firefighters and civilians combat massive wildfire in Australia"]},{"source":"cnn","titles":["كيف استخدم المتظاهرون الإنترنت لتنظيم صفوفهم وسط أحداث العنف في ميانمار؟","There are 'definitely merits' to reparations, says the first Black Fed president","El comercio de vida silvestre es la vía más probable para que el coronavirus llegara a Wuhan, dice un experto de la OMS","All hands on deck as Suez locals ply food and wares to growing numbers of hungry, stranded crews","Why Virginia's abolition of the death penalty is a big deal for the state and the US","في \"المقهى الصامت\" بالعراق.. التعامل بلغة الإشارة","One in five Colorado high school students say they have easy access to firearms","تهدئ أكثرها وحشية.. فنان يعزف موسيقى كلاسيكية في حديقة حيوانات","The Covid-19 war in the Trump White House","Sports world should boycott Georgia over racist voting law","عشرات القتلى والمفقودين في هجوم لمجموعة إرهابية على علاقة بداعش في موزمبيق","Superyacht feature transports passengers underwater in minutes","أي لقاح هو الأفضل لك؟ سانجاي غوبتا يجيب على مزيد من الأسئلة عن كورونا","Algunos estados de EE.UU. informan aumentos de casos de covid-19, y uno advierte que el repunte ya está aquí","Lil Nas X lanza unos tenis ‘Nike Satan’ no oficiales que contienen sangre humana","5 things to know for March 29: Coronavirus, Suez Canal, Chauvin trial, Myanmar, LGBTQ rights","The US needs a Marshall Plan for global vaccinations","El proceso de Derek Chauvin por la muerte de George Floyd es el mayor juicio en la era de la transmisión en directo","Pentagon could open itself to costly litigation from contractors if US pulls out Afghanistan this year"]},{"source":"fox-news","titles":["Paris court convicts pharma firm Servier of manslaughter after diabetes drug was prescribed as diet pill","Gov. Noem & Dannenfelser: Unborn babies with Down syndrome diagnosis deserve love and protection","Panthers' Aaron Ekblad stretchered off the ice with leg injury vs. Stars","Cuomo admin. kept COVID-19 tests from nursing homes as Dem's relatives got them","Terrell Owens reveals he was in scary car crash: 'This could have been worse'","WHO-China report claims coronavirus lab leak 'extremely unlikely,' suggests animal-human transmission","Colts' Darius Leonard takes issue with coverage of Deshaun Watson lawsuits vs. Chad Wheeler arrest","National weather forecast: High winds to stretch from Rockies to Plains","Rev. Samuel Rodriguez: Hispanic and Latino voters' to-do list – Biden admin must address these 3 issues","Republicans go all-in on attacking Dems' election reform bill","Kamala Harris: What to know about America's first female vice president","Lakers hold off Magic 96-93, win again without LeBron, Davis","Gordon scores 13 in Denver debut, a 126-102 win over Hawks","Josi lifts Predators past Blackhawks 3-2 for 5th straight","Newt Gingrich: Pelosi's Iowa power grab – here's why House speaker is trying to steal this seat","Texas teen allegedly abducted by her estranged sex-offender dad in 'extreme danger'","Liz Peek: Biden has no mandate – here's why he was really hired and how his left-wing agenda will backfire","Auburn bass fishing team suspended for year over COVID-19 violation: report","Harris reportedly frustrated with ongoing VP mansion renovations amid border crisis","LIVE UPDATES: Derek Chauvin trial begins today"]},{"source":"google-news","titles":["Show HN: Send Message in Batch from SpreadSheet with EasyMessaging","Show HN: Note Making on WhatsApp","Show HN: Last Time – App that helps you remember the last time you did something",null,"La Academia de Marketing Online - Es pronto para rendirte | Episodio 46","Michihito Ando - SNSにおける研究者の情報発信のあり方について","Show HN: Simple Time Tracker","New for education sites: Practice problems and Math solver structured data","Show HN: Wikiyarn – Smarter way to browse Wikipedia","emergency plumber service San Francisco California","Emergency Plumbing Service San Jose California Articles","24 Hour Emergency Plumber San Jose California Logo.jpg","24 Hour Plumber San Jose California.jpg","24 Hr Plumber San Jose California.png","24 Hr Plumbing Services San Jose California.jpg","24hr Plumber San Jose California.jpg","24hour Plumber San Jose California.jpg","24 Hrs Plumber San Jose California.jpg","header for best blumbing san jose.jpg","Emergency Plumbing Services San Jose California.jpg"]},{"source":"msnbc","titles":["Why one part of the Georgia Republicans' anti-voting law stands out","Mitt Romney won the JFK \"Profile in Courage\" award because of his colleagues' cowardice","Can you be fired for calling Trump crazy? Why this psychiatrist is taking Yale to court","Why QAnon keeps finding new 'clues' to obsess over","Ship stuck in the Suez Canal disrupts global trade, but makes good memes","Evanston, Ill. has made a down payment for national Black reparations","Even by GOP standards, Biden admin vaccine progress is impressive","Some very conservative judges made it easier for civilians to sue cops","Trump hosts the first of many 'Apprentice'-style Republican meetings","Why a red state wants to ignore voters, reject Medicaid expansion","Why Trump became the latest Republican to defend Jan. 6 rioters","With Georgia imposing radical voting restrictions, what happens now?","Whitewashing the filibuster erases its legacy of harming Black Americans","Biden's first press conference was substantive and thoughtful. Trump could never.","Unemployment claims improve, drop below major threshold","Manchin makes his case against his party's democracy reform package","7 right-wing myths, half-truths and lies about immigration that need to end","As momentum shifts, the filibuster rule is running out of friends","Senate Republicans look for new ways to justify anti-voting efforts","The problem with one GOP senator's case against 'Souls to the Polls'"]},{"source":"national-review","titles":["Ship Blocking Suez Canal Partially Freed","Moderate Dems Signal Resistance to Biden Tax Increases","Don’t Cut Seniors’ Drug Coverage to Fund Another Spending Spree","Why Is Congress Giving Its Powers Away?","Psaki: Biden Admin ‘Absolutely Committed’ to Allowing Reporters into Border Facilities","Trump Says He’ll Probably Visit Border ‘over the Next Couple of Weeks’","Biden Official Asked GOP Senators to Delete Photos of Border Facilities, Senator Says","Jack Phillips Will Not Back Down: ‘Worth It to Fight’","Cuomo Aides Subpoenaed in Sexual-Harassment Probe","The Fed’s Shabby Green Logic","Sharon Osbourne Leaves The Talk amid Fallout from Piers Morgan Defense","Georgia Elections Officials Compare Dem ‘Voter Suppression’ Claims to Trump’s Fraud Allegations","San Francisco School Board Member Stripped of Position over Anti-Asian Tweets","Biden Labels New Georgia Voting Law an ‘Atrocity’","China’s Climate Realpolitik","CBO: ‘Our New Debt Projections Are Already Obsolete’","Oakland Implements First of Its Kind Race-Based Guaranteed Income Plan","Colorado Shooter Passed Background Check before Gun Purchase","Biden Nominates Joe Manchin’s Wife to Co-Chair Appalachian Regional Commission","The EU’s Vaccine Shambles — and How a Distrust of Free Markets Made It Worse"]},{"source":"nbc-news","titles":["Derek Chauvin trial live updates and the death of George Floyd","Mother of six killed in North Carolina road rage shooting, police say","Mexico's coronavirus death toll is likely 60% higher than confirmed numbers","5 killed in Alaska helicopter crash, including richest Czech man","Maryland man fatally shoots 4, including his parents, before killing self","Millennials, forged by recession and ridicule, are ascendant in Washington","A bill was designed to tackle Islamic extremism. Critics say it attacks core French values.","Suez Canal ship partially refloated after huge effort to unblock key global trade route","George Floyd family members, leaders hold prayer service on eve of trial","Wisconsin lawmakers want to end party primaries in Congressional races","After Oklahoma pastor's murder, wife and alleged accomplice in love triangle arrested","Nike denies involvement with Lil Nas X 'Satan Shoes' containing human blood","Birx recalls 'very difficult' call with Trump, says hundreds of thousands of Covid deaths were preventable","Drunk rape victim was not 'mentally incapacitated,' Minnesota Supreme Court rules","With no specifics, White House says it's working on access to migrant centers","Biden economic plan to focus 1st on infrastructure this week","Want to understand how discriminatory gaslighting works? Look to Meghan and Harry","At least four people dead after Nashville floods, 130 rescued","Containers could be taken off stranded Suez ship, officials say as salvage efforts continue","Bomb squad detonates live Civil War cannonball found in Maryland"]},{"source":"newsweek","titles":["What Kate Middleton's Uncle Said About Claim She Made Meghan Markle Cry","I'm a Working Class Latino Man. What the Border Crisis Means to Me | Opinion","After a Year of Pandemic Schooling, Let's Focus on Student Well-Being, Not Grades | Opinion","Want Justice for George Floyd? Root for a Fair Trial, Not a Specific Outcome | Opinion","SSDI Stimulus Check Update—Social Security Admin Says 'Many Have Already Received' Payment","Cougar or Mountain Lion? Image Leaves Internet Divided Over What You Call Wild Cat","Tax Preparer Pulls Gun on Customer Who Complained About Filings, Police Say","'Black Adam': Everything We Know About the Rock's DC Movie","The Semiotics of Sorry: How to Apologize | Opinion","Donald Trump's Wedding Speech Transcript in Full: Ex-President Takes Stage at Mar-a-Lago","When Will Kids Get COVID Vaccines?","Did Derek Chauvin Work With George Floyd? Their Relationship Explained","Lil Nas X Shuts Down Joyner Lucas Over 'Montero' Criticism","'Shy' Stray Cat Turns Out to Be Pet That Went Missing for Almost Two Years","Joseph Edward Duncan, Serial Killer Who Slaughtered Family, Dies on Death Row","'Extremely Unlikely' COVID Came From Lab Draft WHO Report Says, As Ex-CDC Head Touts Claim","Petr Kellner Net Worth: How Billionaire Dead in Helicopter Crash Made His Fortune","George Floyd's Brother Has 'Faith' Derek Chauvin Will Be Convicted","Our 'Front Line' With China Is the Mexico Border | Opinion","Royal Family's Eighth COVID Scandal as Queen's Grandson Visits Female Friend in Scotland"]},{"source":"new-york-magazine","titles":["Biden’s First Big Break With His Allies Is Over School Reopenings","Biden Admin Is Weighing Vaccine Passport Rollout: Report","Suez Canal Ship Is Still Stuck: Updates","How Johnson & Johnson’s Vaccine Became the Hot Shot","Now a Democrat Is Accused of Trying to Overturn the Election","Biden Doesn’t Need to Be FDR or LBJ to Change America","What Can Democrats Do About Georgia’s Voting-Rights Restrictions?","Microsoft Buying Discord Would Be 2021’s Best Acquisition","Israel’s Democracy Is Broken, and Netanyahu Is to Blame","21 Things on Sale You’ll Actually Want to Buy: From Chacos to Cuisinart","January 6 Commission Dies, As Republicans Oppose Focus on January 6","Dominion Voting Sues Fox News Over Election Fraud Claims","Republicans in Missouri and Georgia Turn Their Backs on Democracy","Trump Complains Government Is ‘Persecuting’ Capitol Rioters","What Did We Learn About Political Polling in 2020?","‘I Will Be 55 Before I Am Fully Free’","More States Open Vaccinations to All Adults","Amazon Called Out for Denying Workers Are Forced to Pee in Bottles","Georgia Republicans Take Revenge on Voting Rights","Key Moments From President Biden’s First News Conference"]},{"source":"politico","titles":["SUEZ CANAL ripple effect — POPULATION ups and downs — DUCKWORTH for president?","House Dems weigh statewide races with redistricting looming","Deal finalized to legalize marijuana — NY and NJ lead nation in coronavirus infections — Cuomo aides subpoenaed","WHO report says animals likely source of Covid","SOCIALISTS plan SOMERVILLE TAKEOVER — Inside AMAZON’S TWITTER WAR against ELIZABETH WARREN — Could a SHIP get STUCK in the CAPE COD CANAL?","New York may deserve to be called the Garden State","Chuck Schumer’s 51-vote gambit","Ship ‘partially refloated,’ but still stuck in Suez Canal","Biden admin remakes vaccine strategy after mass vaccination sites fizzle","Pete Buttigieg has a bridge to sell you","Redistricting disarray nudges House Democrats toward statewide bids","Opinion | The $15 Minimum Wage Isn’t the Only Way to Raise Worker Pay.","Biden’s carbon bank proposal faces growing skepticism","North Korea accuses U.N. of double standard over missile firings","Heavy burden for jurors in case of George Floyd's death","Blinken punts on punishing China for coronavirus outbreak","Rep. Judy Chu ‘concerned’ Atlanta spa suspect may not be charged with hate crime","Warnock: ‘We have to pass voting rights no matter what’","N.Y. congressman: Border crisis due to decades and decades of bad U.S. behavior","Dissension inside The Washington Post"]},{"source":"reddit-r-all","titles":["/r/privacy/ AMA – I'm Gaël Duval, founder of the de-googled Android OS /e/","Pockit Modular computing demo [video]","An update on the recent issues surrounding a Reddit employee","Over twenty subs including default subs have gone private","Untitled (https://www.reddit.com/r/assholedesign/comments/mapa8q/i_cancelled_our_subscription_with_hp_and_they/)","r/UKPolitics sub-Reddit targeted by Reddit admins","The absolute worst scenario happened","Business Logic in Django Rest framework : django","GraphWrap: extend your Django REST Framework API with a GraphQL interface with just two of lines of code. : django","My recommendation to learn Django : django","Piracy, Overcoming Gravity, and the Digital Edition","My bank sent me 64 copies of the same debit card","YouTube doesn't handle space anymore","Florida is suffering from an epidemic of bald men renting billboards that need to be extended in order to fit their bald heads.","Django admin looks dated and is not mobile friendly, any better options ? : django","Reddit: Online Presence Indicators","Namecheap just snaked another domain off me","Any open source DRF projects? : django","I want this guy working on the unit tests : ProgrammerHumor"]},{"source":"reuters","titles":["UK doesn't have vaccine surplus to share: PM's spokesman - Reuters","UK court rules LCF bondholders not eligible for compensation - Reuters","Bank of England acts to limit fallout from banking glitches - Reuters","Union urges shareholders to vote against Marathon exec pay -letter - Reuters","Stellantis to halt production at Italian car plant in April, union says - Reuters","UK's Raab visits Gibraltar to discuss post-Brexit treaty - Reuters","Nomura still has positions to unwind -Bloomberg citing Japan govt official - Reuters","Southwest Airlines adds 100 orders for Boeing 737 MAX jet - Reuters","Spain's government deficit reached 10.09% of GDP in 2020 - Reuters","Coal-powered industry plan for South Africa's 'Eden' sparks green outcry - Reuters","SomaLogic to merge with Keith Meister-backed SPAC in $1.23 billion deal - Reuters","WHO says virus origins report will be released on Tuesday - Reuters","News Corp buys Houghton Mifflin's consumer arm for $349 mln - Reuters","Applied Materials terminates $2.2 bln deal for Japan's Kokusai Electric - Reuters","Brazil services confidence in March slumps to lowest since last June - survey - Reuters","Brazil services confidence in March slumps to lowest since last June - survey - Reuters.com","Thailand loses 1.45 million tourism jobs from pandemic: tourism group - Reuters.com","Property management company owned by China's Wanda attracts pre-IPO investment - Reuters","EXCLUSIVE-Italy to cut 2021 GDP forecast to 4.1%, raise 2022 to 4.3% - sources - Reuters.com"]},{"source":"the-american-conservative","titles":["What the ‘Lost Generation’ Got Right","America in Blackface: The Real ‘Identity Hoaxers’","The Right Kind of Realignment","All the Ways We Can Politicize a Tragedy","The Miseducation of Boston’s Elite","Dana Gioia’s Timeless Piety","How the Deadlift Will Save Your Life","The Left-Wing Network Supporting Border ‘Welcome Centers’","Hanging Separately Doesn’t Sound so Bad","Biden Administration Still Silent About Tyranny in Bahrain","We Will Suffer for Failing to Weigh Risks","Remembering the Green Corn Rebellion","Farms Are Coming to Cities","How to Enact Rational Filibuster Reform","Election Reform: More Access and More Security","Biden Amps Up the Immigration Delivery System","‘Send Them Here!’","Obama is Right About Disaffection","Henry James and Victimhood Culture","Modern Monetary Theory for Conservatives"]},{"source":"the-hill","titles":["Schumer eyes bypassing filibuster for third bill","Americans really love politics","Obama family matriarch dies in Kenya","Birx says inconsistent messaging was 'biggest mistake' in fight against COVID-19","'Keeping Up With the Cuomos' becomes a full-blown scandal for once-beloved tandem","Trump rails against Biden during Mar-a-Lago wedding speech","Ship in Suez Canal partially un-stuck","Container ship stuck in Suez Canal partially refloated","WHO report says transmission from animal is most likely source of coronavirus: report","The Hill's Morning Report - Biden to talk infrastructure amid border, voting controversies","Juan Williams: The GOP's big lie on voting rights","Schumer kicks into reelection mode","Democrats gear up for major push to lower drug prices","The Memo: Biden seeks a secret weapon — GOP voters","Lin Wood to run for South Carolina GOP chair","Fauci: Trump's call to 'liberate' Virginia, Michigan 'hit me like a punch to the chest'","Redfield says he thinks COVID-19 began spreading in Wuhan in September or October","Piers Morgan pens Daily Mail op-ed about recent scandals, defends Sharon Osbourne after her 'The Talk' exit","Fauci says he and Birx had 'bad cop,' 'good cop' roles on Trump coronavirus task force","Suspect in custody after firing at Florida national park rangers: NPS"]},{"source":"the-huffington-post","titles":[]},{"source":"the-washington-post","titles":["Woodlands Indian restaurant is without a home, but its vegetarian menu remains close to my heart","Mitch McConnell once knew all about the filibuster’s racist history. What changed?","Republicans’ blunder on voting rights","China's propaganda machine kicks into high gear over Xinjiang criticism","Live updates: Biden to provide update on government’s response to pandemic, including vaccinations","Voter suppression started way before Jim Crow. It’s a longstanding American tradition.","How Transformer’s Victoria Reis would spend a perfect day in D.C.","You can’t take your eyes off Trea Turner. Sometimes he wishes you would.","Against the odds, Cuba could become a coronavirus vaccine powerhouse.","For racially biased conservative Whites, owning a gun is just part of being a good citizen","As Myanmar's security forces crush anti-coup protests, more and more children are dying","D.C.-area forecast: Brisk sunshine today, milder into midweek, then sharply colder","Taiwan's pet psychics gain ground with animal lovers looking for a connection","Even the GOP’s three best arguments against D.C. statehood don’t stand up to scrutiny","Ukraine wants to show Biden it's serious about ending 'oligarch era.' That's not so easy.","No, Delaware doesn’t specifically prohibit food or water at the polls like Georgia","Covid-19 live updates: Former Trump officials offer stark assessment of previous administration's coronavirus response","Czech billionaire Petr Kellner among five killed in Alaska helicopter crash - The Washington Post","Giant Ever Given ship blocking Suez Canal partially refloated, amid hopes of unblocking waterway","Myanmar's rising body count"]},{"source":"the-washington-times","titles":["Robert Redfield, ex-CDC director, says COVID-19 likely came from lab: 'I'm allowed to have opinions'","SHARON STONE: Cancel culture stupidest thing I have ever seen...","4 being monitored for Ebola virus in Oregon, health officials say","Exclusive: GOP calls for AG Garland to extend ban on fentanyl knockoffs","Rachel Levine, transgender official, confirmed by Senate as assistant secretary of health","Army pulls the pin on 'gender neutral' combat fitness test; creates separate tiers for men, women","New York Times: Current aide accuses Cuomo of sex harassment","Ousted NEW YORK TIMES reporter slams newsroom's culture: 'Mean, spiteful, vengeful place'...","‘Three Warfares’: U.S. pummeled by covert disinformation war waged by Russia, China","About to learn his definition of 'fair share'...","Terror suspects part of border surge...","For Biden, there's no place like a weekend home in Delaware","Pentagon goes to war with FOXNEWS over 'feminizing' military...","NEXT: Gun Control?","Obama, Bush, Clinton, Carter push COVID-19 vaccination","Jay Bhattacharya, Stanford doctor: Lockdowns 'single worst public health mistake' in last 100 years","Justice Amy Coney Barrett riles conservatives with moderate rulings...","Illegal immigrants shouldn't be included in congressional count","'It is not right': Bill offers hope that flyers of CIA's Air America will finally win recognition","'Extraordinary crisis': Democrats' revolutionary climate change bill aims to remake U.S. economy"]},{"source":"time","titles":["Thousands of People Are Fleeing Into Thailand Following Air Strikes in Myanmar","The Draft of a WHO Report Says Animals Were the Likely Source of COVID-19","The Huge Cargo Ship Blocking the Suez Canal Is Now Afloat, Maritime Company Says","Flash Flooding in Tennessee Leaves 4 Dead After Record Rains","Suicide Bombing Wounds 20 People During Palm Sunday Mass in Indonesia","New York Lawmakers Agree to Legalize Recreational Marijuana","“It’s Not Just About Shots.” Judith McKenna, Walmart International CEO, Talks Vaccination Rollout","I Found a Rainbow At the End of My Hunt For a Vaccine Appointment","‘We Not Human At All.’ Why the Fight to Unionize an Alabama Amazon Warehouse Could Spur a Labor Union Resurgence","Dozens Killed in Deadliest Day of Myanmar Coup","New Attempts Planned to Free Huge Ship Stuck in Suez Canal","2 Dead in Virginia Beach Oceanfront Shootings: Police","Beverly Cleary, Legendary Children’s Author Who Quietly Revolutionized Kid Lit, Dies at 104","With Six Minutes to Midnight, Eddie Izzard Spins an Unusually Gentle-Spirited Spy Tale","I Wear My Son’s Jacket to Remind Me Of What’s At Stake in Fighting Gun Violence","A Democrat Is Challenging the Election Result in Her District. Republicans Are Seizing the Moment","Joe Biden Proved a Press Conference Doesn’t Have to Be a Spectacle","Supreme Court ‘Seizure’ Ruling Set To Allow More Police Excessive Force Lawsuits To Move Forward","‘Garbage Freaking Everywhere’ as Americans Venture Outdoors After a Year of Lockdowns"]},{"source":"usa-today","titles":["Cargo ship Ever Given partially turned in the Suez Canal. But 'don't cheer too soon,' official says.","1 student dead, another missing after Iowa State Crew Club boat capsizes during practice","There are so many reasons to root for Gonzaga to win the men's NCAA tournament","Stanford's Anna Wilson finds joy, purpose in defense. We should celebrate her for it.","In Kaitlyn Greenidge's vivid 'Libertie,' a young Black woman forges her own path","Carolina Panthers 2021 free agency: One thing to like about every signing so far","Cardinals’ moves in free agency do nothing for their status in new power rankings","After much studying ahead of time, Omar Morales had to adjust plan vs. Shane Young","Opinion: 'We lost:' This time when fighting racism, the sports world failed","New-look Nuggets flash their huge potential in first game with Aaron Gordon","Titans named best fit for free-agent RT Mitchell Schwartz","After some time off, Marc-Andre Barriault wants a shot at Eryk Anders","Cool ways to get out on the water this spring: Bioluminescent kayak tours in Florida, fliteboarding in Hawaii","‘I was just so happy and proud’: The world saw another side of Dustin Johnson when his post-Masters tears flowed","Seven X-factor players in men's NCAA Tournament Elite Eight who could spearhead Final Four runs","Four takeaways from the Sweet 16 that matter for the Elite Eight of men's NCAA Tournament","Derek Chauvin trial live: Opening statements to begin Monday after hundreds gathered to honor George Floyd's life","Nursing home isolation, Oahu weddings, eligibility rolls: News from around our 50 states","'They need to be watched': How livestreaming the Derek Chauvin trial lets people of color monitor the justice system","George Floyd's death was traumatizing for Black teens in Minneapolis. They fear the trial will be just as painful."]},{"source":"vice-news","titles":["TikTok Said It Was Banning Extremist Content. Instead It’s Promoting It","André Aciman stans Lil Nas X","The Future of Fame Is the Fan","A Guide to Gossip Around the Globe","Shooting the Famous From Within Their Ranks","Chase Icon Just Wants to Live Up to Her Name","The Fan of the Fans","So You’re a Celebrity Who Wants to Buy a House","Chasing Fame the K-Pop Way","Up Close and Personal","The Rise of the Anti-Mask Influencer","White People Keep Posing As People of Color for Clout","Why This Teen Walked Away From Millions of TikTok Followers","Steakhouse Hash Recipe","‘We Can’t Do Anything’: Philippine Capital Locks Down During Holy Week","Two Kids Were Playing on a City Street in Myanmar. One Was Shot Dead.","How China Is Trying to Convince 1 Billion People to Get Vaccinated for COVID","21 Brasilian photographers to have on your radar","The Dick Ship Jammed in the Suez Canal Has Been Partially Freed","Meet Australian designer behind the ‘warped vest’ we all want"]}]