[{"source":"abc-news","titles":["Acclaimed Egyptian feminist Nawal Saadawi dies at age 89","Biden calls Turkey's exit from treaty for women unwarranted","2 hikers die in apparent 100-foot fall from icy cliff, officials say","Biden admin follows Trump's footsteps on ICE-run fake university case","A year into pandemic, veterans halls 'barely hanging' on","Palestinians expand vaccination campaign after UN shipment","A rapid COVID-19 vaccine rollout backfired in some US states","Republic of Congo polls open; candidate sick with COVID-19","Defense Secretary Austin visits Afghanistan as troop withdrawal deadline looms","DHS head to migrants: 'The message is quite clear, do not come'","Insider Q&A: Occidental wants to be Tesla of carbon capture","Dying of loneliness: What COVID-19 has taught us about the opioid epidemic","Infections continue to climb in Turkey amid relaxed measures","Pope decries lack of access to drinking water for many","Whiskey makers face worsening hangover from trade dispute","Pope decries shame of racism, like 'virus' lurking in wait","Married 66 years, husband, wife die minutes apart of virus","Supply bottlenecks leave ships stranded, businesses stymied"]},{"source":"al-jazeera-english","titles":["Iran’s Khamenei reiterates nuclear deal stance in new year speech","Turkey’s new central bank boss to hold talks with bankers: Report","Saudi oil giant Aramco’s profits plunge nearly 45% amid pandemic","Can India solve the world’s COVID-19 vaccine shortage?","US defence chief Austin makes unannounced Afghanistan visit","Is there a link between the AstraZeneca vaccine and blood clots?","Several killed in gov’t attack on hospital in Syria’s Idlib","Houthis admit their forces caused fire at Yemen migrant centre","The revolutionary and the shoulders upon which she stands","Canada’s Tories reject proposal to add climate change to policy","Saudi coalition launches air raids on Yemen’s Houthi-held capital","The history of the duster and my trailblazing grandmother","Myanmar doctors kick off day of protests with dawn march","Long-dormant volcano that came to life in Iceland","Record rains, flooding prompt evacuations in Australia","Pro-Kurdish MP holed up in Turkey’s parliament for days detained","Icelandic volcano subsiding after first eruption in 900 years","Anti-lockdown protests break out in Europe amid new COVID wave","Polls open in Congo as main opposition party boycotts election","Foreign interference in the Palestinian elections"]},{"source":"associated-press","titles":["Blake Griffin expected to make debut with Nets vs. Wizards","House passes bill to expand Alaska tribal law enforcement","Biden administration tries to get control of border, story","Infant son of Browns WR Ryan Switzer back in hospital","Iran threatens US Army base and top general...","THE WAR WITHOUT END: Defense chief arrives in Kabul on 1st trip to Afghanistan...","Infections continue to climb in Turkey amid relaxed measures...","UPDATE: MIAMI DECLARES EMERGENCY...","LEBRON 'OUT INDEFINITELY'","A rapid COVID-19 vaccine rollout backfired in some US states - Associated Press","Some states to seek gun waiting periods after shootings","Budget debate begins this week in South Carolina House","A year into pandemic, veterans halls 'barely hanging' on","North Korean man extradited to US in sanctions case","AP sources: Iran threatens US Army base and top general","Palestinians expand vaccination campaign after UN shipment","Mars findings cataloged in Navajo language","A rapid COVID-19 vaccine rollout backfired in some US states","Gen Con delays annual gaming convention in Indianapolis"]},{"source":"axios","titles":["U.S. and China discussed climate change, did not form working group","New proposal would declare Juneteeth as a national emancipation holiday in the U.S.","One of the most complex tax seasons ever","\"One-in-100-year event\": Thousands told to evacuate as Australia hit by record rains, flooding","Trump-backed Julia Letlow wins House race in Louisiana to replace her husband","In photos: Protesters rally against anti-Asian hate after spa killings","The city of Miami Beach declares curfew over spring break crowds","Customs and Border Protection has more than 5,000 unaccompanied children in custody","Why attacks against the AAPI community are difficult to prosecute as hate crimes","Sports' unequal playing field","Fauci says U.K. variant may account for up to 30% of U.S. coronavirus infections","Axios Today podcast: The Iroquois Nationals' fight to the Olympics","Scoop: ICE securing hotel rooms to hold growing number of migrant families","How stalling growth hurts the planet","Here are the elections taking place this year","Axios-Ipsos poll: A year after calls for racial justice, politics divides sports fans even more","Trump's Mar-a-Lago partly closed amid coronavirus outbreak","Biden addresses anti-Asian violence: \"Our silence is our complicity\"","Exclusive: Pro-Biden group won’t disclose donors","GoFundMe for Atlanta victim's son tops $1.5 million in less than a day - Axios"]},{"source":"breitbart-news","titles":["EXCLUSIVE: Biden Begins Immediate Catch-and-Release of Migrant Families Without Issuing Court Dates","DHS Chief Mayorkas: Domestic Extremism 'Greatest' Terror Threat U.S. Faces","Durbin: ‘I’m Close’ to Getting Senate Votes Needed to Advance DREAM Act","Arizona House Passes Election Integrity Reform Bill to Prohibit Private Funding of Election Administration","Poll: Social Justice Activism in Sports Leads to Deep Racial Divide Among Fans","WashPost Says Biden’s Great Migration Threatens Democratic Power","Stabbing Incident in Detroit Leaves 8 Wounded, Hospitalized","Warnock: 'Distortion in Values' That You Buy a Gun, Kill on Same Day But Not Register, Vote on Same Day","12 People Shot Friday Through Sunday Morning in Mayor Lori Lightfoot's Chicago","ABC’s Raddatz on Border Crisis: Biden Admin ‘Restricting Access Despite Promising Transparency’","WATCH: LeBron James Collapses in Pain After Ankle Injury, Out Indefinitely","Biden Admin Draws Criticism After Opening Yet Another Migrant Children's Shelter in Texas","Netanyahu Pledges Direct Israel-Mecca Flights if He Wins Election","FNC’s Pirro: Biden Administration ‘Knowingly, Intentionally and with Due Deliberation Surrendered Our Southern Border’","DHS Chief Mayorkas: Border Crisis Underway Because Trump ‘Dismantled’ Entire Immigration System","Report: 15,000+ Migrant Children Now Held in U.S. Custody amid Border Surge","Turkish Minister Accuses Greece of Handcuffing Migrants and Throwing Them into the Sea","Mark Meadows: Border Crisis Is ‘Biden’s Hurricane Katrina Moment’","Biden Administration Cites Antisemitic Durban Conference as Positive Precedent","Refugees Applying Via Legal Routes to Be Given Automatic Settlement in UK"]},{"source":"cbs-news","titles":["Corporate profits running into a wall","6/3: Despite White House apology, lawmakers fume over Taliban swap; WWII veteran remembers secret D-Day debacle","For some in Syria, election marked by bombs, not ballot boxes","Violent weather targets nation's midsection","May be \"nearly impossible\" to monitor released Taliban detainees: Morell","Fellow soldier: Bergdahl walked away from \"bond of brotherhood\"","Despite White House apology, lawmakers fume over Taliban swap","Tiananmen Square survivor won’t let China forget","Alleged \"Slenderman\" stabbing shows downside of going viral","WWII veteran remembers secret D-Day debacle","Chef Eli Kulp: “The time is right now”","Chef Eli Kulp’s most popular dishes","Chef Eli Kulp on the Philadelphia dining scene","Tiananmen Square protest leader discusses the uprising 25 years later","Bowe Bergdahl swap sets \"very dangerous precedent,\" says GOP senator","Mitch McConnell: Campaign finance amendment just a “political exercise”","Harry Reid: My 1998 campaign spending made me feel “unclean”","Hillary Clinton: Don’t second-guess Bergdahl swap","Delaware bridge abruptly shut down following inspection","Best family cars: Top style and safety picks"]},{"source":"cnn","titles":["Nawal El Saadawi, famous Egyptian feminist author, dies age 89","Sevilla goalkeeper Bono makes himself the unlikely hero with remarkable last-minute equalizer","Secretario de Seguridad Nacional dice que la frontera está cerrada y no dio una fecha sobre cuándo habrá nuevas instalaciones para menores no acompañados","Railroad megamerger would create the first Mexico-US-Canada freight rail network","Arkansas governor says he signed near-total abortion ban so Supreme Court can decide if it's a 'direct challenge' to Roe","طائرة ترامب بوينغ 757 المطلية بالذهب.. من رمز الهيبة المطلقة إلى مطار شبه مهجور","Cuomo hasn't resigned because he still has support from Democratic voters","بعد تصريحات هاري وميغان.. مصدر ملكي: العائلة الملكية قد تبحث تعيين مسؤول للتنوع","Warnock slams GOP-controlled Georgia Legislature for bill that would restrict voter access","To help Venezuelans, Biden can go beyond granting temporary immigration status","Stelter: You are what you watch ... and it could make you sick","8 people stabbed in fight that began at Detroit hookah lounge","Royals say they may consider appointing diversity chief","She lost her husband to cancer. Now, her obituary for her 'dead sexy' spouse has gone viral","Ignoring CDC warnings, more than 1 million passengers have flown from US airports for 10 straight days","رغد صدام حسين في ذكرى غزو العراق: يوم مؤلم ومرير.. وبلدنا راجع وبقوة","The most effective way to fight back against anti-Asian hate","Profit tumbled at Saudi Aramco, the world's biggest oil company","نتنياهو يعد حجاج إسرائيل المسلمين برحلات مباشرة إلى مكة.. هل اقترب التطبيع مع السعودية؟"]},{"source":"fox-news","titles":["Gasparyan retires in final, Kasatkina wins in St. Petersburg","After Georgia shooting, Warnock pushes for gun control, voting reform","Nine double-digit seeds in Round of 32 at NCAAs","Operation Warp Speed Doc: 90% of Biden vaccine rollout plan was same as Trump's","Trump returning to social media with 'his own platform' in 2-3 months: adviser","Blake Griffin expected to make debut with Nets vs. Wizards","Border county sheriff says Sinaloa cartel bringing 'very violent situation' after 'hasty' Biden orders","Charles Barkley defends Ohio State's E.J. Liddell amid disturbing messages: 'Never gonna dignify these losers'","Justin Bieber faces backlash for including Martin Luther King Jr. quotes on his album 'Justice'","Coronavirus doesn't care that it's the NCAA Tournament","Texas upset again as Smart fails to recapture March glory","Yanks star Stanton off to strong start after smashing finish","Sen. Cotton suggests 3 measures Biden can take to fix border crisis","Mayorkas blames migrant surge on Trump admin, not Biden policies","Camille Kostek shares 'boat day' snaps with boyfriend Rob Gronkowski in Miami","Arthur Herman: Message to DeSantis – civics important but here's what we really need to teach our kids","Photojournalist: Biden giving media 'zero access' to border operations","'The Talk' extends hiatus a second time amid Sharon Osbourne, Piers Morgan controversy","Matthew McConaughey says Texas governor run is an ‘honorable thing’ he’s ‘giving consideration’","Todd Nettleton: After a year of COVID uncertainty, here's certainty -- God's kingdom will advance"]},{"source":"google-news","titles":["384: Каждому по Поночке","NY anuncia 1º paciente infectado pela variante brasileira do coronavírus","Final ARIA OVA Episode Set to Premiere in Japan This Winter","Nft: come funziona il certificato digitale del momento","These $11 Baking Mats Have More than 29,000 Five-Star Reviews on Amazon","FEATURE: Rimuru's Most Powerful Skill is Friendship","Japanese Fans Rank the Anime Which Final Episode Made Them Cry","Rock Hill teen charged in Jan. 6 Capitol riot no longer part of Republicans at Citadel","Coronavirus in India Lockdown 2021 Live Updates: 3775 new COVID-19 cases in Mumbai; Gujarat bans Holi celebrations - The Financial Express","《笑史！了不起的古希臘》：奧德修斯遇上妖豔小姊姊，幸好有荷米斯送上溫馨提示","《進階肌力訓練解剖聖經2》：多數人認為提起重量時較危險，其實離心收縮期最容易受傷","《大人的詩塾》：一代人有一代人的名字，不過還是有明顯男女差異","《謝謝我自己，不完美也很美》：父母對孩子最大的「負責」，就是成為快樂的自己","《大人的詩塾》：「喜翻」才不是錯字，這是詩聖杜甫說的喔","MU grad foiled by Facebook friends and turquoise cap in Capitol insurrection case","I’m a Cleaning Expert and These Are the 8 Supplies I’m Using More Now than Ever Before","Yatogame-chan Kansatsu Nikki 3 - Episode 11 - I Ain't Gonna Last","Edmonton Oilers 4 Winnipeg Jets 2 The Day After: Oilers play rookie mode in third period comeback - Oilers Nation","Every Canceled DCEU Movie Set Up In Zack Snyder's Justice League - Screen Rant","Before & After: “Fixer Upper” Turned This Abandoned Kitchen into a Scandinavian-Meets-Mid-Century Dream"]},{"source":"msnbc","titles":["These Maryland cops responded to mental health emergency exactly the right way","Homeland Security Sec. Mayorkas to migrants: ‘The message is clear. Do not come.’","The GOP's white nationalist future is taking root in America's colleges","Tennessee ramps up COVID-19 vaccinations","After testifying before the Senate, 16-year-old Stella Keating speaks about equal rights for trans teens","Losing loved ones to “the culture war”","Atlanta spa shootings shine light on long history of discrimination against Asian women in the U.S.","Jeannie Mai, Margaret Cho, Manjusha Kulkarni on racism Asian Americans face from young ages","Families remain stuck in limbo after Biden rescinded ‘Muslim ban’ policy","Meet Stella Keating, transgender teen leader who made history on Capitol Hill","Debate: Voting rights advocate vs. advocate of GOP voter ID laws on suppression issue","Rep. Judy Chu: GA shooter “chose three Asian spas…It was very clear this is a hate crime.”","Olympic Legend Kristi Yamaguchi on anti-Asian vitriol: “what makes America so great is the diversity”","Velshi: The Sound of Silence","Kendis Gibson and Lindsey Reiser talk to Oregon Women's Basketball forward Sedona Prince on MSNBC","Andrew Cuomo is the perfect example of why 'good guys' are so dangerous","Why is Fox News so obsessed with Vladimir Putin?","GA State Rep.: ‘It’s important to humanize how these Asian women lived’","Cohen assesses prosecutors have enough to charge Trump with or without Weisselberg","Dr. Fauci: ‘Don’t declare victory prematurely’"]},{"source":"national-review","titles":["Arkansas Gov.: Trump Supporters’ Vaccine Hesitancy Stems from ‘Natural Resistance to Government’","Homeland Security Sec. Says ‘Border Is Closed’ but U.S. Won’t Expel ‘Vulnerable Children’","Louisiana Republican Julia Letlow Wins House Seat Husband Won before COVID Death","No, We Don’t Need a Department of Education","Leftist Mob Targets Law Professor — Guess What the Dean Does","Brown Professor Gets Hounded Off Twitter for Article Saying It’s Okay to Take Your Kids on Vacation","The Real Reasons the U.S. Can’t Win Wars Anymore","Bureaucracy Has Conquered Schools. Joe Biden Won’t Fix It","We Need a Department of Education","This World Down Syndrome Day, Remember the Value of Every Life","Bad Analogies Will Be the Death of Us","In Defense of the Senate","GOP Hawks Warn against Repealing Iraq War Resolution ahead of Vote","ICE Books Hotel Rooms for Six Months to House Migrant Families at Border","CBP Asks to Fly Migrants to Canadian Border for Processing Amid Surge: Report","Current Cuomo Aide Is Eighth Woman to Allege Harassment","Dianne Feinstein’s Overnight Filibuster Flip Flop","Putting the Grift in ESG","Slandering the U.S. Military . . . Again","Good News from the European Museums"]},{"source":"nbc-news","titles":["Virginia police officer shot during attempt to catch an escaped cow","Tennessee man loses $1 million lottery ticket — but finds it again in parking lot","'We all know hate when we see it': Democrats speak out on Atlanta shootings","HBO's QAnon documentary searches for Q's origins but misses the point","MTP Compressed: Migrant surge at southern border challenges Biden administration","'Potentially hazardous asteroid' to come closest to Earth on Sunday","Defense Secretary Austin makes unannounced visit to Afghanistan","How Gal Gadot's cringeworthy 'Imagine' video may have changed celebrity culture","Blunt to Johnson's comments on Jan. 6: 'Don't need to come up with alternative versions'","It's not Biden's Senate anymore","Full Panel: Surge of migrant families at the border creates political crisis","Warnock: 'We have to pass voting rights, no matter what'","Full Blunt Interview: 'Democracy is give and take'","Warnock: 'Need reasonable gun reform' following Atlanta shootings","Full Warnock Interview: 'We all know hate when we see it'","Mayorkas: Domestic terrorism is ‘the greatest terrorist-related threat in our homeland’","Full Mayorkas Interview: 'We are rebuilding' immigration process after Trump 'dismantled' system","Why this year's surge of unaccompanied minors is different.","Border surge is more than just a humanitarian crisis","DHS Secretary Mayorkas defends handling of border surge, tells migrants not to come now"]},{"source":"newsweek","titles":["Lauren Boebert Claims a Trending Insult About Her Proves 'the Left Hates Women'","GOP Senator Roy Blunt Warns Republicans Not to 'Explain Away' Capitol Riot","'NCIS New Orleans' Canceled: When the Final Episode Will Air","Kylie Jenner Criticized for Asking Fans to Donate to Her Friend's GoFundMe","Nearly Half of Asian Americans Recently Saw Someone Blame Asian People for Pandemic","Photos Show Capitol Fencing, Razor Wire Being Removed—73 Days After Rioting","Alejandro Mayorkas Defends Rebuilding 'Orderly' Immigration Processes Trump 'Dismantled'","Biden Defense Chief Arrives in Afghanistan as Taliban Stresses Trump Exit Plan","The Best Running Gear of 2021 so Far","Former Governor Scott Walker to Fight 'Cancel Culture' on TV, Radio, in Court","Lindsey Boylan Says Cuomo Focused on Smearing Her Reputation Instead of Fighting Pandemic","Immigration Attorney Confronts Fox's Jeanine Pirro Over 'Facts' on Border Crossings","Democrats Face Runoff in Louisiana Special Elections, Julia Letlow in House","Shark Attacks Australian Man, 75, Leaving Bite Marks in His Paddle Board","'Failing' Donald Trump Is 'Very Unlikely' to Run in 2024, Election Expert Says","25 TV Shows Rebooting in 2021","Are Israelis About To Enter the 'Post-Netanyahu' Era? | Opinion","Miami Beach Spring Breakers Party After Curfew, Police Deploy Pepper Balls","PS5 Restock Updates for Amazon, Walmart, Target, Best Buy and More","Powerball Results, Numbers for 3/20/21: Did Anyone Win the $200 Million?"]},{"source":"new-york-magazine","titles":["The Smearing of Kristen Clarke","Conservative George W. Bush Is Now Too Liberal For His Party","When the Capitol Riot Came Home","Current Aide Accuses Cuomo of Sexual Harassment","Republican Tom Reed, a Potential Cuomo Challenger, Accused of Sexual Misconduct","Trumpy Georgia Congressman May Help Punish Raffensperger","The Flattening of the Atlanta Shootings","Putting Students Behind Plexiglass Isn’t Making Them Any Safer","Lindsey Boylan Says Cuomo Had Dartboard With Photo of de Blasio","The Fake Feminists Fighting the Equality Act","Democrats Advance Citizenship for 3.5 Million Immigrants","Trump’s Lackeys Are Teaming Up Again With Putin to Mock Biden","Is Complaining About ‘Cancel Culture’ the New Ideology of the Republican Party?","The First U.S. Meeting With China Under Biden Didn’t Go So Smoothly","When Domestic-Violence Prevention Collides With the Religion of Guns","Fed to Biden: The Money Printer’s Still Got Plenty of Ink","Becerra Confirmed as HHS Secretary in Closest Vote Yet","Andrew Yang’s Plan to Fight Hate Crimes Makes Asian Activists Cringe","GOP Rep: I Didn’t Intend to Blame Jews for the Space-Laser Conspiracy","These Are the Victims of the Atlanta Spa Shootings"]},{"source":"politico","titles":["'We all know hate when we see it': Dem lawmakers condemn violence against Asian Americans","Blunt: 9/11-style Capitol riot commission may delay fixes","POLITICO Playbook: Sunday best: Bidenworld schadenfreude, and on the ground in Brownsville","Cotton: Border is 'wide open'","Pentagon chief makes surprise stop in Afghanistan as generals warn of premature drawdown","Biden DHS chief says 'border is closed' but U.S. won't expel children","Republican AGs take blowtorch to Biden agenda","Rallies in Atlanta, nation against hate after spa shootings","How ‘Owning the Libs’ Became the GOP’s Core Belief","When LBJ and Hubert Humphrey Teamed Up to Break a Talking Filibuster","Driving downtown? Get ready to pay extra","Democrats push Biden to take on Pharma to boost global vaccine supplies","How to mess up a possible Trump endorsement in one easy step","Julia Letlow wins special election to replace her late husband in Congress","‘The Crisis Is In Washington’: Overwhelmed border officials urge D.C. to act","DNC reports best-ever February fundraising for a non-presidential year","Under Biden, A New Kind of Family Separation","Feinstein says Senate should look at reforming the filibuster","Austin hints India’s purchase of Russian missile system could trigger sanctions","We should have seen this coming"]},{"source":"reddit-r-all","titles":["Show HN: R/shouldibuythisproduct because Amazon reviews is broken","GraphWrap: extend your Django REST Framework API with a GraphQL interface with just two of lines of code. : django","My recommendation to learn Django : django","Piracy, Overcoming Gravity, and the Digital Edition","Has Y Combinator lost its way when the latest company is a Mac only widget?","My bank sent me 64 copies of the same debit card","Join David Borenstein for a reddit AMA at 2:30 p.m. ET to discuss his film on the price of being a social media star in China","YouTube doesn't handle space anymore","Florida is suffering from an epidemic of bald men renting billboards that need to be extended in order to fit their bald heads.","Django admin looks dated and is not mobile friendly, any better options ? : django","Reddit: Online Presence Indicators","Namecheap just snaked another domain off me","Any open source DRF projects? : django","I want this guy working on the unit tests : ProgrammerHumor","Protest note about user privacy changes by Reddit","What virtual environment system do you use for your Django projects and why? (venv, pipenv, pyenv, etc ) : django","In the 90s part of Germany's air traffic control software ran on Emacs"]},{"source":"reuters","titles":["UK reports 33 new COVID-19 deaths, lowest daily number since October - Reuters","Cuba to vaccinate 150,000 frontline workers as part of final phase of clinical trial - Reuters","Russian jets hit northwestern Syria near Turkish border -witnesses, Syrian rebels - Reuters","Khamenei says U.S. promises have no credibility for Iran","Suez proposes Veolia to negotiate on basis of a Ardian-GIP offer - Reuters","South Africa concludes sale of AstraZeneca COVID-19 vaccines, health ministry says - Reuters","FACTBOX-Highlights of CP's $25 bln planned purchase of Kansas City in world's top rail merger","Iran's Khamenei says U.S. promises have no credibility for Tehran","Golf: Harding wins Kenya Open to claim second European Tour title","Islamic State claims responsibility for killing 33 Malian soldiers - Reuters","U.S. Defense Secretary meets Afghan president in Kabul: presidential palace statement - Reuters","Israeli court upholds school's barring of COVID refusenik teacher","Minister in Sanaa administration in Yemen dies of COVID-19, officials say - Reuters","UPDATE 2-Saudi Aramco to prioritise energy supply to China for 50 yrs, says CEO","Venezuela gas pipeline tract explodes; oil minister blames attack - Reuters","In a time of pandemic, love is in the air on Canada-U.S. border","Rashford, soccer's champion of children, kicks down Downing Street door in new mural - Reuters","In a time of pandemic, love is in the air on Canada-U.S. border - Reuters","Saudi Aramco to prioritise energy supply to China for 50 years, says CEO - Reuters"]},{"source":"the-american-conservative","titles":["The Ford Foundation is Funding CCP Propaganda","The Human Distinction","Peter Strzok’s ‘False Memory’ About the Origins of Crossfire Hurricane","H.R. 1 and Herd Count Democracy","Is Transgenderism Just a Celebrity Fad?","In Memoriam: Richard Driehaus","Romney Says America’s Leadership is Too Old to Take on China","To Flee or Not To Flee","Two Centuries of ‘That Blackguard Burton’","Twilight of the European Nationalists?","The Uses and Abuses of ‘Woke Capital’","Get Him Outta Here","The Other Deficit","The Right Can Win in States","Washington’s Anti-Russia Fixation","What Does the Future Hold for the GOP?","Something is Rotten in the Georgia Secretary of State’s Office","This is Gen Z’s Moment","No, America Still Shouldn’t Intervene on Behalf of the Syrian Rebels","A Hollow Victory for American Workers"]},{"source":"the-hill","titles":["WATCH: Scenes from spring break in South Florida","Republican Mesa mayor: 'I've been impressed so far with this administration'","Johnson, Grassley indecision freezes key Senate races","GOP senator: GOP can't 'explain away' Capitol attack","Miami Beach official recommending curfew, causeway closures through end of spring break","Former Operation Warp Speed head takes credit for '90 percent' of vaccine rollout so far","Sunday shows - Biden administration grapples with border surge","The two women who could 'cancel' Trump","Warnock says 'reasonable gun reform' a necessary response to Atlanta shootings","DHS chief calls domestic extremism 'greatest' terror threat US faces","Duckworth: Atlanta shootings look 'racially motivated'","Chu on Atlanta shootings: 'This is an anti-Asian hate crime'","GOP governor: Vaccine hesitancy among Trump voters is 'natural resistance to government'","GOP representative predicts 1 million migrants at the border by summertime","Cotton: Democrats' infrastructure bill will be focused on higher taxes, 'Green New Deal'","Rep. Michelle Steele says she's been called 'Chairman Mao'","DHS secretary clashes with Fox host over press access","Republicans set to rebound big in 2022 midterms, unless...","DHS secretary says border is closed: 'The message is quite clear, do not come'","Texas Roadhouse CEO dies amid 'unbearable' COVID-19-related symptoms, family says"]},{"source":"the-huffington-post","titles":[]},{"source":"the-washington-post","titles":["It’s been a busy winter at the National Hurricane Center after last year’s wild season","Biden shows what ‘fighting for the soul of our nation’ looks like","Pentagon chief in Afghanistan on unannounced visit as deadline to withdraw U.S. troops looms - Washington Post","My husband, other health-care workers have been praised for their struggles with the pandemic. Families should be recognized, too. - Washington Post","Will Biden launch a global democratic wave?","Distinguished pols of the week: Talking tough to China","D.C.-area forecast: Springtime splendor sticks around into midweek","Third dose of Sinopharm vaccine needed for some in UAE after low immune response, says distributor","Israel will hold national elections on Tuesday. Here’s a guide for the totally unfamiliar.","Carolyn Hax: How to approach a friend who uses racial slurs","What we know about the victims of the Atlanta shootings - The Washington Post","Global vaccine supply shortages challenge drug company monopoly practices","Senators call for more press access to facilities holding migrant children at the border","Oregon-VCU NCAA tournament game canceled because of covid protocols - The Washington Post","After enduring racism in silence, Atlanta-area Asian Americans speak up - Washington Post","Atlanta spa shooting victims highlight struggles for Asian and Asian American immigrant women in low-wage jobs - Washington Post","Pakistan's prime minister contracts covid-19 two days after his first vaccine dose","‘No end in sight’: Inside the Biden administration’s failure to contain the border surge","PM Update: Chilly overnight, but more fantastic weather on Sunday","In this Nigerian city, Pfizer phobia looms over the vaccine rollout"]},{"source":"the-washington-times","titles":["New York Times: Current aide accuses Cuomo of sex harassment","Ousted NEW YORK TIMES reporter slams newsroom's culture: 'Mean, spiteful, vengeful place'...","‘Three Warfares’: U.S. pummeled by covert disinformation war waged by Russia, China","About to learn his definition of 'fair share'...","Terror suspects part of border surge...","For Biden, there's no place like a weekend home in Delaware","Pentagon goes to war with FOXNEWS over 'feminizing' military...","NEXT: Gun Control?","Obama, Bush, Clinton, Carter push COVID-19 vaccination","Jay Bhattacharya, Stanford doctor: Lockdowns 'single worst public health mistake' in last 100 years","Justice Amy Coney Barrett riles conservatives with moderate rulings...","Illegal immigrants shouldn't be included in congressional count","'It is not right': Bill offers hope that flyers of CIA's Air America will finally win recognition","'Extraordinary crisis': Democrats' revolutionary climate change bill aims to remake U.S. economy","$1,400 stimulus checks could be intercepted, consumer advocates warn","DARPA, CIA-contracted fund partner to stop China from gobbling up America's intellectual property","U.S. plans to deploy long-range missiles in Asia to deter 'our greatest strategic threat'","Portland federal officers forgotten as Pelosi eyes Congressional Gold Medal for Capitol Police","It's time to question Biden's mental health","'Almost useless' COVID-19 tests on migrants dropped in Texas town find 25% infected"]},{"source":"time","titles":["U.S. Defense Chief Arrives in Kabul on First Trip to Afghanistan","Miami Imposes Emergency Curfew After Spring Break Crowds and Fights","Why MicroStrategy CEO Michael Saylor Bet Company Cash on Bitcoin—and Wants Other Corporations to Join In","Be Bold, Be Proud, Speak Up: Raising Asian American Daughters Now","What an Expert on Evangelicals and Sex Says About the Atlanta Shooter’s Claim He Had a Sex Addiction","Prosecutor: Man Charged With 1 Murder Says He Killed 16 People","Half of U.K. Adults Have Received At Least One Dose of COVID-19 Vaccine","Strong Earthquake Shakes Japan Triggering a Tsunami Advisory","Asian American Religious Leaders Reflect on the Atlanta Shootings","‘You Don’t Have to Be Rich to Do the Right Thing.’ Colombia’s President Ivan Duque on Welcoming Venezuelan Refugees","A Single Mom. A Newlywed. A Veteran. These Are the Victims of the Atlanta Shootings","How Foster Families Are Stepping Up to House Unaccompanied Children Arriving at the U.S.-Mexico Border","Genius: Aretha Is a Lavish, Lively Showstopper That Hits a Few False Notes","If You’re Surprised by the Anti-Asian Violence in Atlanta, You Haven’t Been Listening. It’s Time to Hear Our Voices","‘This Is A Human Issue.’ Daniel Dae Kim on Coming Together to Combat Bigotry","NCAA Accused of ‘Disrespectful’ Treatment Towards Women’s March Madness Teams in Viral TikTok","For Asians Living the Shadow of the Atlanta Killings, Anger and ‘Just This Constant Fear’","Mads Mikkelson Can Do Anything. But He’s Stuck in the Boring Oscar-Nominated Another Round","‘It Is Dangerous To Speak Up In India Today.’ What the Resignations of 2 Academics Show About Freedom of Expression Under Modi","Israel’s COVID-19 Vaccination Rollout Is Slowing at a Critical Moment. That’s a Warning for the Rest of Us"]},{"source":"usa-today","titles":["Kevin Holland defiant toward post-loss criticism: 'Never going to stop talking'","Glock pistol disguised as toy Nerf gun seized in North Carolina drug raid","Turns out Abilene Christian coach Joe Golding is a pretty decent dancer","Free agent moves, Russell Wilson rumors and other Seahawks news","Magic vs. Celtics: Prediction, point spread, odds, over/under, betting picks (3/21)","Mavericks at Trail Blazers: Lineups, injury reports and broadcast info for Sunday","(1) Baylor vs. (9) Wisconsin live stream, NCAA March Madness, TV channel, how to watch","Bulls at Pistons: Lineups, injury reports and broadcast info for Sunday","UFC on ESPN 21 post-event facts: Derek Brunson climbs all-time wins list","Texas Tech at Arkansas Odds, Picks and Prediction - The Providence Journal","Nicki Minaj's mother files $150M lawsuit in father's hit-and-run death","Raptors at Cavaliers: Lineups, injury reports and broadcast info for Sunday","(1) Illinois vs. (8) Loyola Chicago live stream, NCAA March Madness, TV channel, how to watch","Rodney Hudson trade gives Cardinals one of the NFL’s elite O-lines","LaMarcus Joyner’s Jets contract comes with $3M cap hit","Lakers at Suns: Lineups, injury report and broadcast info for Sunday","Death, critical illness in Denmark draw more scrutiny for AstraZeneca vaccine: COVID-19 live updates","Callout Collection: Who UFC on ESPN 21 winners want next – and how likely they'll get them","The Jets’ 2016 draft class is all gone after Jordan Jenkins’ departure","Full 2021 NFL draft order"]},{"source":"vice-news","titles":["Daily Horoscope: March 21, 2021","Donations to Asian Sex Worker Groups Skyrocket in Wake of Atlanta Shootings","NFTs Won't Save Small, Independent Musicians—But the Blockchain Could","'Star Dynasties' Is the 'Crusader Kings' in Space That We’ve Always Wanted","A Brief History of Wendy Williams Burping and Farting on TV","Daily Horoscope: March 20, 2021","Even Where Weed Is Legal, Cops Still Mostly Arrest Black and Brown People","The Solution to Violence Against Women Will Never Be 'More Police'","Texas Man Arrested for Weed Died After Officers Pepper-Sprayed Him and Put Him in a Spit Hood","Atlanta Shooting Suspect’s Church Bashed ‘Radical Feminism’ in Deleted Sermons","Please Stop Using Dating Shows to Embarrass Black Women","A Woman Set Up a GoFundMe to Help Harry and Meghan Pay for Their $14M House","Oklou just remixed Bladee and Mechatok’s Rainbow","Free money and Loewe eco-chic: What’s in fashion?","Police Spies Told a Minister Where Left-Wing Trade Unionists Go on Holiday","Working at Goldman Sachs Suuuucks, Leaked Internal Survey Shows","The Alleged Atlanta Shooter’s Church Is Kicking Him Out","How the 'Loop Hero' Devs Pitched a Hit Game That's Impossible to Describe","Anti-Asian Twitter Hashtags Spiked After Trump Called COVID the ‘Chinese Virus’","Gay art documentaries and Kim Kardashian: what i-D loved this week"]}]