[{"source":"abc-news","date":1615913389868,"titles":["Gas explosion collapses coal mine in Pakistan, 7 killed","Kosovo war crimes suspect arrested by authorities in Belgium","Man allegedly gunned down 4 people after argument over stimulus check: Officials","Winfrey chooses four Marilynne Robinson novels for book club","In one week, Duke COVID cases approach fall semester total","Ethiopia rejects outside mediation in Nile River dam dispute","California Gov. Gavin Newsom says he's 'worried' about recall effort","New search warrant served in Kristin Smart's 1996 disappearance","NatWest unit faces criminal charge in money laundering case","Interim Libya government assumes power after smooth handover","Russia threatens to block Twitter in a month","Somalia starts first inoculations with AstraZeneca vaccines","Spike Lee to head Cannes Film Festival jury","Northern Indiana girl died from asphyxiation: prosecutors","Griddy files for Chapter 11 bankruptcy after Texas storm","Dutch PM's poll lead shrinks as election enters second day","Founder of Baltimore art collection backed Confederate cause"]},{"source":"al-jazeera-english","date":1615913389871,"titles":["How youth, women could decide Ecuador’s next president","No Signal? Encrypted messaging app Signal blocked in China","Canada recommends AstraZeneca-Oxford vaccine for seniors","Why are COVID cases rising in Europe despite vaccination efforts?","UN warns of another ‘decade of desperation’ in war-torn Syria","Nigeria: Inflation hits four-year peak as food prices soar","EU regulator ‘convinced’ AstraZeneca benefit outweighs risk","The great pivot: US women small business owners during COVID","Mozambique fighters beheading children as young as 11: NGO","Sarah Everard killing: UK police officer faces trial in October","Russia identifies two cases of South African COVID variant","The ‘red prawn war’: How trauma gripped a Sicilian fishing town","AstraZeneca suspensions: What you should know, in 500 words","Lebanon needs an aid paradigm shift","US Marine once jailed in Iran faces suspicion of treason","Qatar to join Afghan peace talks in Moscow: Official","Iran starts human trials of its third domestic COVID vaccine","Houthi fire caused Yemen blaze that killed migrants in Sanaa: HRW","Seven killed in southwest Pakistan coal mining disaster","Protesters storm presidential palace in Yemen’s Aden: Reports"]},{"source":"associated-press","date":1615913389857,"titles":["Russia Threatens to Block TWITTER as Content Dispute Escalates...","Iran starts trial of new homegrown vax...","Gonzaga, Baylor dominate AP All-America teams","Pennsylvania Capitol building reopening to the public","Neil Clark, lobbyist named in $60M Ohio bribery probe, dies","I like Ike, but Mike's OK; ranked-choice voting gets a look","Denver Broncos exercise Von Miller's 2021 option","Pay raise proposed for Louisiana's prison guards next year","NatWest unit faces criminal charge in money laundering case","EU 'CONVINCED' VAX BENEFIT OUTWEIGHS RISK","Olympic baseball qualifying moved from Arizona to Florida","Russia threatens to block Twitter in a month","UN atomic watchdog: Return to Iran nuclear deal possible","Northern Indiana girl died from asphyxiation: prosecutors","Spike Lee to head Cannes Film Festival jury","Founder of Baltimore art collection backed Confederate cause","Lawmakers fear turning 144 cities into \"micropolitan\" areas","Voter outreach led to big drop in rejected mail ballots","Pritzker Architecture Prize awarded to Paris-based duo","Look out, Labs: French bulldogs now 2nd most popular US dog - Associated Press"]},{"source":"axios","date":1615913389999,"titles":["\"Scorched-earth Senate\": McConnell warns of GOP retribution if Democrats eliminate filibuster","Venture capital is still a boys' club","EU regulator: Currently \"no indication\" AstraZeneca vaccine causes blood clots","DHS chief: U.S. pacing for more border encounters than in the last 20 years","Facebook explores paid deals for new publishing platform","The Nasdaq is bouncing back as stimulus checks hit bank accounts, GDP expectations grow","Charlie Crist \"strongly considering\" another run for Florida governor","John Deere wants to streamline its factories by using 5G","China's on a mission to dominate space internet","The good and bad news about COVID treatments","Democratic machine spending millions in full-scale campaign to sell Biden's COVID relief","Fears rise as kids spend even more time on digital media","The end of U.S.-Russia collaboration in space","North Korea's Kim Yo-jong warns U.S. against \"causing a stink\"","Catholic order commits to making $100 million in U.S. slavery reparations","“Immunity doesn't last forever:” Covid-19 boosters set to become routine","Biden opposes reopening Homestead, a controversial child migrant shelter","Democrats see China as a test for Republicans cooperation","White House rolls back COVID-19 testing for staffers","Here's whats happening with the AstraZeneca vaccine in Europe and the U.S."]},{"source":"breitbart-news","date":1615913389865,"titles":["Nolte: Media Fail — Only 35% of New Yorkers Want Cuomo to Resign","Iraq: Parliament Brawl Erupts After Iran-Linked Lawmaker Insult Kurds","North Korea: Kim Jong-un’s Sister Warns Biden Not to ‘Cause a Stink’","Joe Biden’s DHS Chief Says He Is Opening New Doors for Migrants","Delingpole: Priti Awful – Britain Takes Another Step Closer to Police State Tyranny","Tom Cotton Slams U.S. Chamber of Commerce — ‘A Front Service for Woke Corporations’","Tom Cotton Slams U.S. Chamber of Commerce -- 'A Front Service for Woke Corporations'","Portuguese Supreme Court Declares Euthanasia Law 'Unconstitutional'","Poll: Americans View China as Greatest Enemy, Doubling 2020 Rate","Nolte: Trevor Noah-Hosted Grammy Awards Ratings Worst Ever By a Mile","Peter Thiel Pours $10 Million into Super PAC Backing Likely J.D. Vance Senate Bid in Ohio","Nigeria Closes 618 Schools Across North, Fearing Abductions","Retail Sales Plunge Amid February Freeze","Iraq to Compensate Citizens Suffering from Coronavirus Vaccine Side Effects","WH Press Sec: Joe Biden Looks Forward to Repeal of Gun Maker ‘Liability Shields’","Alexander Vindman Proposes Suing Conservative Media to ‘Deradicalize’ It","Sweden Joins Germany, France, Others in Pausing Use of Oxford-AstraZeneca Vaccine","Gavin Newsom Blames QAnon, ‘Anti-vaxxers,’ ‘Anti-Immigrant Trump Supporters’ for Recall","Iron Duke: Queen’s Husband Prince Philip Walks Out of Hospital After Heart Procedure","From ‘Magnum P.I.’ to ‘Chicago PD.,’ Network Dramas Continue to Push BLM, Anti-Cop Messages"]},{"source":"cbs-news","date":1615913389866,"titles":["Moderna begins testing COVID-19 vaccine in young children","Syrian engineer invents an internet-free communication app","10th Oath Keeper added to Capitol riot conspiracy indictment","Moderna testing COVID-19 vaccine on young children","On the ground as migrants travel from southern border to CBP processing centers","Prince Philip leaves hospital following heart surgery","Prince Harry is speaking to Charles and William after Oprah interview","3/16: CBSN AM","Supermassive black hole found wandering through space","Mental health apps may not protect your data","19-year-old hockey player dies after being hit by puck","Cuomo accuser reveals new details about governor's alleged behavior","Biden and Harris' \"Help is Here\" tour focuses on small businesses","Chase, Wells Fargo face customer anger over stimulus checks","Twitter suspended over 150,000 QAnon-related accounts","Syrian immigrants reflect on impact of 10 years of civil war","3D-printed homes could lead to a revolution in real estate","Gayle King: Prince Harry glad to have started a conversation with his father and brother","How Facebook plans to fight COVID-19 disinformation"]},{"source":"cnn","date":1615913390010,"titles":["'Operation Varsity Blues' offers a flawed take on the college admissions scandal","أردوغان: السعودية قدمت نا طلبا بشان الطائرات المسيرة.. والشعب المصري لا يعارضنا","Wall Street's biggest fear isn't Covid. It's inflation","Democrats pitch significant increase to international affairs budget","Lakeith Stanfield and Daniel Kaluuya both being nominated for supporting actor Oscar is confusing","Covid triggered another crisis: rebuilding our fragile health system","Virginia Gov. Northam will restore voting rights to 69,000 former felons with new policy","La historia más profunda detrás de las cifras sobre la situación en la frontera de México-Estados Unidos","شاهد كيف أنقذت صلصة حارة مزرعة دمرتها عاصفة","Trump doesn't commit to stay out of Senate primaries despite prodding by top GOP senator","This chain wants to take on Lululemon with a new men's line","The surreal photos that show how Covid has changed travel","آيرينا: العالم يحتاج 131 ترليون دولار لتحقيق أهداف المناخ بحلول عام 2050","The Senate's 2nd most powerful Democrat just savaged the filibuster","شاهد طائرة صغيرة تنفجر بعد اصطدامها بسيارة فيها أم وطفلها","فيديو مروع للحظة اصطدام طائرة صغيرة بسيارة فيها أم وطفلها","واردات الشرق الأوسط من الأسلحة الأكثر نمواً في السنوات الـ5 الماضية","Scientists want to build a doomsday vault on the moon","'The Talk' is on hiatus after Sharon Osbourne and Sheryl Underwood's heated debate","How this hot sauce may save a family farm destroyed from storm"]},{"source":"fox-news","date":1615913389710,"titles":["Sen. James Lankford On Hypocrisy Of Democrats Who Went From Saying President Trump Put Kids In Cages To Calling Those Same Facilities Humane Detention Holding Spaces","Ken Cuccinelli On How The Biden Administration Destroyed Agreements With The Northern Triangle Countries","Tammy Bruce: Joy Behar 'pulls the curtain back' on Dems' Cuomo double standard","Natasha Richardson’s son Micheál recalls the pain of losing his mother: It really ‘messes with your mind’","Trey Gowdy calls out media's past 'crush' on Andrew Cuomo: 'It looks really foolish'","Washington Post Runs Embarrassing Correction on Trump Story And He Hits Back","Son of murdered California officer slams liberal DA Gascón's 'disgusting' policies","Pilot shortage predicted following coronavirus pandemic: study","Von Miller back with Broncos after missing entire 2020 season","Marc Elias, ex-Clinton lawyer involved in Steele dossier, sanctioned by Texas court over 2020 election case","Massachusetts detects Brazilian coronavirus variant in Cape Cod woman","Russian hockey player dead at 19 after being struck in the head with puck","Cam Newton appears to applaud Patriots' free-agent spending","Prince Harry has spoken to Prince Charles, Prince William, but ‘conversations were not productive': Gayle King","Roger Mudd showed us how covering Congress has not changed very much","Elliot Page says he's 'fully who I am' in first interview since coming out as transgender","Dick Durbin said killing filibuster 'would be the end of the Senate' before flip-flopping","Patriots to sign Hunter Henry to 3-year contract: report","NC 'domestic terrorist' sentenced over failed fire attack on police SUV during George Floyd unrest","Dan Bongino slams Biden immigration agenda: Without a border, 'you don't have a country'"]},{"source":"google-news","date":1615913389865,"titles":["Demon Slayer: Mugen Train Rides the Rails to North America in April","Rihanna drops $13.8M on Beverly Hills mansion","Massive piece of junk tossed from ISS...","Princess Connect! Re: Dive Event Welcomes Kyoka and the Little Lyrical Adventures!","Idris Elba é um caubói que redescobre a paternidade no trailer de “Alma de Cowboy”","NOW TV cambia nome e sbarca sui dispositivi Fire TV di Amazon","Cortex #113: Semi-Abandoned System","Singapore to start administering Moderna COVID-19 jab at four new vaccination centres - CNA",null,"We’ve Been Home for 1 Year: These Were the 10 Most Helpful Meals Plans Along the Way","Intel i5-11600K, i9-11900K, & 11th Gen Price, Specs, Release Date, & Z590 vs. Z490 Differences - Gamers Nexus","That Time I Got Reincarnated as a Slime Season 2 - Episode 34 - Megiddo","FEATURE: Looking for a New Show? Check out Hime's Helpful Recommendations!","Stephen A.: Bill Belichick is coming after Tom Brady | First Take - ESPN","7 Ancient Indigenous Inventions That Are Part of Our Lives Today"]},{"source":"msnbc","date":1615913390000,"titles":["With talk of 'terrorist watch list,' McCarthy pushes his luck at border","Federal authorities release new details in alleged assault on Capitol officers","Wisconsin's Ron Johnson tries, fails to clean up his newest ugly mess","Dr. Fauci: If we declare victory too soon, we can risk a surge","Gov. Andrew Cuomo was hailed as the anti-Trump. Not anymore.","CDC purges Trump era junk guidance in quest to restore reputation","Birx: I think about Trump 'inject disinfectant' moment every day","Plouffe: If GOP wins it all in 2024, U.S. will be an autocracy","Nearly half of Trump voters say they won’t get vaccinated. Can they be convinced?","‘This one is serious’: Gavin Newsom faces recall threat in California","'Disgusting': Trump ally not threatened by MAGA rioters, but would be by BLM protestors","Elizabeth Warren: 'The wealth tax is popular across America'","‘Believes in making our lands work’: Deb Haaland confirmed as first Native American Interior Secretary","That fun NFT art fad could be contributing to our planet's literal destruction","Frank Figliuzzi says we have an inability to ‘assess a threat when it looks like us’","Cuomo embattled: 'Even if he survives this next year may be a tough sled for him'","Alexei Navalny's Instagram account posts photo from Russian prison camp","On COVID, senator thanks God for Trump administration's 'genius'","Rep. McCarthy labels surge at U.S.-Mexico border 'a Biden border crisis'","Biden assures American Rescue Plan will provide relief 'quickly, equitably and efficiently'"]},{"source":"national-review","date":1615913389709,"titles":["Whitehouse Calls for Review of ‘Fake’ FBI Background Check into Kavanaugh in 2018","Portland is ‘Sick and Tired’ of Anarchist Violence, Destruction, Officials Say","McConnell Warns Democrats of ‘Scorched-Earth Senate’ If Filibuster Is Removed","Virginia Allows Elective-Abortion Coverage on State Exchanges","DHS Secretary Predicts Migrant Surge Will Break 20-Year Record, Blames Trump Policies","Seventh Circuit Blocks Indiana Parental-Notification Law for Minors Seeking Abortions","Joe Biden Now Says Americans Should Wear Masks Until ‘Everyone’ Is Vaccinated","Dem Senator Caught on Hot Mic Predicting Infrastructure Bill Will Pass Without GOP Support","Trump Touts WaPo Correction, Again Claims Georgia Victory Was Stolen","Public Behavior Led the Way on COVID-19 Lockdowns — and It Will Lead Us Out","We Shut Down for Way More Than 15 Days — and Still Didn’t ‘Slow the Spread’","The Populist Dilemma on Free Speech and Cancel Culture","Joe Biden Shouldn’t Return to the Iran Deal","Mayor’s Plan to Abolish Police Department Will End in Disaster, City’s Ex-Chief Warns","After Arrests for Assault of Officer Sicknick, Many Questions Remain","The Ides of America","Senate Confirms Deb Haaland as Interior Secretary","Dems, Media Go Silent on ‘Kids In Cages’ Now That Biden Is in Office","McConnell Hits Biden’s ‘Bizzare’ Goal of Small Gatherings by July 4th","Tackling COVID-Vaccine Skepticism inside the Tent"]},{"source":"nbc-news","date":1615913389850,"titles":["Birx says she still thinks about Trump's disinfectant proposal for Covid 'every day'","No indication blot clots caused by AstraZeneca vaccine, Europe's medicines watchdog says","Assistant principal, daughter accused of hacking homecoming election","In Peru, populist frontrunner Yonhy Lescano wants to spread mining wealth","LGBTQ Catholics stung by Vatican rebuff of same-sex unions","Michelle Obama discusses new Netflix show, race, royal family in interview","Reasons why IRS tax refunds delayed for millions of Americans","DATELINE THURSDAY SNEAK PEEK: The Woman with No Name","Disappointment surrounding Vatican’s refusal to bless same-gender unions","Basketball legend Kareem Abdul-Jabbar is helping to teach STEM skills to Black and Latino students","New fragments of Dead Sea Scrolls found in Judean Desert cave","Israel reveals ancient Bible texts in new Dead Sea Scrolls discovery","Don't cause a 'stink,' sister of North Korean leader tells U.S.","GOP bill mandates prisoners' stimulus money go to restitution","One year after Dow's biggest one-day drop, Wall Street reflects on what it got right — and wrong","Former NFL star Keyshawn Johnson says daughter Maia, 25, has died","Remember the Obamacare website? Biden admin looks to get it right for vaccines","Both parties are making very different early bets for 2022","Southwest border crossings on pace for highest levels in 20 years, Biden admin says","Yevgeny Vindman, fired by Trump White House, now says Army set to promote him"]},{"source":"newsweek","date":1615913389845,"titles":["Italy Seizes Nearly 400K AstraZeneca Doses, Starts Investigation After Man Dies Following Shot","Dangers of Bear Spray Explained After Arrests Over Capitol Officer Assault","'Mayans MC' Season 3: How to Watch to FX Show Online","Adorable Video Shows Lions Playing in Thick Snow at Denver Zoo","Sen. Ron Johnson Doubles Down on Capitol Riots, BLM Remarks With WSJ Op-Ed","Majority of Voters Want Higher Taxes on Millionaires to Fund More Stimulus Checks: Poll","Magic Mushrooms, Ayahuasca and Mescaline Decriminalized in Washington, D.C.","U.S. Military's 'Maximum Pressure' in South China Sea 'Unprecedented': Beijing Think Tank","Meghan and Prince Harry 'Frustrated' With Royal Racism Scandal: Gayle King","Arizona GOP Ordered to Pay State Over $18,000 for 'Groundless' Election Lawsuits","Jane Fonda Praised for Joining Protests Against Minnesota Pipeline","Nearly Half of Americans Now View China as Nation's Greatest Enemy: Poll","'Fortnite': Find Golden Artifacts Near the Spire Locations for Week 1 Challenges","Duke University Orders Lockdown After Fraternity Rush Prompts Coronavirus Spike","Teacher Quits Over Use of George Floyd's Name in Chemistry Quiz","Portland Mayor Ted Wheeler Says Residents Are 'Sick and Tired' of Destruction Occurring During Protests","Capitol Rioter Says Officer 'Shrugged' When He Asked if He Could Enter Building","California Judge Sides With Parents Suing Schools Over Strict Reopening Rules","Ex-Firefighter Gifted New Job, Car, Home After His Modest Facebook Appeal","U.K. Changes Nuclear Strike Rules Over Cyber, Chemical and Bioweapon Attacks"]},{"source":"new-york-magazine","date":1615913390007,"titles":["Is This the End of Business Travel As We Know It?","Biden Could Make Class Resentment Great for Democrats Again","Ron Johnson Complains His Delusional Riot Claims Are Being ‘Silenced’","Amazon Worker: ‘It’s Not Fair to Get Fired for Going to the Bathroom’","Just Reopen the Schools Now","Sports Are About to Look Like 2019 Again","The Magic Molekule","The CDC Is Reckoning With Its Damage Under Trump","Deb Haaland Confirmed As First Native American Interior Secretary","Will Public Support Save Andrew Cuomo?","How Far Along Is New York City in Its Reopening This Spring?","Gerontocracy Is Hurting American Democracy","Two Charged With Assaulting Officer Brian Sicknick, Who Died After Capitol Riot","Biden Builds Popularity by Focusing on COVID Relief Plan","Biden’s Not Ready to Cut Bait on Cuomo yet","How the West Lost COVID","The U.S. Withdrawal From Afghanistan Just Got More Complicated","Biden to Deploy FEMA at the Border Amid Child Migrant Surge","Cuomo’s Vaccine Czar Called County Officials to Gauge Their Loyalty","The Slow Push to ‘Free the Capitol’ From its Fencing"]},{"source":"politico","date":1615913390016,"titles":["How the world is fighting climate change with murky models","Newsom: California recall appears to have enough signatures","Senate centrists weigh brokering deals on immigration, minimum wage","Democrats call for $12B boost in State, USAID budget","Going after the ‘Achilles’ heel’: Biden charges into global anti-corruption fight","Texas tacks advertisers' 'cookie' fight onto Google antitrust suit","How Yang Charmed The Right On His Road To Political Stardom","NEWSOM says he’ll tap Black woman to DIFI seat— SANDERS, WARREN, BOOKER decry RECALL — CALEG pols traveled despite COVID — COX loses staff","Austin, Blinken head to South Korea amid fresh warnings from Pyongyang","NO VAX FOR PRITZKER, YET — AS THE FUNDRAISING TURNS — INCHING TOWARD REOPENING","Dems, GOP prep dueling messages on Covid bill","LYNCH blasts MBTA CUTS — WARREN wades into CALIFORNIA RECALL — Some STATE POLICE turn down VACCINES","Cuomo accuser meets with investigators — How Yang charmed the right — Coronavirus cases plateau","More New Jersey connections to Jan. 6","New poll shows Cuban-American voters align with GOP","POLITICO Playbook: Progressives: Dems must choose between Black voters and the filibuster","The Google Files: Power players","The Google Files: Four things the documents reveal","When Big Tech goes after Big Tech - Politico","Google wanted to ‘own’ the mobile search market. The U.S. let it."]},{"source":"reddit-r-all","date":1615913390002,"titles":["Piracy, Overcoming Gravity, and the Digital Edition","Has Y Combinator lost its way when the latest company is a Mac only widget?","My bank sent me 64 copies of the same debit card","Join David Borenstein for a reddit AMA at 2:30 p.m. ET to discuss his film on the price of being a social media star in China","YouTube doesn't handle space anymore","Florida is suffering from an epidemic of bald men renting billboards that need to be extended in order to fit their bald heads.","Django admin looks dated and is not mobile friendly, any better options ? : django","Reddit: Online Presence Indicators","Namecheap just snaked another domain off me","Any open source DRF projects? : django","I want this guy working on the unit tests : ProgrammerHumor","Protest note about user privacy changes by Reddit","What virtual environment system do you use for your Django projects and why? (venv, pipenv, pyenv, etc ) : django","In the 90s part of Germany's air traffic control software ran on Emacs","The railroads of the world! [OC] : dataisbeautiful"]},{"source":"reuters","date":1615913390004,"titles":["Several U.S. States join Texas lawsuit against Google - Reuters","I've had AstraZeneca vaccine, says Britain's Duchess of Cornwall - Reuters","Primordial lightning strikes may have helped life emerge on Earth - Reuters","Tanzanians should be told about Magufuli's health, opposition says - Reuters","CANADA FX DEBT-Canadian dollar holds near 3-year high ahead of 'event risk' - Reuters","U.S. lawmakers seek 20% boost in foreign affairs budget, with eye on China - Reuters","Germany, Canada agree to explore green hydrogen development - Reuters","Italy's CCB backs out of buying loss-making Carige, source says - Reuters","Developers to pay lower fees to Google's app store for first $1 million in revenue - Reuters","Tiger Woods signs video game deal with 2K - Reuters","Employers with large on-site workforce can set up COVID-19 vaccine clinics: U.S. CDC - Reuters","Moldova's president says nominating new prime minister - Reuters","Brazil economy creates record number of formal jobs in January - Reuters","Court in Bremen opens insolvency proceedings for Greensill Bank: statement - Reuters","Morocco's vaccination drive bypasses undocumented migrants - Reuters","Breakingviews - Capital Calls: Glass Lewis finds love - Reuters","Breakingviews - Capital Calls: Netflix freeloaders - Reuters","Breakingviews - Guest view: SPAC secret sauce could turn sour - Reuters","Macron's party pushes back against finance minister's COVID debt plans - Reuters"]},{"source":"the-american-conservative","date":1615913389845,"titles":["A Hollow Victory for American Workers","A ‘Never Again’ Moment, Again","Destroying What We Are Trying to Save","Reform Big Tech in a Way That Helps Small Entrepreneurs","Begin Returning to a Normal Life","The Fierce Urgency of Reopening Schools Now","How Small Colleges Can Thrive","Biden’s Judiciary: A Tower of Babel","NYT Offering a Dangerous Version of ‘Truth’ in Ethiopia","Cuomo Was Warned His COVID Group Home Policies Would Kill","The Ghost of Empires Past","COVID and the Tyranny of Comfort","Will FBI ‘Chats’ Send Conservatives to Prison?","Here’s the Deal","Mistrusted Institutions Are Pushing America into a Debt Crisis","Biden Must Pressure Saudi Arabia to End the War on Yemen","The Electric Slide: Car Culture Captures Climate Policy","Pro-Life Policy After the Baby Arrives","18 Years of Tragedy Must Come to an End","Route Around Deplatforming With Decentralized Tech"]},{"source":"the-hill","date":1615913390164,"titles":["Lawmakers warn of funding risk if 144 cities are reclassified as 'micropolitan' areas","Coca-Cola, Home Depot oppose Georgia bills restricting voting","UN watchdog: US return to Iran nuclear deal still possible","High schooler, mother arrested for hacking homecoming queen vote","Russia gives Twitter one month to remove banned content or be blocked","Michelle Obama partners with group providing 1 million meals to families in need","Cornyn, Cruz to lead Senate delegation to border next week","Five attorneys general join Texas-led lawsuit against Google","UK plans to increase funding for street safety following death of Sarah Everard","Banks point finger at IRS for brief stimulus checks delay","Owner of restaurant targeted over mask requirement: 'We're not going to accept or allow ignorance, hate or racism'","McConnell offers scathing 'scorched Earth' filibuster warning","DHS says migrant border crossings on pace to reach highest level in two decades","Shakespeare in the Park set to return in New York","Top 5 Republican presidential contenders, and 2 on the way out","New report finds 4,276 children held in CPB custody as of Sunday","Dem senator suggests FBI background investigation of Brett Kavanaugh fake","Democratic super PAC launches six-figure ad buy, kicking off $100 million midterm push","Democrats, Republicans recommend more input, detail on Biden conservation goals","Fauci: July Fourth gatherings 'conceivable and possible'"]},{"source":"the-huffington-post","date":1615913390459,"titles":["FLASHBACK - Joe Stack STATEMENT: Alleged Suicide Note From Austin Pilot Posted Online"]},{"source":"the-washington-post","date":1615913390464,"titles":["The dangerous game Tucker Carlson is playing on vaccines","Make voting rights suppressors pay","Outbreak of dangerous thunderstorms and tornadoes forecast for South Wednesday","U.S. officials pushed Brazil to reject Russia's coronavirus vaccine, according to HHS report","Ron Johnson comes close to getting the point","On same-sex unions, Pope Francis must navigate a divided church","Some long-haul covid patients say their symptoms are subsiding after getting vaccines","China to foreign travelers: Take our coronavirus vaccine, enjoy a streamlined visa process in return","The Post publishes correction on Trump call with Georgia investigator","The latest GOP attack on Biden has a huge hole in it","Morgan Wallen music sales still soaring six weeks after he was 'canceled,' but story bigger than him...","Here’s what it was like to fly beneath the northern lights","States that pass Jim Crow-style voting laws will feel the backlash","What Michelle Obama had to say about Meghan's claims of racism within the British royal family","The perfect Republican policy argument: Imagine a terrorist immigrant who votes illegally","Children as young as 11 beheaded by Mozambique militants, aid group says","Unraveling the mystery of Europe's uneven covid surges","High-schooler, mother hacked school records to steal homecoming queen election...","As Israelis head back to elections, there's new twist: Dems in Washington...","Army initially pushed to deny District's request for National Guard before Jan. 6..."]},{"source":"the-washington-times","date":1615913390465,"titles":["About to learn his definition of 'fair share'...","Terror suspects part of border surge...","For Biden, there's no place like a weekend home in Delaware","Pentagon goes to war with FOXNEWS over 'feminizing' military...","NEXT: Gun Control?","Obama, Bush, Clinton, Carter push COVID-19 vaccination","Jay Bhattacharya, Stanford doctor: Lockdowns 'single worst public health mistake' in last 100 years","Justice Amy Coney Barrett riles conservatives with moderate rulings...","Illegal immigrants shouldn't be included in congressional count","'It is not right': Bill offers hope that flyers of CIA's Air America will finally win recognition","'Extraordinary crisis': Democrats' revolutionary climate change bill aims to remake U.S. economy","$1,400 stimulus checks could be intercepted, consumer advocates warn","DARPA, CIA-contracted fund partner to stop China from gobbling up America's intellectual property","U.S. plans to deploy long-range missiles in Asia to deter 'our greatest strategic threat'","Portland federal officers forgotten as Pelosi eyes Congressional Gold Medal for Capitol Police","It's time to question Biden's mental health","'Almost useless' COVID-19 tests on migrants dropped in Texas town find 25% infected","Will the real president of the United States please stand up?","6 books, nix books: Dr. Seuss works halted for racist images","Gina Carano, 'absolute sweetheart,' defended by 'Mandalorian' actor Bill Burr: 'It's f---ing crazy'"]},{"source":"time","date":1615913390002,"titles":["Why Countries Around the World Are Suspending Use of AstraZeneca’s COVID-19 Vaccine","Elliot Page Is Ready for This Moment","Michelle Obama’s Wonderful Netflix Show Waffles + Mochi Is the Sesame Street of Food TV","Defense and Foreign Ministers Meet in Tokyo as the Biden Administration Makes Its First Asian Foray","LGBTQ Catholics Are Stung by the Vatican’s Rebuff of Same-Sex Unions","The COVID-19 Pandemic is the ‘Most Discriminatory Crisis’ Females Have Experienced, Says the Head of U.N. Women","The Death Toll in Myanmar’s Protests Reaches 138 as the Junta Orders Martial Law Across a Large Area of Yangon","The Historical Significance of Deb Haaland Becoming the First Native American Cabinet Secretary","The Historical Significance of Deb Halaand Becoming the First Native American Cabinet Secretary","Exploring the Wild World of Weird Homes on Zillow Can Be a Cabin Fever Cure","The Snyder Cut Is a Better Version of Justice League. But It Sets a Dangerous Precedent","How Syria’s Decade-Long War Has Left a Toxic Environmental Legacy","CNN’s Don Lemon on Trump, the Death Throes of White Supremacy, and James Baldwin","The Snubs, Surprises and History-Making Nods of the 2021 Oscar Nominations","Vatican Says Catholic Priests Must Not Bless Same-Sex Unions as God ‘Cannot Bless Sin’","Trump’s South Texas Gains Vex Democrats","A Year Into the Pandemic, Long COVID Is Still Burdening Patients—and Their Caregivers","President Biden Declines to Call for N.Y. Gov. Cuomo to Resign Over Sexual Harassment Claims","The Best, Worst and Most Head-Scratching Moments of the 2021 Grammy Awards","Rodrigo Duterte Is Using One of the World’s Longest COVID-19 Lockdowns to Strengthen His Grip on the Philippines"]},{"source":"usa-today","date":1615913390003,"titles":["Drake celebrates latest accomplishment by hilariously imitating Steph Curry","Yellowstone records first grizzly bear sighting of 2021","Giants adding Devontae Booker gets ‘below average’ grade from PFF","How much are student-athletes worth? March Madness returns, as does compensation debate.","NFL Free Agency 2021: The 5 best moves from the first day of tampering","Suicide took my son's life. I grieve for people like Meghan Markle, who ask for help and can't find it.","Anti-government leader Ammon Bundy refuses to appear in court with mask, gets arrested","Opinion: Rick Pitino, back in NCAA Tournament, got bruised but never lost what made him great","Bud Dupree will make bank with the Titans","Every player the Jets have signed so far in free agency","Chidobe Awuzie leaves Cowboys for 3-year deal with Bengals in free agency","Report: 3 teams showing interest in N’Keal Harry after Bill Belichick’s spending spree","Panthers TE Chris Manhertz agrees to 2-year deal with Jaguars","John Johnson chose to sign with Browns despite bigger offers from other teams","ESA astronaut to bring French cuisine onboard ISS","Warren Buffett's million-dollar March Madness contest returns, and his employees need Creighton to go deep","Report: Jaguars expected to retain CB Sidney Jones","Every player the Patriots have signed so far in free agency","UFC Fight Night 187 medical suspensions: Belal Muhammad faces 30 days after eye poke","DC vs Marvel: Who is the ultimate superhero?"]},{"source":"vice-news","date":1615913390003,"titles":["Asian Uber Driver Who Was Assaulted by Nightmare Riders Raises $100K From GoFundMe: ‘It Has Not Been Easy’","Chess World Champion Plays 'Bongcloud Attack' Meme Opening in Tournament","Lightning Strikes May Have Sparked Life on Earth, New Study Proposes","Adobe Forces Takedown of Tweet Linking to 27-Year-Old Product","Clothes to wear when you're missing the rave","Two young photographers share how they’ve kept creative over lockdown","Exclusive: Vaquera’s AW21 film makes waiting backstage the main event","Capitol Police Officer Suspended After Notorious Anti-Semitic Text Found at Work","Lily-Rose Depp goes off the rails in new Voyagers trailer","Russia Deploys Device Probing Reality to the Depths of World's Deepest Lake","OnlyFans Bans Public Sex","Escape Zoom Meetings by Faking Technical Issues and Crying With This App","Communism Works Beautifully On Our Dedicated 'Valheim' Server","Undercover police will patrol nightclubs and bars to protect women from predators","Japanese Women No Longer Need Spousal Consent for Abortions – If They Were Abused","The Tragic Journey of a Public Health Hero in the Philippines","‘Exvangelicals’ Are Living a Uniquely American Crisis","8 People Describe How Unions Changed Their Lives","The vital work of women street photographers","What It’s Like to Be a Trans News Anchor in a Conservative Muslim Country"]}]