[{"source":"abc-news","date":1616001274562,"titles":["Founder of Chinese e-commerce firm Pinduoduo departs","Greece could order private doctors to join COVID-19 battle","Millions across Southeast bracing for potential tornadoes","UK foreign secretary: Democracy in retreat around the world","Polish state websites hacked and used to spread false info","Excessive force lawsuit in man's death settled for $750K","Experts: Virus surge in Europe a cautionary tale for US","Senate confirms Katherine Tai as Biden's top trade envoy","Japanese regulators say TEPCO nuclear plant prone to attack","Man who spent years in prison sues over withheld evidence","Pre-embryos made in lab could spur research, ethics debates","2 found dead at supermarket distribution center, suspect dies after police pursuit","Council calls for Indiana mayor's job after profane message","Egyptian activist sentenced to 18 months for 'fake news'","Crowded bars: March Madness or just plain madness?","Judge warns media at ex-cop's trial of possible removal","Nashville OKs $2.25M settlement in fatal shooting by officer","Magic is Back at Disneyland Resort! Theme Parks Plan to Reopen on April 30","EU’s Frontex renews joint border control deal with Albania"]},{"source":"al-jazeera-english","date":1616001274471,"titles":["Disney to reopen California parks a year after COVID closed them","Biden administration faces pressure on immigration amid influx","Syria launches COVID vaccine drive as Israel questions swirl","Tunisian president in Libya for talks with new unity government","Attackers on trucks and motorbikes raid Mali base, kill 33 troops","Lebanon: Aid to be disbursed in dollars as Lebanese pound crashes","Coinbase pegs valuation at $68bn ahead of landmark listing","Biden: Putin is a killer, Russia will ‘pay’ for election meddling","Sex abuse inquiry: English football failed children for 35 years","EU envoys agree first China sanctions in three decades: Diplomats","As Europe looks to summer, EU sets out coronavirus passport plan","Climate concerns to crime: Bitcoin’s dark side draws scrutiny","US white supremacist propaganda surged in 2020: Report","The US and China: Avoiding a meltdown","First batch of COVAX-supplied vaccines arrives for Palestinians","Serbia’s vaccine diplomacy in China’s shadow","Moderna begins testing its COVID-19 vaccine on children","US will not take sides on UK-EU Northern Ireland rift: Official","Is Biden doing any better for migrant children?","UN sounds alarm over COVID deaths of children in South Asia"]},{"source":"associated-press","date":1616001274583,"titles":["MASSAGE MASSACRE SUSPECT 'SEX ADDICT'...","Field is set: NCAA Tournament will have no replacement teams","Senate confirms Katherine Tai as Biden's top trade envoy","Chapman's return at third base a big boost for new-looks A's","Man who spent years in prison sues over withheld evidence","Experts: Virus surge in Europe a cautionary tale for US","Japanese regulators say TEPCO nuclear plant prone to attack","UConn frosh Paige Bueckers leads women's AP All-America team","Pre-embryos made in lab could spur research, ethics debates","Pistons hire EMU coach to be G League team's GM","Council calls for Indiana mayor's job after profane message","AP source: Chiefs signing Charlton, Williams to 1-year deals","Judge warns media at ex-cop's trial of possible removal","Nashville OKs $2.25M settlement in fatal shooting by officer","Crowded bars: March Madness or just plain madness?","Large coronavirus vaccination event planned in St. Louis","West African court allows extradition to US of Venezuelan","Parents must be told after 1st cannabis arrest under bill","Oklahoma women's coach Coale retires after 3 Finals Fours"]},{"source":"axios","date":1616001274576,"titles":["Senate unanimously confirms China expert Katherine Tai as U.S. trade representative","Biden administration to direct $12 billion in relief funds for COVID testing in schools","Keith Rabois' new startup OpenStore will buy up e-commerce businesses","Inflation surpasses coronavirus as investors' biggest worry","Biden says he believes Putin is a \"killer\"","Wall Street's \"smart money\" is still betting stocks fall","The split at the heart of tech's new labor movement","The case for going back to the office","Suspect in custody after Georgia massage parlor shootings leave 8 dead","U.S. sanctions 24 Hong Kong and Chinese officials ahead of Blinken's key meeting","Hate speech soars for young social media users","Biden says he supports reforming filibuster","Dems outrank GOP in public mentions of immigration and bill backing","Democrats grow impatient about crisis at U.S.-Mexico border","Haitian officials compare calls for president's ouster to Capitol riots","Prominent Republicans kiss the ring to seek Trump's endorsement","Biden says Cuomo should resign if allegations are true","Trump recommends Americans get coronavirus vaccine - Axios","White House expects a tough first meeting with China in Alaska","Biden tells Central American migrants: \"Don't come over\""]},{"source":"breitbart-news","date":1616001274563,"titles":["Poll: Majority Support Fencing Around the U.S. Capitol","Dem Rep. Ruiz: Biden Hasn’t Done ‘Enough’ to Address Border Crisis","Chinese Media Attack Ted Cruz, Mitt Romney Despite Them Opposing Olympics Boycott","Democrat Tammy Duckworth Promotes ‘Assault Weapons’ Ban: I Want My Daughters to Grow Up in a Country that Will ‘Protect Them’","Alabama Democrats Vote Against Voter Fraud Bill: ‘We Are One Step Away from Jim Crow’","‘Marxists’ Hijacking Sarah Everard Death, Says Farage After WW2 Memorial Defaced","Migrant Taxi NGO Head Justifies Allegedly Getting Paid to Pick Up Migrants","Joe Biden Requests Mask Wearing ‘Until Everyone Is Vaccinated’","REPORT: 13K Unaccompanied Minors in Border Patrol Custody, Many for 5 Days","Pelosi Says Joe Biden Blameless for Border Crisis: He’s ‘Not Quite Two Months’ in Office","Google Ranks Democrat National Committee’s Blog Post as ‘News’","Watch Live: DHS Mayorkas Defends His Side-Door, Max-Migration Plans","Nolte: Chuck Todd Blames Biden Border Disaster on Republicans","‘Professional Criminals’: Couple Convicted of 1996 Murder of British Man","Poll: 75% Support Voter ID Law, Including 60% of Democrats","Marvel Comics’ Latest Captain America Is a Gay LGBTQ Activist","Report: Soros-backed L.A. District Attorney to Downgrade 'Hardcore Gang Unit'","Delingpole: Matt Hancock Is Proud to Be Dyslexic. OK, So?","California Begins to Reopen, Slowly, as Most of State Enters ‘Red’ Coronavirus Tier","Police Review 15,000 Death Certificates at NHS Opioid ‘Euthanasia’ Hospital"]},{"source":"cbs-news","date":1616001274575,"titles":["House GOP votes to reverse internal ban on earmarks","Suspect in deadly spa shootings may have \"sexual addiction,\" sheriff says","Missouri dad speaks about transgender daughter, urging lawmakers not to pass student-athlete bill","Senate unanimously confirms Katherine Tai as U.S. trade representative","Atlanta mayor and police give update on spa shootings","\"Unspeakable tragedy\": Asian American community reacts to spa shootings","\"The Talk\" on extended hiatus as CBS probes allegations of offensive language by Sharon Osbourne","Matthew McConaughey eyes potential run for Texas governor","Clever new phishing scam targets unemployed New Yorkers","101-year-old nun allowed to go to NCAA Tournament","At least 8 dead in shootings at Georgia spas","Biden indicates support for filibuster change","Dad's speech about trans daughter goes viral","What's in the $29 billion Restaurant Revitalization Fund?","3/17: CBSN AM","Doctor on deadlier COVID variant, vaccine for pregnant women","Worldview: Gunmen slaughter villagers in Niger, Buddhist leaders distance themselves from Myanmar coup makers","States want to use stimulus checks to fund tax cuts","Report reveals how U.S. regulators missed opportunity to rein in Google","Dead Sea Scroll discoveries open a new window into early humanity"]},{"source":"cnn","date":1616001274604,"titles":["Hatch Restore can customize your sleep routine with lights, sounds and more","Minnesota veteran knits hundreds of hats for Salvation Army","The UK is facing a reckoning on gender-based violence. Boris Johnson's government has botched its response","House Republicans reverse earmark ban, opening door to both parties using the formerly banned practice","Por qué tantos niños cruzan la frontera de EE.UU. solos","Amalgamated becomes the first major US bank to endorse reparations","Omarosa Manigault Newman can't force Trump to testify in lawsuit, judge rules","Biden on US meeting looming Afghanistan withdrawal deadline: 'Could happen, but it is tough'","Higher mortgage rates still aren't cooling the hot housing market","Senate confirms Katherine Tai to be US trade representative","قرقاش حول تدخل الإمارات في الانتخابات الإسرائيلية: الهدف من \"الاتفاقيات الإبراهيمية\" تعزيز السلام","Husband and wife reunite after year apart","Esto es lo que sabemos sobre los tiroteos en los spa del área metropolitana de Atlanta que dejaron 8 muertos","Jimmy Kimmel's daughter not a fan of Michelle Obama's food","HHS announces $10 billion to expand coronavirus testing in schools","SPAC fundraising is up an insane 2,000% from a year ago","Las celebraciones del Saint Patrick’s Day son perfectas para propagar el coronavirus. No permitas que esto ocurra","Harris condemns 'tragic' Atlanta shooting and expresses solidarity with Asian American community","Disneyland sets reopening date","Meet the basketball team with the longest win streak in the US"]},{"source":"fox-news","date":1616001274579,"titles":["DHS chief Mayorkas testifies climate is in 'crisis' but stops short of using that word to describe border","What the Perseverance Mars rover has accomplished so far","Netflix's 'Operation Varsity Blues' focuses college admissions scandal conversation on William 'Rick' Singer","Cuomo receives Johnson & Johnson COVID-19 vaccine","Texas mayor sounds alarm about robberies, car chases as migrant surge worsens","Spirit Airlines removes 4-year-old child with autism and family for not wearing mask on flight","CDC looking to update school coronavirus guidance ‘soon,’ Walensky says","Cuomo accuser's lawyer rips NY assembly’s law firm choice for impeachment probe, citing connection to governor","Disneyland will reopen on April 30 at limited capacity, require guests to make reservations","565 unaccompanied children crossing southern border daily as migration numbers explode","Expedia reveals friendliest towns and cities in the US for 2021","Biden border wall freeze unlawful, 40 GOP senators tell GAO in letter","CNN hemorrhaging viewers since Trump left office, down nearly 50 percent in key measurables","Virginia brewery releases beer inspired by vulgar complaint from disgruntled maskless customer","Charges dropped against driver who crashed $750G supercar into several vehicles during NYC lockdown","Iran has built new ballistic missile launch positions, satellite images show","2 Derek Chauvin trial jurors dismissed after $27M George Floyd settlement media coverage","Deshaun Watson garnering trade interest from another suitor amid Texans drama","Biden 'may not be tough enough' to stand up to AOC, Bernie Sanders on filibuster: Tom Cotton","Kevin McCarthy proven right after Dems, media accuse him of lying about suspected terrorists at border"]},{"source":"google-news","date":1616001274581,"titles":["Crunchyroll All-Stars: Ifeadi Odenigbo on How Anime Helped Him in Philosophy Class","Cómo crear tu propio Blastoise","Nunca había tenido tantas ganas de ponerme una vacuna","El Shaddai Game Makes Its PC Debut This April","Veja os 5 hatches automáticos mais econômicos com etanol","Aria the Scarlet Ammo AA (German Europe) - Episode 9 - Home Visit","Aria the Scarlet Ammo AA (German Europe) - Episode 3 - Applying to be an Amica","Aria the Scarlet Ammo AA (German Europe) - Episode 1 - Another A","Dagashi Kashi (German Dub) - Episode 6 - Super Himo Q, Ohajiki, and sometimes Maken Gumi... / Yoguret, Coconuts, and...","Dagashi Kashi (German Dub) - Episode 8 - Super Scary Story Gum, Typhoon, and... / Kendama, Popping Fortune-Telling Chocolate, and...","Dagashi Kashi (German Dub) - Episode 1 - Umai-bou, Fries, and... / Milk Coffee Candies, Young Donuts, and...","Dagashi Kashi (German Dub) - Episode 2 - Kinako-bou, Namaiki Beer, and... / Fue Ramune, Menko, and...","Bleach (German Dub) - Episode 6 - Untitled","Bleach (German Dub) - Episode 61 - Untitled","Bleach (German Dub) - Episode 56 - Untitled","Bleach (German Dub) - Episode 52 - Untitled","Bleach (German Dub) - Episode 48 - Untitled","Bleach (German Dub) - Episode 47 - Untitled","Bleach (German Dub) - Episode 49 - Untitled","Bleach (German Dub) - Episode 44 - Untitled"]},{"source":"msnbc","date":1616001274571,"titles":["Harris addresses shootings in Atlanta: 'We grieve for the loss'","FBI expert: Atlanta shootings could be hate crime against women","Atlanta police: Shooting suspect may have 'sexual addiction', too early to say if it was hate crime","Two previously seated jurors excused from Chauvin murder trial","Intel report makes clear: Russia tried to rescue Trump in 2020, too","Why McConnell's 'scorched earth' threat over filibusters matters","President Biden, Irish PM set to hold bilateral meeting","Georgia man arrested in massage parlor shooting spree","Ron Johnson won't stop screaming about being silenced","The GOP's anti-voting laws would hurt even more people than Jim Crow did","Michigan AG: ‘Mass escalation in number of threats toward public officials’","8 killed in 3 shootings at Georgia massage parlors, spas; suspect in custody","‘Catastrophic:’ GOP pushes at least 78 anti-trans measures in 25 states","Russian agent who met with Trump campaign chief in 2016 named in new 2020 intel report","Chris Hayes: Tucker Carlson’s not stupid, he just thinks his audience is","John Fetterman: We’ll block any anti-vote by mail bills Pennsylvania Republicans try to pass","Harry Reid calls for killing the filibuster: ‘60% is not a real democracy’","Eddie Glaude: Voter suppression is in this country’s DNA","Chris Krebs reacts to new government reports that confirm what he was fired by Trump for saying"]},{"source":"national-review","date":1616001274565,"titles":["Why the Filibuster Must Be Saved","This Mother Fights against a School That Indoctrinates Her Son","President Walter Mitty vs. Vladimir Putin","Want to Work for POTUS? Don’t Tweet","Newsom ‘Worried’ about Recall Effort, Plans to ‘Fight Like Hell’ to Remain in Office","Biden on Afghanistan","‘How Trump Got Control of the Border’","One Week after Ending the Statewide Mask Mandate, Texas’s Case Numbers Are Slightly Lower","The Ongoing Assault on Academic Freedom","‘So Crazy-American’","Biden Says Cuomo Should Resign if Investigation Confirms Accusers’ Claims","Biden Admin Restricts Border Patrol Contact with Media during Migrant Surge","Exclusive: New GOP Bill Hits Back against Chinese Funding of U.S. Think Tanks","U.S. Sanctions Chinese Officials Involved in Hong Kong Takeover","How China’s Communist Cash Crushed Hong Kong’s Democratic Aspirations","How Trump Got Control of the Border","The Reeducation Oscars","Joe Biden’s Narrow Mandate","The EU Failed Its Coronavirus Vaccine Rollout","Bad words, good words, &c."]},{"source":"nbc-news","date":1616001274601,"titles":["Scientists say they've peeked into the 'black box' of early human development","Two people dead inside Wisconsin supermarket warehouse, foul play suspected","Fauci: High school students should be able to get vaccinated in fall, younger children in early 2022","Secretary of State Blinken slams North Korea's human rights abuses","How an unprecedented fan campaign powered Zack Snyder's cut of 'Justice League'","Biden administration to provide $10 billion to school Covid-19 testing program to speed reopening","Disneyland to reopen on April 30, Disney CEO Bob Chapek says","Suspect in deadly Atlanta-area spa shootings says he was motivated by sex addiction, sheriff says","Biden says he plans 'small to significant' tax hike for those making over $400,000","2 seated jurors in Derek Chauvin's trial dismissed","Facebook to crack down on groups that break its rules","Brazil names new health minister as Covid deaths hit new record","Biden, Irish PM to hold annual St. Patrick's Day meeting virtually","DHS Secretary Mayorkas faces lawmakers amid humanitarian crisis at the border","Immigration stalemate underscores our long-broken system of government","Latino funeral home owner saw Covid's scourge, warns Texans 'to be careful'","Encrypted messaging app Signal blocked in China","Moderna chief: Covid-19 vaccine not expected to be unsafe for children","'It overtook us': Latino funeral home owner saw Covid's scourge up close","Biden says Putin 'will pay a price' for 2020 election interference"]},{"source":"newsweek","date":1616001274610,"titles":["Man Finds Tooth of Megalodon, Biggest Shark to Ever Live, in South Carolina","'We Need Help': Georgia Sen. Michelle Au Sent Asian American Warning Day Before Shooting","Ja Rule Enters Trendy NFT Art Market With Fyre Festival Painting","In Zimbabwe, Toxic Masculinity is Driving Male Suicide Rates | Opinion","Will Biden's Real China Strategy Please Stand Up? | Opinion","Tesla 'On Autopilot' Hits Michigan Police Car As Officers Investigate Another Crash","'NCIS': Will Season 19 Be the Last Ever Season?","CCTV Captures Chinese Mom's Quick Reflexes To Save Baby Falling Headfirst","Church Robert Aaron Long Attended Removes Social Media in Wake of Atlanta Massage Parlor Shootings","'NBA 2K21' Next-Gen Update 1.07 Adds Spring Courts, New Faces - Patch Notes","Xbox Series X Restock Updates for Amazon, Target, Newegg, Best Buy and More","Atlanta Suspect Robert Aaron Long Planned Attack on Florida Porn Industry, Police Say","China, U.S. Contradict Each Other About Alaska Meeting","It's Time for the Government to Crack Down on Big Tech | Opinion","Joe Biden 'Cannot Behave This Way' Says Duma Speaker Angered at 'Killer' Putin Comment","Kamala Harris Tells Asian American Community 'We Stand With You' After Georgia Shootings","Atlanta Shooting Victims' Names Released: What We Know So Far","In the Middle East, While America Fights, China Wins | Opinion","Can You Take Advil Before or After Having the COVID Vaccine?","54% of Germans Agree With AstraZeneca Suspension, After Country Started Trend to Halt Shot"]},{"source":"new-york-magazine","date":1616001274601,"titles":["Republicans: End the Filibuster, and We’ll Punish America By Enacting Our Agenda","Will Gavin Newsom Wind Up Like Gray Davis?","The Fight Over the Public Option Is Already Here","8 Dead After Shootings at Multiple Spas in Metro Atlanta: Updates","Cuomo’s Staff Tried to Tarnish First Sexual Harassment Accuser: Report","Did Europe Go Too Far in Pausing the AstraZeneca Vaccine?","The Alaska Republican Party Is Trying to Push Out Lisa Murkowski","McConnell’s Warning of a ‘Scorched-Earth’ Senate Is an Empty Threat","What If Cuomo Just Won’t Go?","Europe’s Quest to Fix the Internet","Is This the End of Business Travel As We Know It?","Biden Could Make Class Resentment Great for Democrats Again","Ron Johnson Complains His Delusional Riot Claims Are Being ‘Silenced’","Amazon Worker: ‘It’s Not Fair to Get Fired for Going to the Bathroom’","Just Reopen the Schools Now","Sports Are About to Look Like 2019 Again","The Magic Molekule","The CDC Is Reckoning With Its Damage Under Trump","Deb Haaland Confirmed As First Native American Interior Secretary","Will Public Support Save Andrew Cuomo?"]},{"source":"politico","date":1616001274586,"titles":["Senate confirms Tai as U.S. trade representative","EPA finalizes rule curbing interstate pollution from 12 states","DOE's first task for loan guarantees: Calming industry nerves","Mayorkas defends Biden administration's handling of border situation","Biden admin unveils $10B school testing plan for Covid-19","House GOP votes to embrace the return of earmarks","Atlanta mayor: Asian massage parlor shootings 'a crime against us all'","Biden accelerates filibuster fight — despite a critical hedge","Bipartisanship in a divided Senate? On China, perhaps.","Biden: Putin will ‘pay a price’ for interfering in 2020 election","What D.C.'s vaccine mess says about government tech - Politico","What It Will Take to Break the U.S.-Iran Impasse: A Q&A With Iranian Foreign Minister Javad Zarif","It’s RECALL deadline day — FEINSTEIN’s not going anywhere — OSE jumps in — GUZMAN confirmed, SU grilled — UBER reclassifies U.K. drivers","REP. FORD’s WEED TWEAK — COOK COUNTY’s IRISH 'MURPHYIA' — REMEMBERING COVID DEAD — FIRST REDISTRICTING HEARING!","The former Trump official advising House Republicans on immigration","BAKER to give NEW VAX details — Attack of the ‘COVID-BLASTING’ ROBOTS — MBTA train DERAILED","Biden says Cuomo could be prosecuted if allegations stick — Governor’s team tried to discredit accuser — De Blasio appeals for direct federal vaccine supply","State Department announces sanctions on Chinese officials over Hong Kong crackdown","Johnson and Huttle and ICE contracts","POLITICO Playbook: GOP to accuse Biden of ‘unlawful’ border actions"]},{"source":"reddit-r-all","date":1616001274623,"titles":["GraphWrap: extend your Django REST Framework API with a GraphQL interface with just two of lines of code. : django","My recommendation to learn Django : django","Piracy, Overcoming Gravity, and the Digital Edition","Has Y Combinator lost its way when the latest company is a Mac only widget?","My bank sent me 64 copies of the same debit card","Join David Borenstein for a reddit AMA at 2:30 p.m. ET to discuss his film on the price of being a social media star in China","YouTube doesn't handle space anymore","Florida is suffering from an epidemic of bald men renting billboards that need to be extended in order to fit their bald heads.","Django admin looks dated and is not mobile friendly, any better options ? : django","Reddit: Online Presence Indicators","Namecheap just snaked another domain off me","Any open source DRF projects? : django","I want this guy working on the unit tests : ProgrammerHumor","Protest note about user privacy changes by Reddit","What virtual environment system do you use for your Django projects and why? (venv, pipenv, pyenv, etc ) : django","In the 90s part of Germany's air traffic control software ran on Emacs"]},{"source":"reuters","date":1616001274605,"titles":["U.S. Treasury has mailed out 150,000 paper checks worth about $442 million - Reuters Africa","Syria to get first deliveries of COVAX vaccines within weeks: WHO official - Reuters Canada","'At the limit': Chile's world-leading copper industry rejects lawmaker bid to hike taxes - Reuters","EU threatens ban on COVID vaccine exports to UK - Reuters","Spanish hotel chain Melia sues government for lockdown damages - Reuters.com","Airline consolidation set back five years, IATA chief says - Reuters","Actor Johnny Depp seeks appeal in UK wife beater libel case - Reuters","U.S Senate confirms Tai as U.S. Trade Representative in bipartisan vote - Reuters","欧洲汇市：英镑企稳，因围绕阿斯利康新冠疫苗的不安情绪缓解 - 路透","Mars long ago was wet. You may be surprised where the water went - Reuters","Reports: Washington nabs CB William Jackson on $42M deal - Reuters","Biden says 'tough' to meet May 1 deadline for Afghanistan troop pullout - Reuters.com","Apollo-backed Sun Country Airlines jumps 38% in Nasdaq debut - Reuters","Roundup: Iowa State reportedly hires UNLV coach T.J. Otzelberger - Reuters","Lennar to spin-off businesses to become pure-play homebuilder, financial services company - Reuters UK","EU court outlaws practice of trapping birds with glue - Reuters","Iran's final report blames air defence operator error for Ukraine plane crash - Reuters","HHS to invest more than $12 billion to scale up COVID-19 testing in U.S. - Reuters","Disney's California theme parks to reopen on April 30 - Reuters","Toyota cutting some North America production this week - Reuters Canada"]},{"source":"the-american-conservative","date":1616001274605,"titles":["Washington’s Anti-Russia Fixation","What Does the Future Hold for the GOP?","Something is Rotten in the Georgia Secretary of State’s Office","This is Gen Z’s Moment","No, America Still Shouldn’t Intervene on Behalf of the Syrian Rebels","A Hollow Victory for American Workers","A ‘Never Again’ Moment, Again","Destroying What We Are Trying to Save","Reform Big Tech in a Way That Helps Small Entrepreneurs","Begin Returning to a Normal Life","The Fierce Urgency of Reopening Schools Now","How Small Colleges Can Thrive","Biden’s Judiciary: A Tower of Babel","NYT Offering a Dangerous Version of ‘Truth’ in Ethiopia","Cuomo Was Warned His COVID Group Home Policies Would Kill","The Ghost of Empires Past","COVID and the Tyranny of Comfort","Will FBI ‘Chats’ Send Conservatives to Prison?","Here’s the Deal","Mistrusted Institutions Are Pushing America into a Debt Crisis"]},{"source":"the-hill","date":1616001274711,"titles":["Biden administration invests $10b in school COVID testing program","Progressive strategist launches new group to expand digital outreach to voters of color","Wells Fargo apologizes for online banking outage amid stimulus rollout","Atlanta business leader becomes first Black chair of United Negro College Fund","Two jurors dismissed from Chauvin trial","Lawmakers warn of surge in violence against Asian Americans after Georgia shootings","Treasury says it's disbursed 90M stimulus payments under Biden's law","The Hill's 12:30 Report — Presented by Facebook — Biden's sit-down interview with George Stephanopoulos","Disney CEO says Disneyland to reopen April 30","Amazon to expand virtual health program nationwide","Senate confirms Katherine Tai as top US trade negotiator","Facebook to reduce recommendations, warn users about groups that violated platform standards","Celebrities condemn violence against Asian Americans in wake of Atlanta shootings","Top Senate Republican urges IRS to consider extending filing deadline","72 percent of Americans support new coronavirus relief law: poll","Harris tells Asian Americans 'we stand with you' after Atlanta shootings","Ford will allow 30K workers to continue to work from home post-pandemic","Kentucky moves to expand voting access in rare bipartisan push","House Republicans vote to support earmarks","Atlanta police: Too early to determine massage parlor shootings a hate crime"]},{"source":"the-huffington-post","date":1616001274576,"titles":["FLASHBACK - Joe Stack STATEMENT: Alleged Suicide Note From Austin Pilot Posted Online"]},{"source":"the-washington-post","date":1616001274649,"titles":["Why it’s a problem that kids have been deprived of play during the pandemic","House members could get a coronavirus vaccine. But a quarter of them have not.","Intel report provides striking rebuke to Trump team’s claims about China’s election interference","How a new government report strongly implicates Giuliani in a Russian interference effort","After many failures, U.S. men’s soccer aims again for Olympic berth","Washington brings back running back Lamar Miller, offensive tackle David Sharpe","’Major’ severe storm outbreak with ‘long-track, intense tornadoes’ forecast for South","Asian Americans in Atlanta stunned by shootings as advocates demand action: ‘Everyone has heard enough words’ - The Washington Post","E.U. unveils vaccine passport plan to enable summer travel","‘The Courier’ is a throwback to the kind of solid yet fun spy thriller they don’t make anymore","Report: Trump tried to get his press secretary to boot Kaitlan Collins from briefing room","Biden administration wants the finance sector to face up to climate risk","Live updates: Six Asian women among eight killed in Atlanta-area spa shootings - The Washington Post","Conrad Anker, aging patriarch of world's elite climbers, lowers his horizons...","Biden just fired a warning shot at Mitch McConnell and Republicans","Ghislaine Maxwell's tawdry fall from grace -- and new PR push...","The Trump-Tucker cold war has begun","Trump’s Florida resort touted as potential gambling destination","Robert Menendez called out Ron Johnson’s racism. The full Senate should follow suit.","Federal ‘brain drain’ threatens American scientific leadership, new report says"]},{"source":"the-washington-times","date":1616001274711,"titles":["‘Three Warfares’: U.S. pummeled by covert disinformation war waged by Russia, China","About to learn his definition of 'fair share'...","Terror suspects part of border surge...","For Biden, there's no place like a weekend home in Delaware","Pentagon goes to war with FOXNEWS over 'feminizing' military...","NEXT: Gun Control?","Obama, Bush, Clinton, Carter push COVID-19 vaccination","Jay Bhattacharya, Stanford doctor: Lockdowns 'single worst public health mistake' in last 100 years","Justice Amy Coney Barrett riles conservatives with moderate rulings...","Illegal immigrants shouldn't be included in congressional count","'It is not right': Bill offers hope that flyers of CIA's Air America will finally win recognition","'Extraordinary crisis': Democrats' revolutionary climate change bill aims to remake U.S. economy","$1,400 stimulus checks could be intercepted, consumer advocates warn","DARPA, CIA-contracted fund partner to stop China from gobbling up America's intellectual property","U.S. plans to deploy long-range missiles in Asia to deter 'our greatest strategic threat'","Portland federal officers forgotten as Pelosi eyes Congressional Gold Medal for Capitol Police","It's time to question Biden's mental health","'Almost useless' COVID-19 tests on migrants dropped in Texas town find 25% infected","Will the real president of the United States please stand up?","6 books, nix books: Dr. Seuss works halted for racist images"]},{"source":"time","date":1616001274638,"titles":["How Industrial Fishing Creates More CO2 Emissions Than Air Travel","Black Families Are Outraged About Family Separation Within the U.S. It’s Time to Listen to Them","March Madness Is Back. And It’s Going To The Supreme Court Too","March Madness Is Back. And It's Going To The Supreme Court Too","2020 Saw an Unprecedented Surge in White Supremacist Propaganda","What My Mobster Grandfather Understood About American Capitalism","Japanese Court Rules Same-Sex Marriage Ban Is ‘Unconstitutional’ – But There’s a Long Way to Go for LGBTQ Equality","N.Y. Gov. Cuomo Should Resign if Investigation Confirms Harassment Claims, President Biden Says","8 People Killed, Many of Them Asian Women, in Shootings at 3 Atlanta-Area Massage Parlors","“Ya Basta.” A New Coalition Calls on Facebook to Tackle the Spanish Misinformation Crisis","The Pandemic Made Us Strangers to Ourselves. Will We Have Learned Anything When It’s Over?","Mars Has Much More Water Than Previously Known—But There’s a Catch","London Police’s Treatment of Women at a Vigil Prompted Fury. Campaigners Say a Reckoning Is Overdue","Why Countries Around the World Are Suspending Use of AstraZeneca’s COVID-19 Vaccine","Elliot Page Is Ready for This Moment","Michelle Obama’s Wonderful Netflix Show Waffles + Mochi Is the Sesame Street of Food TV","Defense and Foreign Ministers Meet in Tokyo as the Biden Administration Makes Its First Asian Foray","LGBTQ Catholics Are Stung by the Vatican’s Rebuff of Same-Sex Unions","The COVID-19 Pandemic is the ‘Most Discriminatory Crisis’ Females Have Experienced, Says the Head of U.N. Women","The Death Toll in Myanmar’s Protests Reaches 138 as the Junta Orders Martial Law Across a Large Area of Yangon"]},{"source":"usa-today","date":1616001274636,"titles":["Don'Tale Mayes pulled from UFC on ESPN 21; Tai Tuivasa needs new opponent","Georges St-Pierre says Kamaru Usman 'raising the bar,' expounds on welterweight GOAT talk","Chelsea vs. Atletico Madrid live stream, TV channel, start time, UEFA Champions League odds, how to watch online","Suspect in Atlanta area spa shootings claims sex addiction as motive, police say","Rockets expect Christian Wood to return Wednesday vs. Warriors","Ringo Starr talks new EP, 'groovy' vaccine and finding Beatles' humor in Peter Jackson documentary","Ringo Starr on reuniting with Paul McCartney for new EP and getting the COVID vaccine","Report: Patriots will sign OL Ted Karras","Giants re-sign long snapper Casey Kreiter","Grading C Ted Karras’ deal with the New England Patriots: B-","Philadelphia Eagles rework the contract of kicker Jake Elliott","Packers create over $7 million in cap space by restructuring Za’Darius Smith’s deal","The Magic passing ability of Charlotte's LaMelo Ball has NBA buzzing","Steelers HC and GM attend Georgia pro day","FTW Explains: What is MoviePass and is it trying to make a comeback?","Former Monmouth women's basketball coach Jody Craig sends cryptic tweet after leaving job","Former longtime Seahawks coach Rusty Tillman passes away at 75","Harris: 'We stand with' Asian American community","There's been a rise in anti-Asian attacks. Here's how to be an ally to the community.","Philadelphia Eagles rework the contract of safety Rodney McLeod"]},{"source":"vice-news","date":1616001274648,"titles":["The UK Wants to Grow Its Nuclear Stockpile for the First Time in 50 Years","Mac Guy Finally Bends the Knee in Humiliating Show of Fealty to PC","Is the U.S. At Risk of a Roman Republic-Style Collapse? This Historian Says Yes.","3 beauty stylists on how to create powerful fashion imagery","Puppets and Puppets bring the world to New York for AW21","Secret Printers, Anonymous Bylines: Indian Protesters Take News Into Own Hands","Alleged Atlanta Shooter Confessed ‘Sex Addiction’ and Targeted Massage Parlors, Police Say","You're Already Cooking—Here's How to Make the Most of It","What does fashion’s obsession with the past say about its future?","‘Every Job Posting Requires Way More Experience Than I Have!’","Cars Have Your Location. This Spy Firm Wants to Sell It to the U.S. Military","How a Notorious Gang Governed Alongside a Mayor in El Salvador","Peru’s Leading Presidential Candidates Have a Lot of Sexual Hangups","One Year Without Sex, Love Or Dating","Woman Still Wondering Why Madonna Stole Her Body","Why Capcom Brought Creepy Spiders Back to Monster Hunter","Is Animating Dead Relatives with AI Cathartic or Creepy? Yes.","People With Disabilities Say This AI Tool Is Making the Web Worse for Them","Instagram is adding a bunch of new features to protect young people","How Instagram is changing the grieving process"]}]