[{"source":"abc-news","titles":["Kentucky bill criminalizing taunts against police stalls","Biden 'just fine' after tripping 3 times jogging up steps to Air Force One","Greece to reopen ancient sites despite COVID-19 surge","Suspect arrested after 100-year-old man found slain in Los Angeles home","Twitter suspends Rep. Marjorie Taylor Greene by mistake","Spa shooting victims ID'd as Biden, Harris head to Atlanta","US House condemns Myanmar coup, urges freeing of detainees","Plans solidify for 93rd Oscars: No Zoom, no sweatshirts","4 more women sue Texans QB Watson for sex assault","Slain spa worker toiled tirelessly to support her family","1 MLB player tests positive for COVID-19 in past week","5 White House staffers lose jobs over drugs, marijuana use","Amid border surge, confusion reigns over Biden policies","UK newspaper group backs working from home post-pandemic","'We're owed a March': Hoop fans flock to bet on NCAA tourney","Idaho Legislature shuts down due to COVID-19 outbreak","US prosecutors say Honduras president took bribes in 2019","Review: Lana Del Rey shifts gaze in 'Chemtrails' release","Report: DOJ investigating Visa over debit card business"]},{"source":"al-jazeera-english","titles":["US halves social distancing recommendation for schools","Turkey asks Egyptian media to limit criticism: TV channel owner","Palestinians protest Israeli police inaction amid crime wave","Names of Atlanta shooting victims released, suspect charged","Taliban expect US withdrawal in May; vow to restore Islamic rule","Judge refuses to delay Chauvin trial, jury selection nears end","‘Unacceptable’: Erdogan slams Biden over ‘killer’ Putin comment","Germany warns of vaccine shortages as new COVID wave hits Europe","Mexican president thanks Biden for COVID-19 shots loan","Two reporters detained as press crackdown intensifies in Myanmar","The US Fed is restoring capital requirement for big banks","Palestinian killed by Israeli army in West Bank","Refugee father charged with son’s death on journey to Greece","As US-Russia ties cool, Putin offers to call Biden","Hydropower projects are wreaking havoc in the Himalayas","Fire at Saudi Arabia oil facility after drone attack","In historic first, Roma included as ethnicity on UK census","China military bans Tesla cars citing camera, sensor spy concerns","Syria's medical workers are still fighting for justice","Last responders: COVID pushes end-of-life workers to the brink"]},{"source":"associated-press","titles":["Top seed out as Russian players fill St Petersburg semis","US House condemns Myanmar coup, urges freeing of detainees","Kansas lawmakers at odds over how to legalize sports betting","Plans solidify for 93rd Oscars: No Zoom, no sweatshirts","Freshmen who graduated early gain NCAA tourney experience","Alaska court finds for Native corporation in land dispute","Slain spa worker toiled tirelessly to support her family","Hospital job make Marlins prospect grateful for baseball","At long last, Ariza getting his chance to play for Heat","1 MLB player tests positive for COVID-19 in past week","UK newspaper group backs working from home post-pandemic","Indians option OF Johnson to minors despite strong camp","Amid border surge, confusion reigns over Biden policies","Celebrity Cruises to end yearlong pandemic hiatus in June","'We're owed a March': Hoop fans flock to bet on NCAA tourney","US prosecutors say Honduras president took bribes in 2019","Pass coverage model wins NFL Big Data Bowl and $10,000","The Idaho Legislature votes to recess until April 6 over COVID-19 concerns after 5 members of House test positive."]},{"source":"axios","titles":["Biden beats his COVID vaccine goal, doling out 100 millionth dose","Rethinking government bailouts amid airline industry crisis","CDC relaxes school guidance on social distancing during COVID-19","$15B SPAC deal between Apollo, Vista collapses","A full year of staggering and unprecedented job losses","Welcome to March Madness, sports betting's Super Bowl","The countries producing the most COVID-19 vaccines","The pandemic's unexpected privacy pitfalls","Panel tasked with relabeling Army bases' Confederate names gets revamp with diverse members","Scoop: Biden finalizes list of nominees for key ambassadorships","126 congressional lawmakers have reported COVID positivity or exposure","Senior Biden officials reached out to Asian American lawmakers immediately after shootings","Corporate political donations fizzle in wake of Jan. 6 insurrection","House passes bipartisan bill to grant legal status to undocumented farmworkers","Putin challenges Biden to debate after U.S. president calls Russian counterpart a \"killer\"","What we know about the victims of the Georgia shootings","House passes bill providing pathway to citizenship for Dreamers and those with Temporary Protected Status","\"We're going to keep digging\" into Capitol siege, says FBI director","Biden's multifront response to the Atlanta rampage","Appeals court reinstates conviction against Michael Flynn's former business partner"]},{"source":"breitbart-news","titles":["Apple CEO Tim Cook Boasts About His Social Justice Initiatives","Watch: Joe Biden Falls on Steps While Boarding Air Force One","Nolte: Former Cuomo Staffer Claims Governor Said He Wanted to ‘Mount’ Her","Florida Gov. Ron DeSantis: Vaccine Passports ‘Terrible Idea’; State Mandate ‘Totally off the Table’","EXCLUSIVE VIDEO: Stop Sending Migrant Children for Cartels to Abuse, Says Rep. Chip Roy","Michigan House Makes Moves to Subpoena Former Gretchen Whitmer Health Director","Belgian Bishop Rejects Vatican Ban on Blessing Gay Unions","CBO: Democrat Amnesty Bill Would Cost over $35 Billion","Iowa Senate Weighs State-Level Protections Shielding Gunmakers from Frivolous Lawsuits","TSA Screens over 1.4 Million Travelers in Single Day, over 1 Million Screened in Last 8 Days","ISIS Bride Joined Terror Group Because She 'Didn't Feel Loved as a Child'","China Celebrates Humiliating Biden Diplomats at Alaska Meeting","Tokyo Olympics Ready to Announce Ban on Fans from Abroad","Fauci: Rand Paul ‘Dead Wrong’ on Efficacy of Masks After Vaccination","‘Biden Should Be Ashamed’: GOP Says Border Crisis Feeding Child Sex Trafficking","No Coachella in 2021: Music Festival Pushed Back for One Year","China Will Provide Vaccines for Tokyo, Beijing Olympics Athletes","Rand Paul: ‘Not a Great Deal of Evidence’ Mask Mandates, Shutdowns Helped","‘Zack Snyder’s Justice League’ Review: A Really Long Superhero Movie","Laos Gives Chinese Firm 25-Year Concession to Manage Power Grid"]},{"source":"cbs-news","titles":["FedEx driver's last hours before deadly Calif. crash scrutinized","Mother-daughter duo raise $1.2M in scholarships for people with Down syndrome","Kansas City shooting suspect preached white supremacist message","Pro-Russian activists storm Ukraine police headquarters","Mother reflects on son, dad killed near Kansas City","Consumers eyeing dressier fashion styles again as sweatpants evoke lockdown","Watch: Dash cam catches roadside gun battle","Family of Kan. shooting victims speak out","Emerson Hart of Tonic on new solo album","$6 million bail set for Utah woman accused of killing 6 newborns","Harsh winter could trigger tough allergy season","Emerson Hart performs \"The Best That I Can Give\"","Neighbors \"shocked\" by news of Utah mom killing 6 newborns","British photographer assaulted in Ukraine","Federal officials seek to charge alleged Kansas shooter with hate crime","Fla. daycare hit-and-run suspect speaks out in hearing","Police arrest woman after finding 7 dead babies in Utah home","Airbnb CEO on company's new focus on hospitality","New Florida invasive species is a 10-foot-long river monster","Airbnb CEO Brian Chesky on the best advice he's ever gotten"]},{"source":"cnn","titles":["بعد تأكيد عدم ارتباطه بجلطات الدم.. ميركل تعلن أنها ستحصل على لقاح أسترازينيكا","Why the 911 will be last the Porsche model to go electric","House Minority Leader McCarthy found out he had Covid-19 and didn't know it","US Ambassador to UN Linda Thomas-Greenfield says 'we need to dismantle White supremacy' and unite against racism","Two more Proud Boys indicted for Capitol riot as prosecutors detail evidence of planning","سانجاي غوبتا يصدم مذيعي CNN بأغنية راب عن فيروس كورونا.. شاهد \"الأداء الناري\"","Expect spring to be even drier out west, says NOAA","'What century am I in?': SE Cupp questions GOP strategy","توب 5: هجوم مصفاة النفط بالسعودية.. وجدل حول قنوات معارضة لمصر في تركيا","Running to replace husband who died from Covid-19, Julia Letlow hopes to bring her own experience to Congress","Fallas en WhatsApp, Instagram y Facebook: usuarios reportan problemas","White House says Biden is '100% fine' after he tripped boarding Air Force One","Biden and Harris travel to Atlanta to meet with Asian American leaders in wake of mass shooting","شاهد.. لحظة تعثر بايدن أكثر من مرة أثناء صعوده إلى طائرته الرئاسية","عطل يضرب خدمات واتساب وانستغرام وفيسبوك ماسنجر","Sharon Stone says she was misled about explicit interrogation scene in 'Basic Instinct' -- Vanity Fair","A $5 billion down payment on what America owes to Black farmers","King: This is 'game-changing' in the back-to-school debate","No hay evidencia de que la vacuna de AstraZeneca cause coágulos de sangre, dice la comisión de seguridad de vacunas de la OMS","French artist JR unveils a monumental new optical illusion installation in Italy"]},{"source":"fox-news","titles":["Why coronavirus-related delays in cancer screenings are concerning, according to experts","Paulina Porizkova gets candid about anti-aging laser treatment: 'I'm vain and want to be pretty'","JuJu Smith-Schuster re-signs with Steelers on 1-year deal: reports","Biden is president 'in name only' based on admin's left-wing agenda: Hilton","Even Anna Wintour couldn’t save Alexi McCammond from cancel culture: report","Vermont man reunited with car stuck at Canadian airport for a year under lockdown","Biden White House says it's ready to have 'frank conversation' with China","Texans add third quarterback amid Deshaun Watson controversy: report","WV man arrested in murder of 7-year-old with hammer: 'Just lost it'","'Holy grail' 1967 Chevrolet Corvette L88 worth millions up for auction","Biden admin under fire over lack of transparency on border crisis","ISS crew relocates Soyuz MS-17 spacecraft","Pelosi says Marjorie Taylor Greene expulsion not endorsed by top Dems","Yumi Nu becomes Sports Illustrated Swimsuit’s first Asian curve model: She ‘is gracefully unapologetic’","Coronavirus herd immunity possible in this state by July, health official says","Texas police officer won't face charges in fatal shooting of unarmed college student","Pelosi says Biden has southern border situation 'under control'","Deshaun Watson's agent responds to sex assault allegations against client after 7 lawsuits filed","NCAA under fire for differences in swag bags at men's and women's tournaments","Georgia sheriff who said shooting suspect 'had a really bad day' is replaced as case spokesperson"]},{"source":"google-news","titles":["Una cuestión de perspectiva cósmica","The Hidden Dungeon Only I Can Enter - Episode 11 - Noir's Decision","【東南亞週報】泰訓練嗅探犬偵測武漢肺炎｜菲國檢出新變種病毒「P.3」｜緬甸文人領袖號召革命推翻軍政權","SXSW 2021: a democracia vai sobreviver às fakes news, mas gigantes da tecnologia precisam colaborar","Producer’s Best Friend 1.4.45 - Create Final Cut Pro X project reports. (Commercial)","With a Dog AND a Cat, Every Day is Fun - Episode 23 - Untitled","Wastewater surveillance for COVID-19 | COVID-19 Special - DW News","545 - Cobra Kai: Card Fighter, Dungeon of the Endless: Apogee","One of Our Favorite Ice Cream Makers Is on Sale Right Now (and It’s Perfect for Frosé!)","JUJUTSU KAISEN - Episode 23 - The Origin of Blind Obedience - 2 -","Названа самая счастливая страна в мире - Lenta.ru","This 2-in-1 Tool Is a Broom and a Vacuum (of Course I Had to Try it for Myself)","Miden por vez primera potentes vientos estratosféricos en Júpiter","What’s the deal with NFTs?","Primer robot colaborativo que trabaja con vehículos en movimiento","Are Kids Who Abuse Animals Destined to Become Serial Killers?"]},{"source":"msnbc","titles":["'Science is back': Biden thanks CDC for efforts amid Covid pandemic","Fulton County releases names of Atlanta spa shooting victims","CDC director explains why schools can now social distance at 3 feet","‘His death will not be in vain’: Baton Rouge nurse on helping others get vaccinated after losing husband to Covid-19","Medical examiner release names of remaining 4 Atlanta spa victims","Why it matters that Team Trump lied about China, election interference","NCAA acknowledges difference in amenities at men's and women's tournaments","Judge rules Derek Chauvin trial will not be delayed or moved","'Here we go again': Rand Paul clashes with Fauci (for the 4th time)","NIH director weighs in on ethical, theological concerns around genome editing","NBC News exclusive: Allen Weisselberg's former daughter-in-law speaks out","What police know about some of the victims in deadly spa shootings","We've had the same immigration debate for 30 years. Enough.","A special brand of hypocrisy defines the GOP, and Biden's Covid aid bill proves it","Disastrous Trump Covid response runs deeper than mere mismanagement","'It's a flu, it ain't a Covid!' How to fight vaccine hesitancy","Intel report shows exact opposite of Trump officials' claims on China election intrusion","Baratunde: 'Grotesque' to call lynching a form of justice","Rep. Meng: Asian American community has ‘been screaming out for help’","‘I am not a virus’: Rep. Lieu tells GOP to stop using racist terms"]},{"source":"national-review","titles":["Feinstein Still Supports the Filibuster","The EU Failure Is Personal","George W. Bush Says Capitol Riots Made Him ‘Sick to My Stomach’","Meijer of Michigan","A Skeptic on the Value of Government","Now, It’s the ‘Rights of the Moon’","No, Michael Mann Isn’t Going to Ruin National Review","Media Won’t Care That Joe Biden Fell Down the Stairs Because He Isn’t Donald Trump","No, Vaccinations Do Not ‘Inspire More and More Mutations’","From ‘Court-Packing’ to ‘Filibuster Abuse’","SF School Board Member Accused Asians of Using ‘White Supremacy’ to ‘Get Ahead’","What the Fed Really Said","National Review Prevails against Michael Mann","Biden Falls Walking Up Steps to Air Force One","Manchin: Congress Should Fix COVID Bill’s Abortion Problem in Annual Spending Bill","Today in Cancellation","About That Rand Paul–Dr. Fauci Exchange","Cuomo Admin Leaked Sexual Harassment Accuser’s Personnel File to Press: Report","CDC Director: Oh, Wait, Never Mind, Three Feet of Distance in Schools Is Fine Again","CDC Changes School Social Distancing Requirements From 6 to 3 feet"]},{"source":"nbc-news","titles":["Five staffers fired over marijuana use, White House says","'She was a big kid': Son of Hyun Jung Grant, killed in Atlanta shootings, recalls last moment they spent together","Biden hit his first vaccination milestone today. This is how the numbers break down.","Venezuelans apply for TPS, a game changer for undocumented asylum-seekers","'Not happening': Prospects dim for Capitol riot commission","'The Conners' crew member dies after on-set medical event","Texas museum removes Trump wax figure after visitors kept attacking it","Man charged in Grindr attack planned to kidnap, kill other gay men, DOJ says","Michigan restaurant owner arrested after defying Covid-19 orders, attorney general says","California town pays people to visit (Part 2)","California town pays people to visit (Part 1)","Man arrested after two Asians are assaulted in San Francisco","Democratic congressman moves to expel Marjorie Taylor Greene from Congress","Watch: Biden stumbles as he boards Air Force One","Man suspected of drawing swastika in snow outside historic New York temple arrested","Louisville police officer files lawsuit accusing department of bias, discrimination","Mourners gather for Atlanta vigil to remember spa shooting victims","Names of remaining four victims in Atlanta-area spa shootings released","How 'Keeping Up With the Kardashians' changed female body image","Biden picks former senator who flew in space to lead NASA"]},{"source":"newsweek","titles":["Bitcoin Surges Despite Being Called a 'Particularly Vile Asset Class'","As D.C. GOP Blasts Biden's Immigration Policies, Poll Shows Majority of Americans Also Disapprove","Biden Trips and Falls, White House Blames Wind","Maskless Woman Kicks Sign After Demanding She be Served at Coffee Shop","WhatsApp, Facebook and Instagram, 3 of 4 Top Social Media Platforms, Not Working Worldwide","'Destiny 2' Xur Inventory and Location March 19: Trinity Ghoul and Sanguine Alchemy","Birds Aren't Real Movement Calls Newsweek's Story 'Blasphemous' Vows to Uncover 'Avian Genocide'","Marjorie Taylor Greene Says Expulsion Effort Is Because She's Democrats' 'Greatest Threat'","Long-Shot Recall Effort for Louisiana Governor Fails With Less Than 30K Signatures","Biden to Talk to Putin 'At Some Point' After Russian Leader Challenges Him to Live Talks","Pramila Jayapal Says Republicans Put 'Target…on Our Backs' by Using 'Racist Terminology'","Spectacular NASA Images Show Seasons Changing on Saturn","I Survived a Terror Attack. After 2020, America Needs Mental Health Care | Opinion","Gibraltar Vaccinates Entire Adult Population in 9 Weeks Thanks to Supplies From the U.K.","Flexispot Comhar EG8 Review: An Affordable Standing Desk","Arizona Border Town Lacks Sufficient Transportation to Handle Migrant Surge, Mayor Says","As Hunter Biden FBI Probe Rolls on, Laptop Story Resurfaces After U.S. Claims About Russia","Dillan Homol, Man Who Livestreamed Capitol Riot, Charged as Former Classmates Tip off FBI","The Dangerous Privilege of Yellow Fever | Opinion","We're Sacrificing Children's Lives to Endless Lockdown | Opinion"]},{"source":"new-york-magazine","titles":["Lindsey Boylan Says Cuomo Had Dartboard With Photo of de Blasio","The Fake Feminists Fighting the Equality Act","Democrats Advance Citizenship for 3.5 Million Immigrants","Trump’s Lackeys Are Teaming Up Again With Putin to Mock Biden","Is Complaining About ‘Cancel Culture’ the New Ideology of the Republican Party?","The First U.S. Meeting With China Under Biden Didn’t Go So Smoothly","When Domestic-Violence Prevention Collides With the Religion of Guns","Fed to Biden: The Money Printer’s Still Got Plenty of Ink","Becerra Confirmed as HHS Secretary in Closest Vote Yet","Andrew Yang’s Plan to Fight Hate Crimes Makes Asian Activists Cringe","GOP Rep: I Didn’t Intend to Blame Jews for the Space-Laser Conspiracy","These Are the Victims of the Atlanta Spa Shootings","Are the Atlanta Killings a Hate Crime? The Suspect Doesn’t Get to Decide.","Lindsey Boylan: I Won’t Participate in ‘Sham’ Cuomo Impeachment Probe","The Message From the Heart of the Atlanta Attacks: ‘America Is Getting Worse’","Democrats Need to Move Fast and Fix Things","On the Front Lines of the Surge in Violence Against Asian Americans","Official Who Said Spa Shooter Had ‘Bad Day’ Shared Anti-Asian COVID Shirt","The House Brings Back the Equal Rights Amendment","Could the Atlanta Spa Shootings Break Congress’s Gun Control Impasse?"]},{"source":"politico","titles":["Trudeau 'confident' 2 detained Canadians will be discussed in U.S.-China talks","Federal judge pens dissent slamming decades-old press protections","'In the dark of night': Trump's Interior chief snuck Murkowski an 11th-hour win","Rep. Tom Reed accused of sexual misconduct on 2017 trip","Proud Boys leaders facing new conspiracy charges related to Jan. 6 Capitol riot","Biden hints at new vaccination target","Nelson wins bipartisan praise in bid for top NASA job","Psaki says few White House staffers ousted due to marijuana policy","Twitter locks Marjorie Taylor Greene out of her account — again","CDC cuts school distancing requirements to 3 feet","Georgia lawmaker set to meet with Biden wants shootings investigated as hate crimes","Collins opposes top Pentagon nominee, narrowing confirmation path","Judge refuses to delay, move trial of ex-cop in Floyd death","One-on-one with Biden ally and tech leader Chris Coons - Politico","‘He’s dead wrong’: Fauci and Paul trade TV barbs after sparring on the Hill","BECERRA confirmed, who’s next for AG? — ED BOARD approves ETHNIC STUDIES — GIG wars to CONNECTICUT — GOOGLE’s big investment","Capitol Hill confronts anti-Asian rhetoric","CENSURE FOR STATE REP. MILLER — RAOUL’s GETTING THE VAX — LIGHTFOOT’s PANDEMIC YEAR","Austin meets with India’s Modi as U.S.-China summit gets off to rocky start","The virtual ST. PATRICK’S DAY BREAKFAST — LAWMAKERS push for more VAX DISTRIBUTION — LEGISLATURE passes CLIMATE BILL"]},{"source":"reddit-r-all","titles":["Show HN: R/shouldibuythisproduct because Amazon reviews is broken","GraphWrap: extend your Django REST Framework API with a GraphQL interface with just two of lines of code. : django","My recommendation to learn Django : django","Piracy, Overcoming Gravity, and the Digital Edition","Has Y Combinator lost its way when the latest company is a Mac only widget?","My bank sent me 64 copies of the same debit card","Join David Borenstein for a reddit AMA at 2:30 p.m. ET to discuss his film on the price of being a social media star in China","YouTube doesn't handle space anymore","Florida is suffering from an epidemic of bald men renting billboards that need to be extended in order to fit their bald heads.","Django admin looks dated and is not mobile friendly, any better options ? : django","Reddit: Online Presence Indicators","Namecheap just snaked another domain off me","Any open source DRF projects? : django","I want this guy working on the unit tests : ProgrammerHumor","Protest note about user privacy changes by Reddit","What virtual environment system do you use for your Django projects and why? (venv, pipenv, pyenv, etc ) : django","In the 90s part of Germany's air traffic control software ran on Emacs"]},{"source":"reuters","titles":["U.S. DOJ accuses Google of dragging its feet in antitrust trial - Reuters","EMERGING MARKETS-Latam FX firm, Pemex move puts Mexico's credit rating in focus - Reuters","U.S. to give more than $80 million in humanitarian aid to countries in Sahel region: State Dept - Reuters","EU sustainable finance advisers say green means green - Reuters","Merkel says it was right to be transparent about AstraZeneca vaccine - Reuters","Mixed Martial Arts: UFC bout cancelled after fighter faints at weigh-in - Reuters","Gategroup says debt revamp wins creditor backing - Reuters","COVID-19 strikes Brazil's Congress as third senator dies - Reuters UK","More than 1,000 Myanmar refugees seeking shelter in India's Mizoram state: lawmaker - Reuters","Nigerian designer uses Aso-oke fabric for new fashion - Reuters","Merkel says 'our motto is 'vaccinate, vaccinate, vaccinate' - Reuters","Queen thanks volunteers for helping Britain through the pandemic - Reuters Canada","Mexican judge halts electricity law, as president says top court should rule - Reuters","U.S. financial regulator advisers consider new diversity disclosures - Reuters","Facebook faces antitrust investigation by UK regulator: FT - Reuters","U.S. yields ease from 14-month highs, oil bounces back - Reuters","Explainer: What rising bond yields mean for markets - Reuters","Facebook services down for thousands of users: Downdetector - Reuters"]},{"source":"the-american-conservative","titles":["In Memoriam: Richard Driehaus","Romney Says America’s Leadership is Too Old to Take on China","To Flee or Not To Flee","Two Centuries of ‘That Blackguard Burton’","Twilight of the European Nationalists?","The Uses and Abuses of ‘Woke Capital’","Get Him Outta Here","The Other Deficit","The Right Can Win in States","Washington’s Anti-Russia Fixation","What Does the Future Hold for the GOP?","Something is Rotten in the Georgia Secretary of State’s Office","This is Gen Z’s Moment","No, America Still Shouldn’t Intervene on Behalf of the Syrian Rebels","A Hollow Victory for American Workers","A ‘Never Again’ Moment, Again","Destroying What We Are Trying to Save","Reform Big Tech in a Way That Helps Small Entrepreneurs","Begin Returning to a Normal Life","The Fierce Urgency of Reopening Schools Now"]},{"source":"the-hill","titles":["Clyburn rails against filibuster on House floor","GOP Rep. Tom Reed accused of sexual misconduct","Wife of FBI Task Force member arrested in connection with Capitol riot","Ocasio-Cortez, Warren introduce bill to put $500 billion toward electric public transit","Surging COVID-19 cases in Europe, Brazil signal warning for US","Teen Vogue executive editor Samhita Mukhopadhyay resigns","Taliban warn of 'reaction' if US doesn't withdraw by May deadline","NCAA says it 'fell short' after criticism of men's vs. women's facilities","Biden to reinstate accountability measures stripped by Trump","Senators call on Biden to officially recognize Armenian Genocide","Biden '100 percent' fine after stumble on Air Force One steps, aide says","Collins opposes Pentagon policy nominee","Greene's office says Twitter suspended her account a second time","Texas restaurant owner creates $50 surcharge for customers asked to wear a mask","Gottlieb: CDC should be evaluating COVID-19 variants not mandating distancing","The Hill's 12:30 Report — Presented by Facebook — CDC updates guidelines for students","North Carolina police say gun seized in drug bust altered to look like Nerf toy","Arizona state senator announces bid for Kirkpatrick's seat","White House defends marijuana policy after report of staffers targeted for past use","Biden says he's proud of secretary of State after confrontation with China"]},{"source":"the-huffington-post","titles":[]},{"source":"the-washington-post","titles":["Goodbye winter, hello spring: The equinox arrives Saturday morning","Biden has a golden opportunity to change how we approach marijuana","How to spot a fake video","Their Uyghur relatives are imprisoned in China. From Virginia, they plead for help.","News orgs cite Biden administration opacity on border stories","Sharon Jones & The Dap Kings, ’100 Days, 100 Nights’: The Week In One Song","The questions surrounding Nationals third baseman Carter Kieboom","Washington’s last spring freeze is coming earlier, and so are the 70s","The Biden administration’s struggles on its border message echoes what happened on schools","The losing fight to keep marijuana smokers out of federal government","The Biden administration gets a taste of China's 'wolf warrior' diplomacy","AstraZeneca vaccinations resume in Europe, but skepticism may linger","White House appoints former NOAA leader Jane Lubchenco to key climate change role","Vaccine studies are expanding. That's good news for children, pregnant women and those over 65.","These D.C. bars let you enjoy March Madness while social distancing outdoors","Former lobbyist accuses Rep. Tom Reed, a potential Cuomo challenger, of sexual misconduct - The Washington Post","J.D. Vance’s Senate hopes reveal the problem with performative populism","Documentaries changing public opinion about celebs -- with consequences even filmmakers didn't expect...","Yes, vaccine skepticism exists among health-care workers — but far less so among top medical professionals","An open letter: Save voting rights, pass bills — and keep your filibuster"]},{"source":"the-washington-times","titles":["Ousted NEW YORK TIMES reporter slams newsroom's culture: 'Mean, spiteful, vengeful place'...","‘Three Warfares’: U.S. pummeled by covert disinformation war waged by Russia, China","About to learn his definition of 'fair share'...","Terror suspects part of border surge...","For Biden, there's no place like a weekend home in Delaware","Pentagon goes to war with FOXNEWS over 'feminizing' military...","NEXT: Gun Control?","Obama, Bush, Clinton, Carter push COVID-19 vaccination","Jay Bhattacharya, Stanford doctor: Lockdowns 'single worst public health mistake' in last 100 years","Justice Amy Coney Barrett riles conservatives with moderate rulings...","Illegal immigrants shouldn't be included in congressional count","'It is not right': Bill offers hope that flyers of CIA's Air America will finally win recognition","'Extraordinary crisis': Democrats' revolutionary climate change bill aims to remake U.S. economy","$1,400 stimulus checks could be intercepted, consumer advocates warn","DARPA, CIA-contracted fund partner to stop China from gobbling up America's intellectual property","U.S. plans to deploy long-range missiles in Asia to deter 'our greatest strategic threat'","Portland federal officers forgotten as Pelosi eyes Congressional Gold Medal for Capitol Police","It's time to question Biden's mental health","'Almost useless' COVID-19 tests on migrants dropped in Texas town find 25% infected","Will the real president of the United States please stand up?"]},{"source":"time","titles":["For Asians Living the Shadow of the Atlanta Killings, Anger and ‘Just This Constant Fear’","Mads Mikkelson Can Do Anything. But He’s Stuck in the Boring Oscar-Nominated Another Round","‘It Is Dangerous To Speak Up In India Today.’ What the Resignations of 2 Academics Show About Freedom of Expression Under Modi","Israel’s COVID-19 Vaccination Rollout Is Slowing at a Critical Moment. That’s a Warning for the Rest of Us","How Whitney Wolfe Herd Turned a Vision of a Better Internet Into a Billion-Dollar Brand","American Democracy Can’t Survive Unless the Far Right Is Marginalized. Here’s How to Do It","Facebook Is Building ‘Instagram Kids’ for Children Under 13","The House Passes Two Immigration Bills. But Will Broader Immigration Reform Be Possible?","Biden Administration’s First U.S.-China Meeting Quickly Descends Into Bickering","Everything You Need to Know About The Falcon and the Winter Soldier","The Story Behind TIME’s Cover on Anti-Asian Violence and Hate Crimes","Autopsy Reveals Casey Goodson Jr., Black Man Killed by Ohio Sheriff’s Deputy, Was Shot Five Times From Behind","Digital NFT Art Is Booming—But at What Cost?","‘This Isn’t Just a Problem for North America.’ The Atlanta Shooting Highlights the Painful Reality of Rising Anti-Asian Violence Around the World","Listen to the Sounds of NASA’s Perseverance Rover Driving on Mars","The Atlanta Shooter Killed Six Women of Asian Descent. Isn’t That A Hate Crime?","What to Know About Children’s Author Roald Dahl’s Controversial Legacy","I’m Vaccinated Against COVID-19, But My Kids Aren’t. What’s Safe for Us?","‘The Military Is Terrorizing Us Day and Night.’ The Human Rights Activist Documenting Horror in Myanmar","A San Francisco Experiment Will Give Some Pregnant Women $1,000 a Month. Could Other Cities Be Next?"]},{"source":"usa-today","titles":["Photos: UFC 259 official weigh-ins and faceoffs","An Arkansas player fired off a perfect football snap for a wild no-look assist","Not harping on past losses, Marion Reneau just focused on winning at UFC on ESPN 21","The best Easter 2021 deals you can shop at Amazon right now","(8) Loyola Chicago vs. (9) Georgia Tech live stream, NCAA March Madness, TV channel, how to watch","Facebook working to restore service after outages affect products including Instagram, Whatsapp","WATCH: Why are the Boston Celtics having a hard time closing out games?","Video: Kevin Holland jaws at, embraces reluctant Derek Brunson during UFC on ESPN 21 faceoff","Matthew Stafford welcomes pressure of taking Rams to Super Bowl","15 top-rated women's activewear you can buy at Nordstrom","Florida guard Tyree Appleby helped off court after nasty elbow against Virginia Tech","We now know the names of all 8 people killed in the Atlanta area spa shootings. Here's who they are.","Meet the technological device that may keep the NCAA tournaments going","Dan Campbell on Jared Goff: “You don’t have to be a savior here’","Falcons sign S Erik Harris, LB Brandon Copeland to 1-year deals","Report: NFL teams still interested in trading for Texans QB Deshaun Watson","The best remaining NFL free agents for 2021","JuJu Smith-Schuster uses the 'Wolf of Wall Street' to announce his return to Steelers","Should LeBron James have more MVP awards? Yes, but it's complicated","Steven Nelson’s days seem to be numbered with the Steelers"]},{"source":"vice-news","titles":["Atlanta Shooting Suspect’s Church Bashed ‘Radical Feminism’ in Deleted Sermons","Please Stop Using Dating Shows to Embarrass Black Women","A Woman Set Up a GoFundMe to Help Harry and Meghan Pay for Their $14M House","Oklou just remixed Bladee and Mechatok’s Rainbow","Free money and Loewe eco-chic: What’s in fashion?","Police Spies Told a Minister Where Left-Wing Trade Unionists Go on Holiday","Working at Goldman Sachs Suuuucks, Leaked Internal Survey Shows","The Alleged Atlanta Shooter’s Church Is Kicking Him Out","How the 'Loop Hero' Devs Pitched a Hit Game That's Impossible to Describe","Anti-Asian Twitter Hashtags Spiked After Trump Called COVID the ‘Chinese Virus’","Gay art documentaries and Kim Kardashian: what i-D loved this week","A GOP House Member Fondly Remembers Lynching During Anti-Asian Violence Hearing","The Kimbino is the fashion researcher hosting tutorials on OnlyFans","Trump Official Charged In Capitol Riot Has Family Ties to Argentina’s Military Junta","Twitter Kicked Out Marjorie Taylor Greene Before Congress Got a Chance","How to Turn Your Home Into Flavortown","Vegyn’s new EP is club music for people who secretly hate clubs","Benny the Butcher and Harry Fraud Connect on ‘The Plugs I Met 2’","EDM Itu Genre Musik Betulan Sob, Bukan Cuma Istilah Marketing Promotor Musik","How Those Viral Tom Cruise Deepfakes Were Made"]}]