[{"source":"abc-news","titles":["Germany: Theology professors blast Vatican gay union stance","Microsoft to start bringing workers back to headquarters","Fed's Powell: Public should understand risks of Bitcoin","Elton John opens his Oscar night party to all this year","Germany looks set to extend virus lockdown measures again","Police: Embattled NYPD officer fired gun at Atlantic Ocean","Search underway for college freshman reported missing by family","Uber driver allegedly tries to kidnap passenger","Head of Slovakia party resigns over crisis around Sputnik V","BoxLunch Is On the Fast Track to Fun with New Collection Dedicated to Mickey & Minnie’s Runaway Railway at Walt Disney World Resort","White House officials to visit Mexico, Guatemala to address root cause of migrant surge","US officials to hold talks in Mexico on migration","German government welcomes probe into virus protest policing","Cabinet formation talks in Lebanon collapse amid crisis","Trump endorses challenger against Georgia elections chief","Shooting victim's husband says police detained him for hours","Ikea France on trial over claims it spied on staff, clients","USS Constitution honors 1st female chief petty officer"]},{"source":"al-jazeera-english","titles":["Tax the rich: Will Biden make good on his campaign promise?","Saudi Arabia proposes ceasefire plan to Yemen’s Houthi rebels","Israel election: Can Benjamin Netanyahu prevail again?","Are you exhausted? Want to quit your job? You’re so not alone","Mexico dispatches troops to southern border to rein in migrants","US senators urge Biden to set end date for gas-powered car sales","‘Some stay, some die’: The horror of Ukraine’s war camps","EU sanctions Chinese officials over Uighur abuses","Spy-kea? Ikea France goes on trial over claims it spied on staff","US Supreme Court to weigh reimposing Boston bomber death sentence","How the COVID-19 pandemic is affecting mental health","Espionage trial concludes for second Canadian detained in China","UK: What is the Police, Crime, Sentencing and Courts Bill?","Will latest push for accountability for Syria torture succeed?","Israel revokes permit of Palestinian foreign minister","Restoring the right to breathe: Migration detention must end","Algeria issues 'terrorism' warrants for exiled activists","COVID-19: The patriarchal pandemic","Venezuela announces 'radical quarantine' amid coronavirus surge","Taiwan loses two fighter jets in apparent collision"]},{"source":"associated-press","titles":["Pennsylvania lawmaker in hospital after motorcycle accident","Head of Slovakia party resigns over crisis around Sputnik V","North Dakota bumps budget due to faith in oil outlook","Microsoft to start bringing workers back to headquarters","Lawyer Lee Merritt says he'll run for Texas attorney general","Gov. Kemp signs modest state income tax cut into law","German government welcomes probe into virus protest policing","Bill to aid publishers vs. FACEBOOKGOOGLE rises again...","MIAMI BEACH MOVES TO SHUT DOWN SPRING BREAK","State offers students free help applying for financial aid","USS Constitution honors 1st female chief petty officer","Shooting victim's husband says police detained him for hours","El Salvador to commemorate surfer hit by lightning","Kingdom offers cease-fire plan to Yemen rebels...","No basement blues: Goodell on hand for draft in Cleveland","Trump endorses challenger against Georgia elections chief","Court could reimpose Boston Marathon bomber's death sentence - Associated Press","Existing US home sales fell in February while prices rose","Kehoe won't pursue Senate but will run for governor in 2024","Hawaii reduces welfare payments to about 6,700 residents"]},{"source":"axios","titles":["Biden officials travel to Mexico and Guatemala for border surge solutions","Trump says removing filibuster would be \"catastrophic for the Republican Party\"","EU sanctions 4 Chinese officials for mass detention of Uyghur Muslims","Alaska talks reveal the tense relationship between U.S. and China on climate change","Investor psychology is shifting to risk in a big way","Private equity giant Leon Black quits Apollo completely after Epstein investigation","Inside a crowded border patrol tent for migrants in Texas","Biden's next challenge: Vaccine diplomacy","U.S. trial finds AstraZeneca vaccine 79% effective with no serious side effects","Big Tech taps libertarian lifeline in D.C.","YouTube star David Dobrik is stepping away from photo app Dispo","In photos: Thousands evacuated in Australia as flood threat worsens amid relentless heavy rains","\"Sorry\": Rep. Tom Reed announces retirement after sexual misconduct claim","Rio Grande Valley border patrol releasing migrants without court date","Scoop: Nearly 1,000 kids held by border patrol for more than 10 days","Evidence indicates sedition charges likely over Capitol riots, prosecutor says","McCarthy hires top Trump official to run political operation","Inside the Democrats' strategy to bombard Big Tech - Axios","Republicans look for ways to attack Biden’s COVID-19 stimulus despite its popularity","Israelis retaliate against Palestinian leader after push for investigation"]},{"source":"breitbart-news","titles":["Texas, Florida Report Fewer Coronavirus Cases than Blue State New York Despite No Mask Mandates","Vax Wars: UK Will Have ‘No Choice’ But to Block Vaccine Exports if EU Halts Deliveries to Britain","Miami Beach Declares State of Emergency Due to Spring Breakers, Imposes Curfew, Closes Causeways","CBP Admits Release of Migrant Families Without Court Date, Downplays as Normal","Donald Trump: 'Very Bad Hombres' Again Crossing the Border Under Joe Biden","Children’s Book Celebrates How Dr. Fauci ‘Became America’s Doctor’","Sen. Bill Hagerty: Biden Pentagon Nominee Colin Kahl May Have Knowingly Leaked Classified Information","Leaked Photos Reveal Biden’s Detention Cells for Migrant Children on Border","Exclusive — Rep. Greg Murphy: Move National Guard to ‘Crisis at Our Border’","James O’Keefe Releases Photos of Border Facility, Taunts Jen Psaki for Denying Media Access","NFL Planning ‘Large, Live, In-Person’ Draft in Cleveland","Border Crisis Overshadows Biden Effort to Sell Coronavirus Spending Bill","McCabe: ‘Kind of Shocked’ Capitol Rioters Haven’t Been Charged with Sedition Already","Meghan Wins? Queen May Appoint ‘Diversity Chief’ After Racism Row","San Francisco Leaders Demand School Board Member Resign over 2016 Tweets Saying Asian Americans Not Woke Enough","‘Emergency Brake’ – Merkel’s Germany to Extend and Tighten Lockdown Restrictions","Macron Govt Scraps a Lockdown Travel Certificate Within Hours After It Was Mocked for Needless Complexity","WATCH: Anarchy in the UK Leftist Mob Torches Police Vans, Attacks Officers in Chaotic Bristol Protest","Ikea France, Execs on Trial for Illegally Spying on Customers and Staff","‘Racism Is a Feature of Capitalism’ Claims Labour MP Zarah Sultana"]},{"source":"cbs-news","titles":["Trump backs GOP challenger to Georgia secretary of state","Israeli airstrikes hit Hamas targets after rocket attacks","Hurricane Arthur to make heavy impact on North Carolina","MoneyWatch: June jobs report; Target asks customers to leave guns at home","Nearly all Alzheimer's drugs fail, researchers say; Walking may help Parkinson's","Country star Jewel getting a divorce; Lindsay Lohan files suit","Wearable tech for pets? Health monitoring is not just for humans anymore","Palestinian leaders believe teen was killed by Israelis in retaliation","7/2: Threatening coast, Tropical Storm Arthur nears hurricane intensity; Family, friends reflect on legacy of KKK murder victim","Family, friends reflect on legacy of KKK murder victim","Threatening coast, Tropical Storm Arthur nears hurricane intensity","What will happen to the immigrants turned away by protestors?","Who is the mysterious leader of ISIS?","Iraqi Kurds plan vote for independence","Airport security increased due to new terrorism threat","Hong Kong police arrest hundreds in pro-democracy protest","Benghazi suspect said to have \"supervised exploitation of material\"","Remembering George Smith","Turkish police conduct shipboard interview after passenger disappears","Greg Rozenberg questioned about Smith disappearance"]},{"source":"cnn","titles":["الحريري يرفض اقتراح عون: ليس من صلاحية الرئيس تشكيل الحكومة وسأحتفظ برسالته لـ\"التاريخ\"","\"تحدي 1\".. إطلاق “أول قمر صناعي تونسي إلى الفضاء","\"تحدي 1\".. إطلاق أول قمر صناعي تونسي إلى الفضاء","Wall Street's hot new bet: Betting on sports","بينها قناع ذهبي عمره 3000 عام.. العثور على قطع أثرية نادرة في الصين","McConnell describes legislative filibuster as 'Kentucky's veto'","Giant pandas 'on top form' mated 'multiple times' in French zoo","El problema de inmigración en la frontera sur de Estados Unidos tomó desprevenido al equipo de Biden y así están luchando para solucionarlo","Saber para vivir: la importancia de la detección temprana del cáncer de mama","The Jillian Michaels Fitness App is a practical way to bring a personal trainer to your at-home workouts","Saudi Arabia announces new ceasefire offer to end Yemen war","Democratic Rep. Filemon Vela says he will not run for reelection","الحوثيون ردا على المبادرة السعودية: هروب إلى الأمام وعليها أن توقف العدوان على اليمن","Aguas de nadie: buscan ponerle un freno global a la depredación en los océanos","Kylie Jenner faces backlash for promoting friend's GoFundMe","Biden officials traveling to Mexico amid surge of unaccompanied minors","الحكومة اليمنية ترحب بالمبادرة السعودية لإنهاء الحرب وتذكر بموقف الحوثيين من سابقاتها","Goldman Sachs: Biden's tax hikes won't be as big as he wants","See how vaccine hesitant GOP participants react to Covid-19 focus group"]},{"source":"fox-news","titles":["Chicago crime: 25 shot, including 10-year-old boy and police officer, during weekend bloodshed","Emily Mortimer plagiarized from Atlantic piece for New York Times book article","Case of Brazilian coronavirus variant detected in Utah for first time, CDC data shows","Garland taps new official to lead US attorneys after Trump-era lawyers asked to resign","Joanna Gaines opens up about the racism her Korean mother experienced","2 Massachusetts hikers found dead after falling 100 feet in Maine national park","Chevy Chase at home following five-week hospital stay for a 'heart issue'","Texas mayor refutes Biden administration claim that border is closed and secure","Trump tells Fox News the Biden admin 'enforcing nothing' as migrants make it into the US despite health order","Trump: Biden press conference will be nothing but 'softballs,' media 'protects him totally'","Phone scammer pretending to be McDonald's CEO nearly cons Pennsylvania restaurant out of thousands: report","Boston bomber Tsarnaev’s death sentence appeal to be heard by Supreme Court","Disney employee claims he was fired after tasting water from Disney Springs fountains, sharing video to TikTok","Biden, Erdogan exchange criticism amid worries White House giving Turkey the cold shoulder","Nearly 1 in 3 received COVID-19 vaccine dose, White House says","Biden world praises Clinton adviser who reportedly ignored Weinstein warning, dismissed Tara Reade's claims","Elvis Presley’s granddaughter Riley Keough becomes trained death doula after her brother Benjamin’s death","San Diego father faces child cruelty charge for elephant enclosure trespass: see the video","Grandparents in the coronavirus pandemic: A lost year, but now some hope","Even liberal media fed up with Biden administration over lack of access to border crisis, absence of pressers"]},{"source":"google-news","titles":["True Cooking Master Boy - Episode 23 - The Limitless Hero","Say hello to the Samsung Galaxy Book Pro and Pro 360","Boeing inducts first Growler for Block 2 upgrades | IAI Completed Barak Live-Fire Tests | Babcock, BAE, Thales Trying To Sell aircraft Carrier Technology To South Korea","Umamusume: Pretty Derby Season 2 - Episode 12 - Together","App ajusta lâmpadas Philips Hu‪e com base no seu humor","Let's Play Resident Evil 25th Anniversary Party - WHAT'S YOUR FAVOURITE RESIDENT EVIL MEMORY? - Eurogamer","Attack on Titan and Rose of Versailles Pony up for JRA Collaboration","Dow Reverses, Tech Stocks Climb As Yields Drop; Tesla Jumps On 3000 Price Target - Investor's Business Daily","Stephen A. is hyped about Oral Roberts making the Sweet 16 | First Take - ESPN","Build the Future of Business with Oracle Cloud Applications: Join us for Oracle Live March 24","QUIZ: Which Attack On Titan Character Are You?","FEATURE: Where Some of Anime's Most Successful Directors Got Their Start","Stephen A. reacts to LeBron's injury: The Clippers are under pressure | First Take - ESPN","Renewable natural gas is crucial to diversify our clean energy sources","Google Analytics 4: User Medium vs Session Medium","F-5E墜海》飛官羅尚樺傷重送醫17:45不治潘穎諄尚未尋獲 - 自由時報電子報","Карпин высказался о возвращении в «Спартак» - Lenta.ru","Gli smartwatch di Huawei in offerta su Amazon"]},{"source":"msnbc","titles":["Amid spring break chaos, Miami Beach Mayor calls situation 'perilous'","Why Trump's latest 'illegitimate election' nonsense matters","Rep. Tom Reed announces retirement after sexual misconduct accusation","Supreme Court to hear appeal of ruling that overturned Boston marathon bomber's death sentence","AstraZeneca Covid vaccine found to be effective against severe cases","Downplaying Jan. 6 riot, Ron Johnson won't quit while he's behind","'Evidence is trending' toward sedition charges for some Jan. 6 attackers, says fmr. lead investigator","Inside look at all-Black militia group","Weed is totally legal in 15 states. So why is the White House firing people for smoking it?","GOP Rep. Dan Crenshaw talks Biden immigration policy","Atlanta spa shooting suspect’s capture ‘without incident,’ solidarity with AAPI community in Capehart’s ‘Bye Line’","Addressing the humanitarian aspect of the border influx","Texas GOP ramps up attacks against voting access","Defense Secretary Austin visits Afghanistan as troop withdrawal deadline approaches","Atlanta mayor on Cherokee County Sheriff's capt. saying it was \"really bad day for\" spa shooting suspect","These Maryland cops responded to mental health emergency exactly the right way","Homeland Security Sec. Mayorkas to migrants: ‘The message is clear. Do not come.’","Fmr. Deputy Director of National Intelligence on ODNI report: We can’t expect Russia to back off now","The GOP's white nationalist future is taking root in America's colleges","Tennessee ramps up COVID-19 vaccinations"]},{"source":"national-review","titles":["Dem Rep. Breaks from Pelosi on Overturning Iowa House Race","Pathetic: After Three Weeks, Biden and the States Have Used Just 53 Percent of the Johnson & Johnson Vaccine","Disney World in the Age of COVID","The Jim Crow Canard","Black Intellectuals Demand Smith College Apologize to Smeared Workers, End ‘Anti-Bias’ Training","The FBI Director Comes Up with the Wrong Answer","Federal Judge Blocks South Carolina’s Heartbeat Bill","Still Waiting for the Maskless Texan Apocalypse","UNC’s ‘Common Language’ Advances Leftist Agenda","‘Kill List’","A SCOTUS Case That Could Shape Property Rights for Years to Come","Erdogan’s Love Affair with Islamic Finance","Trump to Launch Social Media Platform, Adviser Says","Vernal Readings","Study: Boosting Unemployment Reduces Job Applications","AstraZeneca Vaccine Safe, 79 Percent Effective in U.S. Trial","Photos Leaked by Texas Dem Reveal Inside of Overcrowded, Makeshift Border Patrol Facility","NAS Debuts Coalition to Stop Action Civics","A Nobel Peace Laureate and Horror in Ethiopia","In Defense of Private Schools"]},{"source":"nbc-news","titles":["Biden dispatches top officials to Mexico, Central America as border crisis grows","Cuba to vaccinate 150,000 frontline workers as part of final phase of clinical trial","Biden admin sanctions Chinese officials for abuses against Uyghurs","Watch: Drone flies over Iceland volcano, captures eruption","Mexico limits nonessential travel on Guatemala border, angering merchants","Supply of homes for sale fell by almost 30 percent year on year, the largest amount on record","Saudis propose ceasefire in Yemen","Atlanta shooting victim's husband says police detained him for hours","Trump endorses challenger to Ga. Secretary of State Raffensperger","Amid surge, border agents in Rio Grande Valley now releasing migrants without court dates","U.S. Supreme Court rebuffs Facebook appeal in user tracking lawsuit","Diplomats barred from court in Canadian's espionage trial in China","Concern grows for missing British woman last seen in U.S. Virgin Islands","A year ago in New York: A photographer reflects on the darkest days of the pandemic","Amazon workers strike in Italy over pandemic-driven delivery demands","Supreme Court to consider Boston Marathon bomber death sentence","Leon Black quits Apollo months earlier than expected following Jeffrey Epstein investment scandal","Covid vaccine jobs create mini hiring boom","D.C. statehood moves front and center with House hearing","Here are the 10 U.S. counties that have had the biggest increase in Asian residents"]},{"source":"newsweek","titles":["Biden Admin Joins U.S. Allies in Sanctioning Chinese Officials for Uyghur Human Rights Abuse","Atlanta Shooting Suspect's Church Expels Him, Says He Has 'Depraved Mind'","Trump Says China 'Laughs' at the U.S. Because of Fixation on 'Woke' Culture","What Causes a Ring Around the Moon? People in the U.S. Spot 'Halo' in the Sky","Viral Mars Conspiracy Theory Video Claims Humans Lived on Mars, Destroyed it in Nuclear War","The Amazon Union Effort Is a Progressive Tipping Point | Opinion","Donald Trump Says Mitch McConnell 'Hanging by a Thread,' Warns Republicans on Endorsement","Royal Diversity Drive Mocked on Twitter After Harry and Meghan's Oprah Interview","TikToker Calls TSA 'Transphobic' After Sharing 'Horrible' Airport Experience","Democrat Dean Phillips Rebukes Idea That Party Might Overturn Iowa Election Results","Convicted Bank Robber Charged in Capitol Riot Case Says He 'Can't Take' Stolen Election","Kylie Jenner's Past Charitable Donations Amid GoFundMe Controversy","'Sedition' Meaning As Charges Could See Capitol Rioters Face 20 Years in Prison","AstraZeneca Vaccine Deemed Safe in U.S. Trials as Distrust in Europe Spikes by Double Digits","'Deadly Illusions' Ending Explained: What Happened at the End of the Netflix Movie?","Fact Check: Is Joe Biden Spending $395 a Night for Migrants' Hotel Rooms?","More Than Half of Thousand Arrests in Florida Spring Break Chaos Were From Out of State","Saudi Arabia Offers Yemen Ceasefire Weeks After Joe Biden Pulled Plug on U.S. Support","PS5 Restock Updates for Antonline, Amazon, Walmart, Costco and More","Trump Closes Door on Brad Raffensperger by Endorsing Jody Hice for Georgia Secretary of State"]},{"source":"new-york-magazine","titles":["AstraZeneca’s COVID-19 Shot Found Safe and Effective in U.S. Study","It’s Police Versus Partiers in Miami Beach","Anti-Tax Lobby Seeks to Purge Democracy Supporters From the Republican Party","What It Cost to Survive","‘It Is Time to Start Complaining’: Asian Americans Rally in NYC Against Hate","Wife of Congressman Who Died From COVID Wins His House Seat","U.S. Expands Holding Facilities for Unaccompanied Migrant Children","The Smearing of Kristen Clarke","Conservative George W. Bush Is Now Too Liberal For His Party","When the Capitol Riot Came Home","Current Aide Accuses Cuomo of Sexual Harassment","Republican Tom Reed, a Potential Cuomo Challenger, Accused of Sexual Misconduct","Trumpy Georgia Congressman May Help Punish Raffensperger","The Flattening of the Atlanta Shootings","Putting Students Behind Plexiglass Isn’t Making Them Any Safer","Lindsey Boylan Says Cuomo Had Dartboard With Photo of de Blasio","The Fake Feminists Fighting the Equality Act","Democrats Advance Citizenship for 3.5 Million Immigrants","Trump’s Lackeys Are Teaming Up Again With Putin to Mock Biden","Is Complaining About ‘Cancel Culture’ the New Ideology of the Republican Party?"]},{"source":"politico","titles":["Former Newsom chief of staff to join San Francisco firm, ending Biden job speculation","Dem Rep. Filemón Vela won't seek reelection under new Texas map","Supreme Court agrees to hear case on Boston Marathon bomber's death sentence","The list keeps growing","Covid revives congestion pricing plans","Senate GOP slams brakes on immigration reform","Democrats’ next big legislative push","No child left offline","The latest Microsoft Exchange numbers","Tai takes charge at USTR","U.S. and allies set to announce coordinated sanctions on China over Uyghurs 'genocide'","U.S. and allies set to announce coordinated sanctions on China over Uyghurs 'genocide'. - POLITICO","All eyes on VILLARAIGOSA — RECALL likely to qualify — ‘GAVIN MUSSOLINI’? The trio that could take down NEWSOM — McCARTHY’s revised history","Trump hints at launching his own social media platform","Dems sell Covid bill at home and eye reconciliation for their return","PRITZKER PRIMES CAMPAIGN FUND — REMAP POLITICS — KARL ROVE TO HEADLINE KINZINGER EVENT","Murphy floats vaccine passports as N.J. tops nation in case rate","New Cuomo accuser — Open streets end up closed — Reed won’t run after misconduct allegation","WALSH out, JANEY in — MAYORAL CANDIDATES have some breakfast fun — BOSTON’S path to reopening","Tool created to aid cleanup from Microsoft hack in broad use"]},{"source":"reddit-r-all","titles":["The absolute worst scenario happened","Business Logic in Django Rest framework : django","Show HN: R/shouldibuythisproduct because Amazon reviews is broken","GraphWrap: extend your Django REST Framework API with a GraphQL interface with just two of lines of code. : django","My recommendation to learn Django : django","Piracy, Overcoming Gravity, and the Digital Edition","Has Y Combinator lost its way when the latest company is a Mac only widget?","My bank sent me 64 copies of the same debit card","Join David Borenstein for a reddit AMA at 2:30 p.m. ET to discuss his film on the price of being a social media star in China","YouTube doesn't handle space anymore","Florida is suffering from an epidemic of bald men renting billboards that need to be extended in order to fit their bald heads.","Django admin looks dated and is not mobile friendly, any better options ? : django","Reddit: Online Presence Indicators","Namecheap just snaked another domain off me","Any open source DRF projects? : django","I want this guy working on the unit tests : ProgrammerHumor","Protest note about user privacy changes by Reddit"]},{"source":"reuters","titles":["Turkish markets feel the heat after central bank shakeup - Reuters","UPDATE 1-Euro zone bond yields ease on Turkish tumult, European virus surge - Reuters","Dearth of interpreters leaves deaf students struggling in Sudan - Reuters","SkyBridge's Scaramucci files to launch bitcoin ETF with First Trust Advisors - Reuters","GRAPHIC-Turkish markets feel the heat after central bank shakeup - Reuters","Fed made $275 million from emergency facilities in 2020 - Reuters","New U.S. COVID-19 cases show weekly uptick for first time since January - Reuters","Fact Check-Post falsely claims a gallon of diesel was $1.69 when Biden took office","White House promises more J&J COVID-19 shots after launch stalls, declines to specify weekly shipment - Reuters","McLaren F1 sign 13-year-old American karter Ugochukwu - Reuters","Exclusive: Box explores sale amid pressure from Starboard - sources - Reuters Africa","Top Biden officials heading to Mexico for migration talks - Reuters","Jordan records 109 COVID-19 deaths, highest daily toll since start of pandemic","UPDATE 1-EasyJet says path to travel recovery will be bumpy","Swiss approve Johnson & Johnson COVID-19 vaccine, haven't bought any","Irish High Court to decide on Norwegian Air's debt restructuring this week - Reuters","Nigeria's Burna Boy says Grammy win marks 'big moment' for African music - Reuters","UPDATE 1-Slovak party leader quits to back demands for prime minister to go - Reuters","U.S. imposes Myanmar-related sanctions on individuals, entities: Treasury website - Reuters"]},{"source":"the-american-conservative","titles":["Hollywood’s Obsession with Rewriting History","Class Not Color at State","Consolidation and the Family Farm","The Ford Foundation is Funding CCP Propaganda","The Human Distinction","Peter Strzok’s ‘False Memory’ About the Origins of Crossfire Hurricane","H.R. 1 and Herd Count Democracy","Is Transgenderism Just a Celebrity Fad?","In Memoriam: Richard Driehaus","Romney Says America’s Leadership is Too Old to Take on China","To Flee or Not To Flee","Two Centuries of ‘That Blackguard Burton’","Twilight of the European Nationalists?","The Uses and Abuses of ‘Woke Capital’","Get Him Outta Here","The Other Deficit","The Right Can Win in States","Washington’s Anti-Russia Fixation","What Does the Future Hold for the GOP?","Something is Rotten in the Georgia Secretary of State’s Office"]},{"source":"the-hill","titles":["White headmaster placed on leave after forcing Black student to kneel during apology","Saudis propose ceasefire with Yemen's Houthi rebels","Microsoft to begin reopening main office next week","The Hill's 12:30 Report - Presented by Facebook - AstraZeneca to request US authorization","'Morning Joe' hosts criticize cancel culture over McCammond tweets","New York City high schools reopen","Biden appoints special envoy for Northern Triangle amid border surge","Sinema, Cornyn urge Biden to use 'full authorities' at border","Putin getting coronavirus vaccine Tuesday","New coalition launches against 'surveillance advertising'","CDC director warns of 'avoidable surge' of COVID-19 amid relaxing precautions","Biden officials to travel to Mexico to discuss border surge","1.5 million US air passengers fly in a day for first time since last March","New Mexico approves independent redistricting panel","Rep. Filemon Vela to retire from Congress","Investment firm Apollo names former SEC chief Clayton as chairman","Heritage Foundation president resigns","Club for Growth targets Trump critics Cheney, Anthony Gonzalez","Fox anchor in Trump interview mistakenly says DHS chief resigns, quickly corrects","Democratic lawmaker criticizes idea of overturning Iowa race"]},{"source":"the-huffington-post","titles":[]},{"source":"the-washington-post","titles":["Republicans can’t handle the truth about Capitol insurrectionists","As students with disabilities return to school, districts are unprepared to meet their needs, report says","Boston Mayor Marty Walsh expected to be confirmed as labor secretary","Protest over bill that expands British police powers sees 20 officers injured, vehicles torched","Sedition charges for Capitol rioters? The government leans into a historic decision","Trump predicted news ratings would 'tank if I'm not there.' He wasn't wrong...","Thousands of Australians evacuated as ‘phenomenal’ rain, severe flooding plagues country","Bowser, advocates to make their case for D.C. statehood at House committee hearing","Unbeaten U.S. men’s soccer team has an Olympic berth within reach","What is — and isn’t — unusual about the current situation at the U.S.-Mexico border","Ron Johnson’s vile new defense of Trump makes his defeat more urgent","The fate of the filibuster is fluid","Europe to impose sanctions on Chinese officials over abuses against Uyghurs, others","Supreme Court will consider restoring the Boston Marathon bomber’s death sentence","Nationals reliever Tanner Rainey wasn’t too concerned about his rough spring training debut","Preachers and their $5,000 sneakers: Why one man started INSTAGRAM account showing churches' wealth...","How District Trivia founder Nick Groves would spend a perfect day in D.C.","Doonesbury for Monday, March 22, 2021","Non Sequitur for Monday, March 22, 2021","Republicans’ war on voting feels increasingly frantic"]},{"source":"the-washington-times","titles":["New York Times: Current aide accuses Cuomo of sex harassment","Ousted NEW YORK TIMES reporter slams newsroom's culture: 'Mean, spiteful, vengeful place'...","‘Three Warfares’: U.S. pummeled by covert disinformation war waged by Russia, China","About to learn his definition of 'fair share'...","Terror suspects part of border surge...","For Biden, there's no place like a weekend home in Delaware","Pentagon goes to war with FOXNEWS over 'feminizing' military...","NEXT: Gun Control?","Obama, Bush, Clinton, Carter push COVID-19 vaccination","Jay Bhattacharya, Stanford doctor: Lockdowns 'single worst public health mistake' in last 100 years","Justice Amy Coney Barrett riles conservatives with moderate rulings...","Illegal immigrants shouldn't be included in congressional count","'It is not right': Bill offers hope that flyers of CIA's Air America will finally win recognition","'Extraordinary crisis': Democrats' revolutionary climate change bill aims to remake U.S. economy","$1,400 stimulus checks could be intercepted, consumer advocates warn","DARPA, CIA-contracted fund partner to stop China from gobbling up America's intellectual property","U.S. plans to deploy long-range missiles in Asia to deter 'our greatest strategic threat'","Portland federal officers forgotten as Pelosi eyes Congressional Gold Medal for Capitol Police","It's time to question Biden's mental health","'Almost useless' COVID-19 tests on migrants dropped in Texas town find 25% infected"]},{"source":"time","titles":["NFTs Are Shaking Up the Art World—But They Could Change So Much More","Pinterest and the Subtle Poison of Sexism and Racism in Silicon Valley","TIME Releases 3 Special Edition NFT Magazine Covers for Auction","The Democrats Must Work as Hard for Black Voters as We Worked for Them. Here’s What Needs to Be Done","Spain Is Going to Trial a 4-Day Work Week. Could the Idea Go Mainstream Post-Pandemic?","Why Europe’s AstraZeneca Vaccine Woes Are a Problem for the World","AstraZeneca Says U.S. Trial Data Shows Its COVID-19 Vaccine to Be 79% Effective","‘Disheartening.’ Biden Deplores Turkey’s Exit from a Global Pact to Protect Women From Violence","A Second Canadian Goes on Trial in China on Spying Charges","Doctors Protest in Myanmar as State Violence Continues","Meet the Russian ‘Information Warrior’ Seeking To Discredit COVID-19 Vaccines","President Biden Aims to Prevent Border Crossings From Swamping Agenda","U.S. Defense Chief Arrives in Kabul on First Trip to Afghanistan","Miami Imposes Emergency Curfew After Spring Break Crowds and Fights","Why MicroStrategy CEO Michael Saylor Bet Company Cash on Bitcoin—and Wants Other Corporations to Join In","Be Bold, Be Proud, Speak Up: Raising Asian American Daughters Now","What an Expert on Evangelicals and Sex Says About the Atlanta Shooter’s Claim He Had a Sex Addiction","Prosecutor: Man Charged With 1 Murder Says He Killed 16 People","Half of U.K. Adults Have Received At Least One Dose of COVID-19 Vaccine","Strong Earthquake Shakes Japan Triggering a Tsunami Advisory"]},{"source":"usa-today","titles":["Marlins security guard was apparently hitting a trash can during Alex Bregman's entire at-bat","Lego is launching a Space Shuttle Discovery set with more than 2,300 pieces","Don’t be surprised by Packers’ start to the offseason","Vikings CB Patrick Peterson plans to play cornerback","Free agent options still available for Cardinals at RB","Australia swamped by worst flooding in decades; spiders, snakes are everywhere","Decorated jiu-jitsu champion Gordon Ryan signs with ONE Championship","Joe Biden's border czar Roberta Jacobson heads to Mexico to develop plan to 'manage migration'","#13 Wright State vs. #4 Arkansas live stream, Women's NCAA Tournament, TV channel, how to watch","Deshaun Watson at 11 lawsuits alleging sexual misconduct after more women come forward","Boy catches record catfish as Christmas gift pays off big-time","Steelers lose another OLB to the Titans","Tennessee Titans agree to terms with OLB Ola Adeniyi","Michael Brockers: ‘Level up’ comment was a ‘fan booster,’ not disrespect to Jared Goff","Watch: Blue whale ‘explodes out of the sea like a submarine’","Saudi Arabia proposes Yemen ceasefire after Biden administration ends support","Riley Keough completes training to become a death doula. Here's what that means.","Review: Bob Odenkirk livens up formulaic 'Nobody' as a middle-aged 'John Wick' type","(2) Iowa vs. (7) Oregon live stream, NCAA March Madness, TV channel, how to watch","Mock draft Monday: 7 full rounds of Browns choices"]},{"source":"vice-news","titles":["Sexts Are Still Being Used as Evidence in Rape Trials","Kozaburo contemplates Japan’s spiritual history for AW21","Ransomwared Bank Tells Customers It Lost Their SSNs","Scientists Have Discovered a New Pattern In a Repeating Signal from Space","Hobby Lobby Exposed 138GB of Data","The Capital of Mexican Cuisine Is Cracking Down on Junk Food","Everything we know about the Charli XCX documentary","Amazon Workers in Italy Are Striking In Protest of Grueling Working Conditions","Capitol Rioters Could Be Facing Serious Sedition Charges, Says Former Prosecutor","Weekly Horoscope: March 22 - 28","Amazon Illegally Interrogated Worker Who Led First COVID-19 Strikes, NLRB Says","Not Even Trump Fans Care About Trump’s Social Network","'It's Going to End Up Like Boeing:' How Freight Rail Is Courting Catastrophe","We’re in the Beginning of a PS1 Aesthetics Renaissance","How Big Lizards and Bald Assassins Reclaimed My Love of Learning","Why the Original 'Resident Evil' Is Still Scary 25 Years Later","Photos: Vans Burned and Cops Suffer Broken Bones in Anti-Police Power Riots","Why Twitter is so obsessed with these 1970s conversation pits","Lana Del Rey wants revenge","This Media Outlet Stopped Hiring Women After Four Were Killed by Extremists"]}]